[
  {
    "title": "AskNews Research",
    "url": "",
    "snippet": "Here are the relevant news articles:\n\n**Democrats Post 'Political Trial against Kristi Noem' Amid ICE Violence and National Guard Activation in Minnesota**\nThe Democratic Party of the United States posted a single message on its official X (formerly Twitter) account: 'Political Trial against Kristi Noem,' generating national anticipation in the U.S. The post follows a series of incidents in Minneapolis involving U.S. Immigration and Customs Enforcement (ICE) agents, including the deaths of three individuals: Alex Pretti, a 37-year-old U.S. citizen shot multiple times; Renee Good, another 37-year-old U.S. citizen fatally shot inside a vehicle; and a Venezuelan immigrant who also died during an ICE operation. These events have sparked widespread protests against ICE's active immigration policies under former President Donald Trump. In response to escalating unrest, Minnesota Governor Tim Walz activated the National Guard to restore order. The situation has raised the possibility that Trump could invoke the Insurrection Act to federalize the state's National Guard, thereby stripping the governor of command. Historical precedents for such federalization include President Eisenhower's 1957 deployment to Little Rock, Arkansas; President Johnson's 1965 intervention in Alabama; President Bush's 1992 federalization during the Los Angeles riots; and President Kennedy's 1962 action in Mississippi to enforce desegregation at the University of Mississippi.\nOriginal language: es\nPublish date: January 25, 2026 08:59 PM\nSource: [El Nuevo Diario](https://elnuevodiario.com.do/democratas-publican-en-su-cuenta-oficial-un-unico-mensaje-sin-mas-detalles-juicio-politico-contra-kristi-noem/)\n\n**Björn af Kleen: ICE Brutality in Minneapolis Signals How Trump Could Secure Power in the Midterm Elections**\nThe article claims that U.S. Immigration and Customs Enforcement (ICE), under the Trump administration, has become a tool for political repression, citing its actions in Minneapolis as evidence. It alleges that ICE has detained a five-year-old child during a school commute, labeled activists as 'domestic terrorists,' and conducted operations that provoke unrest in Democratic-leaning states. According to Robert Kagan, a prominent American historian and critic of the Republican Party, these actions are part of a strategic effort to create conditions that would justify invoking the Insurrection Act of 1807—granting the federal military authority over state law enforcement. This could allow President Trump to deploy troops to seize ballots and influence the outcome of the November 2026 midterm elections, consolidating Republican control of Congress. The article draws a parallel to the 1957 Little Rock crisis, where President Eisenhower used federal troops to enforce desegregation, but warns that a similar military intervention today could instead entrench a white supremacist autocracy. The piece presents these claims without direct attribution to primary sources, relying on commentary from Kagan and assertions about ICE's role in political strategy. It references ICE’s recruitment ads describing agents as 'patriots' removing 'murderers, pedophiles, gang members, rapists' from the U.S., and notes ICE’s increased funding and power under Trump. The article also references Trump’s own statements, including his claim that he should have mobilized the National Guard to seize voting machines after the 2020 election and his current consideration of using the Insurrection Act in Minneapolis.\nOriginal language: sv\nPublish date: January 25, 2026 10:02 AM\nSource: [Dagens Nyheter](https://www.dn.se/varlden/bjorn-af-kleen-ice-brutalitet-i-minneapolis-visar-hur-trump-kan-sakra-makten-i-mellanarsvalet/)\n\n**Cruelty as Propaganda: How Fear Is Being Weaponized in the U.S.**\nThe article argues that the current U.S. administration, under Donald Trump, is using cruelty and fear as a form of propaganda to intimidate immigrants and the general public. It cites multiple incidents, including the fatal shooting of Alex Pretti, a 37-year-old man carrying a legally permitted firearm at a protest, and the killing of Renée Good, a woman shot at close range. Despite video evidence showing no clear threat from Pretti—some footage suggesting his weapon was taken before he was shot—the federal authorities immediately claimed legitimate self-defense, a claim the article strongly disputes. The article criticizes the lack of cooperation between federal agents (ICE) and local police, the absence of independent investigations into federal shootings, and the politicization of the FBI under Kash Patel, with prosecutors and agents resigning over the administration’s narrative. It notes that ICE agents in Minneapolis-St. Paul outnumber local police by a factor of three to four, and that federal agents, untrained in crowd control, operate without oversight. The article further claims that Trump is using these incidents to justify declaring a state of emergency under the Insurrection Act, aiming to deploy the U.S. military domestically—a move historically used during racial riots and civil unrest. The author warns that Trump’s strategy is not only to scare immigrants but to instill fear in the entire population, as fear is central to his political power. The article concludes with the assertion: 'There will be more deaths.'\nOriginal language: fr\nPublish date: January 25, 2026 10:00 AM\nSource: [La Presse.ca](https://www.lapresse.ca/international/chroniques/2026-01-25/la-cruaute-comme-propagande.php)\n\n**Minneapolis: Trump Accuses Local Authorities of Inciting 'Insurrection' Against His Government**\nOn Saturday, January 24, 2026, U.S. federal agents shot and killed a 37-year-old white American man with no history of violence during a raid in Minneapolis, Minnesota. President Donald Trump accused Governor Tim Walz and Mayor Jacob Frey of inciting insurrection against the federal government, claiming their rhetoric promotes disorder and undermines federal operations. In a post on Truth Social, Trump demanded full support for ICE operations in Minnesota and criticized the absence of local police during the raid, alleging that state and city leaders left federal agents unprotected. He shared an image of an object he claimed was a weapon carried by the man, suggesting the agent's use of force was justified. The incident sparked immediate protests and intensified political conflict between the White House and Democratic leaders in Minnesota. Since January 1, Minnesota has seen recurring protests against federal immigration enforcement. On January 15, Trump had already threatened to invoke the Insurrection Act of 1807, which allows the use of the military to suppress civil unrest when local authorities fail to maintain order. Governor Walz responded by condemning the federal operation, stating it led to a death, indiscriminate use of tear gas, and clashes with demonstrators, causing instability. He confirmed he had spoken with White House officials and requested the removal of ICE from the state, while also announcing an investigation into the shooting and rejecting premature conclusions before the facts are fully examined.\nOriginal language: pt\nPublish date: January 24, 2026 09:34 PM\nSource: [Diário do Centro do Mundo](https://www.diariodocentrodomundo.com.br/minneapolis-trump-acusa-autoridades-locais-de-incitarem-insurreicao-contra-seu-governo/)\n\n**Did Trump Just Signal He's Going to Invoke Insurrection Act?**\nOn January 24, 2026, an armed man confronted Border Patrol agents in Minnesota, was shot during an attempt to disarm him, and was found carrying a firearm and two additional magazines. The Department of Homeland Security confirmed the suspect was armed and posed a direct threat. President Donald Trump responded via Truth Social, framing the incident as evidence of broader lawlessness, failed leadership, and corruption in Minnesota. He questioned why local police were not allowed to assist ICE agents, suggesting they were ordered off duty, and accused the mayor and governor of inciting insurrection through their rhetoric. Trump referenced the Insurrection Act, stating he does not believe it is necessary at this moment but would invoke it if needed, emphasizing its historical precedent—used by over 40% of U.S. presidents. This follows a prior incident involving the death of Renee Good, who attempted to kill an ICE agent with her car. In a recent interview on NewsNation, Trump reiterated that the Insurrection Act is not extraordinary and could be invoked if federal law enforcement cannot be upheld. The article concludes with a call to action for readers to support PJ Media’s 'America-first journalism' with a 60% discount using code FIGHT.\nOriginal language: en\nPublish date: January 24, 2026 02:50 PM\nSource: [PJ Media](https://pjmedia.com/matt-margolis/2026/01/24/did-trump-just-signal-hes-going-to-invoke-insurrection-act-n4948708)\n\n**'The real danger is not ice, but ICE' — Over 100 clergy arrested in Minnesota protest against immigration enforcement**\nOn January 23, 2026 (local time), approximately 100 clergy members opposing immigration enforcement were arrested at the Minneapolis–Saint Paul International Airport in Minnesota, USA, during a protest against the Department of Homeland Security's (DHS) 'largest immigration enforcement operation in history.' The demonstrators, part of a broader movement across Minnesota, demanded airlines halt deportation flights and called for a de facto general strike by urging residents to stop using workplaces, schools, and businesses. Simultaneously, thousands of residents gathered in downtown Minneapolis despite temperatures as low as -23°C. The protests were triggered by the fatal shooting of Rene Nicole Good, a U.S. citizen, by an ICE officer on January 7, 2026. Protesters emphasized that the real danger is not 'ice' (the weather), but 'ICE' (Immigration and Customs Enforcement), highlighting the symbolic weight of the acronym. The movement has seen over 700 businesses across Minnesota close in solidarity. On January 20, 2026, nationwide protests involving thousands of workers and students occurred across the U.S. to oppose the Trump administration’s anti-immigration policies. President Donald Trump threatened to invoke the Insurrection Act to suppress the protests in Minnesota, stating that if corrupt politicians fail to stop 'agitators and rebels' attacking 'patriotic agents' of ICE, he would take decisive action as past presidents have done. Public opinion, however, shows a majority opposing Trump’s threat.\nOriginal language: ko\nPublish date: January 24, 2026 05:51 AM\nSource: [경향신문](https://www.khan.co.kr/article/202601241451001)\n\n**Democrats Post 'Political Trial against Kristi Noem' Amid ICE Violence and National Guard Activation in Minnesota**\nThe Democratic Party of the United States posted a single message on its official X (formerly Twitter) account: 'Political Trial against Kristi Noem,' generating national anticipation in the U.S. The post follows a series of incidents in Minneapolis involving U.S. Immigration and Customs Enforcement (ICE) agents, including the deaths of three individuals: Alex Pretti, a 37-year-old U.S. citizen shot multiple times; Renee Good, another 37-year-old U.S. citizen fatally shot inside a vehicle; and a Venezuelan immigrant who also died during an ICE operation. These events have sparked widespread protests against ICE's active immigration policies under former President Donald Trump. In response to escalating unrest, Minnesota Governor Tim Walz activated the National Guard to restore order. The situation has raised the possibility that Trump could invoke the Insurrection Act to federalize the state's National Guard, thereby stripping the governor of command. Historical precedents for such federalization include President Eisenhower's 1957 deployment to Little Rock, Arkansas; President Johnson's 1965 intervention in Alabama; President Bush's 1992 federalization during the Los Angeles riots; and President Kennedy's 1962 action in Mississippi to enforce desegregation at the University of Mississippi.\nOriginal language: es\nPublish date: January 25, 2026 08:59 PM\nSource: [El Nuevo Diario](https://elnuevodiario.com.do/democratas-publican-en-su-cuenta-oficial-un-unico-mensaje-sin-mas-detalles-juicio-politico-contra-kristi-noem/)\n\n**Björn af Kleen: ICE Brutality in Minneapolis Signals How Trump Could Secure Power in the Midterm Elections**\nThe article claims that U.S. Immigration and Customs Enforcement (ICE), under the Trump administration, has become a tool for political repression, citing its actions in Minneapolis as evidence. It alleges that ICE has detained a five-year-old child during a school commute, labeled activists as 'domestic terrorists,' and conducted operations that provoke unrest in Democratic-leaning states. According to Robert Kagan, a prominent American historian and critic of the Republican Party, these actions are part of a strategic effort to create conditions that would justify invoking the Insurrection Act of 1807—granting the federal military authority over state law enforcement. This could allow President Trump to deploy troops to seize ballots and influence the outcome of the November 2026 midterm elections, consolidating Republican control of Congress. The article draws a parallel to the 1957 Little Rock crisis, where President Eisenhower used federal troops to enforce desegregation, but warns that a similar military intervention today could instead entrench a white supremacist autocracy. The piece presents these claims without direct attribution to primary sources, relying on commentary from Kagan and assertions about ICE's role in political strategy. It references ICE’s recruitment ads describing agents as 'patriots' removing 'murderers, pedophiles, gang members, rapists' from the U.S., and notes ICE’s increased funding and power under Trump. The article also references Trump’s own statements, including his claim that he should have mobilized the National Guard to seize voting machines after the 2020 election and his current consideration of using the Insurrection Act in Minneapolis.\nOriginal language: sv\nPublish date: January 25, 2026 10:02 AM\nSource: [Dagens Nyheter](https://www.dn.se/varlden/bjorn-af-kleen-ice-brutalitet-i-minneapolis-visar-hur-trump-kan-sakra-makten-i-mellanarsvalet/)\n\n**Cruelty as Propaganda: How Fear Is Being Weaponized in the U.S.**\nThe article argues that the current U.S. administration, under Donald Trump, is using cruelty and fear as a form of propaganda to intimidate immigrants and the general public. It cites multiple incidents, including the fatal shooting of Alex Pretti, a 37-year-old man carrying a legally permitted firearm at a protest, and the killing of Renée Good, a woman shot at close range. Despite video evidence showing no clear threat from Pretti—some footage suggesting his weapon was taken before he was shot—the federal authorities immediately claimed legitimate self-defense, a claim the article strongly disputes. The article criticizes the lack of cooperation between federal agents (ICE) and local police, the absence of independent investigations into federal shootings, and the politicization of the FBI under Kash Patel, with prosecutors and agents resigning over the administration’s narrative. It notes that ICE agents in Minneapolis-St. Paul outnumber local police by a factor of three to four, and that federal agents, untrained in crowd control, operate without oversight. The article further claims that Trump is using these incidents to justify declaring a state of emergency under the Insurrection Act, aiming to deploy the U.S. military domestically—a move historically used during racial riots and civil unrest. The author warns that Trump’s strategy is not only to scare immigrants but to instill fear in the entire population, as fear is central to his political power. The article concludes with the assertion: 'There will be more deaths.'\nOriginal language: fr\nPublish date: January 25, 2026 10:00 AM\nSource: [La Presse.ca](https://www.lapresse.ca/international/chroniques/2026-01-25/la-cruaute-comme-propagande.php)\n\n**Ska straffas för att de haft mage att rösta fel: A Dark Warning for American Democracy**\nThe article discusses escalating violence and authoritarian trends in the United States under the influence of Donald Trump and his close advisor Stephen Miller, particularly focusing on the use of ICE agents in Minnesota following the state's vote against Trump in the 2024 presidential election. It describes the fatal shooting of Alex Jeffrey Pretti, a 37-year-old nurse in Minneapolis, by masked federal agents, citing the New York Times' report that he was shot at least ten times. The piece claims that these operations, justified on paper as targeting undocumented immigrants, are in practice used to intimidate and punish citizens for voting against Trump. Stephen Miller, portrayed as a self-identified racist with a fanatical ideological vision to 'protect Western civilization' through violence, is said to have designed these actions. The article cites historian Robert Kagan, who warns that the brutality is intended to desensitize the public to state violence, paving the way for election interference during the upcoming midterm elections. The article further notes Trump’s threat to invoke the 'Insurrection Act' in Minnesota and his previous threat to invade Greenland, asserting that these developments threaten not only U.S. democracy but also European and Swedish security. Despite Trump’s current unpopularity among American voters and his declining support, the article argues that the U.S. democracy is now 'hanging by a thread,' echoing Benjamin Franklin’s warning that a republic endures only if citizens preserve it. The piece concludes with a sense of existential dread about the future of democracy.\nOriginal language: sv\nPublish date: January 24, 2026 10:05 PM\nSource: [Aftonbladet](https://www.aftonbladet.se/a/wr8P2n)\n\n**Minneapolis: Trump Accuses Local Authorities of Inciting 'Insurrection' Against His Government**\nOn Saturday, January 24, 2026, U.S. federal agents shot and killed a 37-year-old white American man with no history of violence during a raid in Minneapolis, Minnesota. President Donald Trump accused Governor Tim Walz and Mayor Jacob Frey of inciting insurrection against the federal government, claiming their rhetoric promotes disorder and undermines federal operations. In a post on Truth Social, Trump demanded full support for ICE operations in Minnesota and criticized the absence of local police during the raid, alleging that state and city leaders left federal agents unprotected. He shared an image of an object he claimed was a weapon carried by the man, suggesting the agent's use of force was justified. The incident sparked immediate protests and intensified political conflict between the White House and Democratic leaders in Minnesota. Since January 1, Minnesota has seen recurring protests against federal immigration enforcement. On January 15, Trump had already threatened to invoke the Insurrection Act of 1807, which allows the use of the military to suppress civil unrest when local authorities fail to maintain order. Governor Walz responded by condemning the federal operation, stating it led to a death, indiscriminate use of tear gas, and clashes with demonstrators, causing instability. He confirmed he had spoken with White House officials and requested the removal of ICE from the state, while also announcing an investigation into the shooting and rejecting premature conclusions before the facts are fully examined.\nOriginal language: pt\nPublish date: January 24, 2026 09:34 PM\nSource: [Diário do Centro do Mundo](https://www.diariodocentrodomundo.com.br/minneapolis-trump-acusa-autoridades-locais-de-incitarem-insurreicao-contra-seu-governo/)\n\n**Trump Accuses Democrats of Inciting Uprising After Police Shootings in Minneapolis**\nFollowing deadly police shootings of a man in Minneapolis, U.S. President Donald Trump accused Democratic politicians, including Minneapolis Mayor Jacob Frey and Minnesota Governor Tim Walz, of inciting an 'uprising' through their rhetoric. Trump claimed their 'bold, dangerous, and arrogant language' was fueling unrest, and reiterated his threat to invoke the Insurrection Act of 1807—a law allowing the President to deploy the military domestically to suppress armed rebellions or internal violence. This threat came amid ongoing federal operations in Minneapolis, where thousands of federal agents have been deployed to enforce immigration laws, targeting undocumented migrants. On January 24, 2026, a 37-year-old U.S. citizen with a valid gun permit was shot by federal officers after approaching them with a firearm. Minnesota Governor Walz condemned the shooting, demanded the withdrawal of federal agents, and called for state-level investigators to examine the incident. Protests continue in Minneapolis against the actions of U.S. Immigration and Customs Enforcement (ICE).\nOriginal language: de\nPublish date: January 24, 2026 08:02 PM\nSource: [AFP](http://doc.afp.com/93WC666)\n\n**Trump Accuses Democratic Officials of 'Inciting Insurrection' After Fatal ICE Shooting in Minneapolis**\nDonald Trump, the President of the United States, accused the Mayor of Minneapolis and the Governor of Minnesota of 'inciting insurrection' on Saturday, following the death of a civilian at the hands of Immigration and Customs Enforcement (ICE) agents. In a post on his Truth Social platform, Trump stated that 'the mayor and the governor are inciting insurrection with their pompous, dangerous, and arrogant rhetoric,' escalating his confrontation with Mayor Jacob Frey and Governor Tim Walz, both Democrats. Trump had previously threatened to invoke the Insurrection Act to send federal troops to Minnesota.\nOriginal language: es\nPublish date: January 24, 2026 07:34 PM\nSource: [AFP](http://doc.afp.com/93W79CY)\n\n**Did Trump Just Signal He's Going to Invoke Insurrection Act?**\nOn January 24, 2026, an armed man confronted Border Patrol agents in Minnesota, was shot during an attempt to disarm him, and was found carrying a firearm and two additional magazines. The Department of Homeland Security confirmed the suspect was armed and posed a direct threat. President Donald Trump responded via Truth Social, framing the incident as evidence of broader lawlessness, failed leadership, and corruption in Minnesota. He questioned why local police were not allowed to assist ICE agents, suggesting they were ordered off duty, and accused the mayor and governor of inciting insurrection through their rhetoric. Trump referenced the Insurrection Act, stating he does not believe it is necessary at this moment but would invoke it if needed, emphasizing its historical precedent—used by over 40% of U.S. presidents. This follows a prior incident involving the death of Renee Good, who attempted to kill an ICE agent with her car. In a recent interview on NewsNation, Trump reiterated that the Insurrection Act is not extraordinary and could be invoked if federal law enforcement cannot be upheld. The article concludes with a call to action for readers to support PJ Media’s 'America-first journalism' with a 60% discount using code FIGHT.\nOriginal language: en\nPublish date: January 24, 2026 02:50 PM\nSource: [PJ Media](https://pjmedia.com/matt-margolis/2026/01/24/did-trump-just-signal-hes-going-to-invoke-insurrection-act-n4948708)\n\n**Opinion: Less alienation, more cooperation - Concord Monitor**\nThe Concord Monitor editorial expresses concern over the growing polarization in U.S. political discourse, citing a series of extreme and seemingly contradictory news events, including former President Trump suggesting the use of the 1874 Insurrection Act in Minneapolis, Rep. Kristin Noble proposing 'politically segregated schools' for Democrats and Republicans, a search of a Washington Post journalist’s home at the Defense Department’s request, and President Trump accusing Congresswoman Maggie Goodlander and four others of 'seditious behavior, punishable by death.' The author questions the credibility of these reports, noting some may be satire or conspiracy theories, but emphasizes the seriousness of Noble’s proposal to create separate public schools for Democrats and Republicans. Drawing from personal memory of a school policy allowing religious education absences, the author reflects on how such segregation created division, misunderstanding, and alienation between groups. The editorial argues that education should foster exposure to diverse beliefs and ideas, promoting cooperation over alienation. It concludes that Noble’s controversial idea, though untenable, may serve as a catalyst for reimagining education to cultivate democratic citizenship, inclusivity, and societal cohesion.\nOriginal language: en\nPublish date: January 24, 2026 11:00 AM\nSource: [Concord Monitor](https://www.concordmonitor.com/2026/01/24/my-turn-politically-segregated-schools/)\n\n**'The real danger is not ice, but ICE' — Over 100 clergy arrested in Minnesota protest against immigration enforcement**\nOn January 23, 2026 (local time), approximately 100 clergy members opposing immigration enforcement were arrested at the Minneapolis–Saint Paul International Airport in Minnesota, USA, during a protest against the Department of Homeland Security's (DHS) 'largest immigration enforcement operation in history.' The demonstrators, part of a broader movement across Minnesota, demanded airlines halt deportation flights and called for a de facto general strike by urging residents to stop using workplaces, schools, and businesses. Simultaneously, thousands of residents gathered in downtown Minneapolis despite temperatures as low as -23°C. The protests were triggered by the fatal shooting of Rene Nicole Good, a U.S. citizen, by an ICE officer on January 7, 2026. Protesters emphasized that the real danger is not 'ice' (the weather), but 'ICE' (Immigration and Customs Enforcement), highlighting the symbolic weight of the acronym. The movement has seen over 700 businesses across Minnesota close in solidarity. On January 20, 2026, nationwide protests involving thousands of workers and students occurred across the U.S. to oppose the Trump administration’s anti-immigration policies. President Donald Trump threatened to invoke the Insurrection Act to suppress the protests in Minnesota, stating that if corrupt politicians fail to stop 'agitators and rebels' attacking 'patriotic agents' of ICE, he would take decisive action as past presidents have done. Public opinion, however, shows a majority opposing Trump’s threat.\nOriginal language: ko\nPublish date: January 24, 2026 05:51 AM\nSource: [경향신문](https://www.khan.co.kr/article/202601241451001)\n\n**The Insurrection Act: A Timeline**\nThe Insurrection Act, enacted in 1807, has been invoked 30 times by 15 U.S. Presidents since its passage. A timeline of these invocations was shared on January 16, 2026, as a reference to provide historical context amid speculation that the Act might be invoked in the near future.\nOriginal language: en\nPublish date: January 16, 2026 12:16 PM\nSource: [Ricochet](https://ricochet.com/1920938/the-insurrection-act-a-timeline/)\n\n**What is the Insurrection Act? The 19th century law Trump wants to use on Minnesota's anti-ICE protests| WION Explains**\nOn January 15, 2026, Donald Trump threatened to invoke the Insurrection Act against anti-ICE protests in Minnesota, accusing state leaders of failing to control 'professional agitators' and labeling the protests as insurrection. The Insurrection Act, a 19th-century law first enacted in 1792 and revised in 1807, allows the U.S. president to deploy the military domestically for civilian law enforcement during 'armed rebellion' or 'domestic violence,' overriding the Posse Comitatus Act, which normally prohibits military involvement in domestic law enforcement. The law has been invoked approximately 30 times in U.S. history, with the last use in 1992 by George H.W. Bush during the Los Angeles riots following the Rodney King verdict. Trump has issued similar threats in Democratic-run states like California, Illinois, and Oregon, and has previously used Title 10 authority to deploy National Guard troops under federal control during 'a rebellion or danger of a rebellion,' though without police powers. His attempt to deploy troops to Chicago was blocked by the Supreme Court, which ruled he 'failed to identify a source of authority' for military enforcement in Illinois. The court’s decision marked a rare setback for Trump, despite the conservative majority on the bench.\nOriginal language: en\nPublish date: January 16, 2026 09:35 AM\nSource: [WION](https://www.wionews.com/world/what-is-the-insurrection-act-the-19th-century-law-trump-wants-to-use-on-minnesota-s-anti-ice-protests-wion-explains-1768554284225)\n\n**Insurrection Act of 1807: What It Is and Why Trump Wants to Invoke It in Minnesota**\nThe Insurrection Act of 1807, which Donald Trump seeks to invoke in Minnesota, grants the U.S. president authority to deploy the U.S. Army and 'federalize' the National Guard at the national level to suppress insurrections, rebellions, or domestic violence. According to the Brennan Center for Justice, the act consists of a series of resolutions enacted by Congress between 1792 and 1871.\nOriginal language: es\nPublish date: January 16, 2026 04:48 AM\nSource: [France 24](https://www.france24.com/es/video/20260116-ley-de-insurrecci%C3%B3n-de-1807-qu%C3%A9-es-y-por-qu%C3%A9-trump-la-quiere-invocar-en-minnesota)\n\n**What is the Insurrection Act? Here is everything you need to know**\nThe Insurrection Act of 1807 is a federal law that permits the U.S. president to deploy military forces within the United States to enforce federal law, suppress insurrections, or protect constitutional rights when specific conditions are met, according to PolitiFact. It overrides the Posse Comitatus Act, which generally prohibits military involvement in domestic law enforcement. The law may be invoked if a state requests federal assistance, federal law cannot be enforced through normal means, or state authorities are unable or unwilling to protect constitutional rights—though a governor's request is not required in all cases. Historically, the Act has been invoked dozens of times, notably during school desegregation in the 1950s and 1960s, and most recently in 1992 during the federal response to the Los Angeles riots. Since then, its use has been rare. If invoked, the president can deploy active-duty military or federally activated National Guard units domestically, but civilian government and courts remain intact—distinguishing it from martial law, which involves military control over civilian functions and is not created by the Insurrection Act. The law has recently gained attention after former President Donald Trump stated on Truth Social on January 15, 2026, that he could invoke it in Minnesota amid protests related to federal immigration enforcement.\nOriginal language: en\nPublish date: January 15, 2026 07:14 PM\nSource: [The Dallas Morning News](https://www.dallasnews.com/news/national/2026/01/15/insurrection-act-minnesota-donald-trump/)\n\n**What Is The Insurrection Act?: Everything You Need To Know**\nThe Insurrection Act of 1807 is a U.S. federal law that grants the president authority to deploy the military domestically during times of severe civil unrest, insurrection, or rebellion when state governments are unable to maintain order. It has been invoked at least 30 times in U.S. history, including during the Civil War, the Civil Rights Movement, and the 1992 Rodney King riots in California. The law is intended for extreme breakdowns of law and order, not for routine protests or political disagreements. Concerns have been raised by experts and civil liberties advocates about the potential misuse of the Act, particularly in the context of protests following the shooting of Renee Nicole Good, a 37-year-old mother, by an ICE agent in Minnesota. Critics warn that deploying the military in such situations could create a war-zone atmosphere, disproportionately impact Black communities, and set a dangerous precedent for future abuse of presidential power. The article emphasizes that the Insurrection Act was not designed to manage protests or political grievances, and its invocation risks undermining civil rights and normal law enforcement. The piece also notes that the law grants significant presidential authority, which affects all Americans during crises. The article was published on January 15, 2026, by praisebaltimore.com.\nOriginal language: en\nPublish date: January 15, 2026 06:00 PM\nSource: [praisebaltimore.com](https://praisebaltimore.com/1850859/what-is-the-insurrection-act-explainer/)\n\n**What Is the Insurrection Act of 1807?**\nThe Insurrection Act of 1807 is a set of statutes enacted by Congress that grants the U.S. president the authority to deploy federal military forces for domestic law enforcement under specific conditions. An initial version was passed in 1792 to empower the militia to execute federal laws, suppress insurrections, and repel invasions, and has since been amended multiple times. According to a 2006 Congressional Research Service report, the president must first demand that 'insurgents' disperse before deploying troops; if order is not restored, an executive order may be issued. The law was designed as a backstop when state or local authorities are unable or unwilling to maintain public order, as explained by law professor Stephen I. Vladeck. However, the use of military forces for domestic law enforcement is limited by constitutional protections for civil liberties and state sovereignty. The Posse Comitatus Act of 1878 generally prohibits the military from acting as a domestic police force. Exceptions exist under the Insurrection Act, including when a state government requests federal military assistance or when the president determines that unrest is obstructing federal laws.\nOriginal language: en\nPublish date: January 15, 2026 02:31 PM\nSource: [Star Tribune](https://www.startribune.com/what-is-the-insurrection-act-of-1807/601564593)\n\n**The History of the Insurrection Act in America**\nThe Insurrection Act of 1807 grants the U.S. President the authority to deploy federal troops within the United States to suppress civil disorder, insurrection, or rebellion, effectively allowing federal override of state authority during crises. Enacted under Thomas Jefferson in response to frontier conflicts and fears of domestic uprisings, the Act has been invoked sparingly. Early uses include 1808 to enforce a trade embargo and 1833 when Andrew Jackson used it to counter South Carolina’s nullification of federal tariffs. During the Civil War, Abraham Lincoln invoked it in 1861 to suppress the Confederate rebellion—the most extensive use in U.S. history. In the Reconstruction era, Ulysses S. Grant used it in 1871 to combat the Ku Klux Klan in South Carolina. In the 20th century, the Act was used for civil rights enforcement: Dwight Eisenhower deployed troops in 1957 to enforce desegregation at Little Rock Central High School; John F. Kennedy in 1962 sent troops to the University of Mississippi to protect James Meredith; and Lyndon Johnson used it during the 1967 Detroit riots. George H.W. Bush invoked it in 1992 during the Los Angeles riots following the Rodney King verdict—marking the last formal use. The Act has since remained dormant but politically salient, discussed after Hurricane Katrina (2005) and during 2020 protests, though never invoked again. Despite its rarity, the Act remains a potent legal tool, symbolizing federal authority in moments of national crisis.\nOriginal language: en\nPublish date: October 18, 2025 10:14 PM\nSource: [DaveManuel.com](https://www.davemanuel.com/2025/10/18/insurrection-act-history-united-states/)\n\n**Every time Insurrection Act was invoked in US history as Trump floats use**\nPresident Donald Trump has suggested invoking the Insurrection Act of 1807 to deploy federal troops in cities like Chicago, Los Angeles, and Portland to address crime and protests over immigration policy. The Insurrection Act permits a president to use military forces domestically when a state cannot suppress an insurrection or defies federal law, without requiring a governor’s consent. However, critics argue that no actual insurrection exists, making such a move legally and constitutionally questionable. Legal experts, including former federal prosecutor Shanlon Wu, state that while Trump has theoretical authority, there is no factual basis for invoking the act in the context of general crime. The act has been invoked dozens of times historically, most notably during the Civil War (Abraham Lincoln, 1861), Reconstruction (Ulysses S. Grant, eight times), and civil rights enforcement (Eisenhower, Kennedy, Johnson). The last use was in 1992 after the Rodney King police brutality verdict sparked riots in Los Angeles. Illinois and Oregon have sued to block federal troop deployments. Lawmakers like Representative Ilhan Omar and Senator Tammy Duckworth have condemned the proposal as unconstitutional and authoritarian, arguing it would be used to intimidate cities rather than protect citizens. Former federal prosecutor Joyce White Vance emphasized the act is meant for extreme situations like rebellions or invasions, not routine crime. White House Deputy Chief of Staff Stephen Miller claimed the situation constitutes 'domestic terrorism' and 'insurrection.' Professor Robert Reich warned the move is a prelude to authoritarianism. Despite Trump’s statements, no formal invocation has occurred, and legal challenges are ongoing.\nOriginal language: en\nPublish date: October 07, 2025 09:45 PM\nSource: [Newsweek](https://www.newsweek.com/every-time-insurrection-act-invoked-in-us-history-trump-floats-use-10843289)\n\n**Trump Threatens to Use 1807 Insurrection Act to Bypass Courts if Blocked from Deploying Troops**\nU.S. President Donald Trump has threatened to invoke the Insurrection Act of 1807, a 19th-century law that permits the deployment of military forces into American cities, if he is blocked from deploying troops. The law was last used in 1992 during the Los Angeles riots following the acquittal of four white police officers accused of beating Rodney King, a Black man. According to the article, Trump's threat signals a potential effort to bypass judicial constraints on military deployment. The article notes the historical significance of the law and its rare use, emphasizing its controversial nature in modern governance.\nOriginal language: pt\nPublish date: October 07, 2025 05:19 PM\nSource: [Publico](https://www.publico.pt/2025/10/07/mundo/noticia/trump-ameaca-usar-lei-insurreicao-contornar-tribunais-impedido-destacar-tropas-2149953)\n\n"
  }
]