[
  {
    "title": "AskNews Research",
    "url": "",
    "snippet": "Here are the relevant news articles:\n\n**Tehran Installs Giant Billboard Warning U.S. Against Military Action Amid Escalating Tensions**\nA large advertising billboard warning the United States against military action was installed in Tehran's Enghelab Square on Sunday, following U.S. President statements about deploying a fleet to the region 'just in case.' The billboard features a dramatic image of a damaged aircraft carrier with destroyed fighters, blood-stained decks, and blood flowing into the water to form patterns resembling the American flag. The slogan 'Sow the wind, reap the storm' appears in the corner. The installation coincided with the movement of the USS Abraham Lincoln and accompanying warships toward Iran. Iran's Revolutionary Guard commander warned that forces are 'as ready as never before, with a finger on the trigger.' Tensions have escalated after the brutal suppression of anti-government protests that began on December 28, triggered by the collapse of Iran's currency. According to U.S.-based Human Rights Watch, 5,848 people have died and over 41,280 protesters arrested. The U.S. President previously threatened military action if Iran continues killing peaceful demonstrators and conducting mass executions. Iran's General Prosecutor dismissed claims that Tehran paused executions of around 800 arrested protesters as 'completely false.' Former President Trump stated that June strikes on Iranian nuclear sites would be 'a minor matter.' The U.S. Central Command confirmed F-15E Strike Eagle fighters were deployed to the Middle East, and the UK Ministry of Defence announced Typhoon fighters were stationed in Qatar 'for defense purposes.' Iran's Foreign Minister warned the U.S. that Iran would 'open fire in response' to any new attack, citing its readiness after the 12-day conflict with Israel in June 2025. The government claims 3,117 deaths, with 2,427 as civilians or security personnel and the rest labeled 'terrorists.' The Associated Press could not independently verify the death toll due to a nationwide internet blackout lasting over two weeks, the largest in Iran's history.\nOriginal language: ru\nPublish date: January 26, 2026 05:47 AM\nSource: [euronews](http://ru.euronews.com/2026/01/26/iran-install-billboard-threatening-usa)\n\n**War Clouds Over Iran As Trump Issues Military Threats Deploys US Warships; Fears Of Conflict Rise**\nGeopolitical tensions between the United States and Iran are escalating, with the U.S. deploying warships and issuing military threats, leading to growing fears of a potential military confrontation. The situation has intensified as of January 25, 2026, according to TimesNow, though specific details about the deployments, threats, or regional reactions are not provided in the article.\nOriginal language: en\nPublish date: January 25, 2026 05:07 AM\nSource: [TimesNow](https://www.timesnownews.com/videos/times-now/world/war-clouds-over-iran-as-trump-issues-military-threats-deploys-us-warships-fears-of-conflict-rise-video-153502523)\n\n**Trump's Escalation Against Iran: Military Posturing or Strategic Gamble?**\nThe article claims that former U.S. President Donald Trump is preparing for military action against Iran, citing the deployment of the USS Lincoln carrier strike group, F-15E fighter jets to Jordan, and B-2 stealth bombers from Missouri, with the potential for a '12-day war' scenario similar to a 2023 operation. It alleges that Iran's hardline leadership defied Trump's earlier diplomatic overtures by announcing the execution of 800 individuals, escalating tensions. The article speculates that China may have sent 16 Y-20 transport aircraft to Iran to deliver HQ-9BE air defense systems, but this claim is dismissed as likely disinformation due to lack of official confirmation and logistical implausibility—16 Y-20s could only carry one full system. The article analyzes three possible scenarios over the next 48 hours: a limited strike followed by de-escalation (30% probability), a full-scale regional war triggered by Iranian retaliation (20% probability), or a diplomatic de-escalation through third-party mediation (50% probability). It concludes that the real conflict is not military but strategic, involving U.S. pressure tactics, Iranian resilience, and the risk of global escalation, with outcomes shaped more by diplomacy, oil markets, and information warfare than by actual combat.\nOriginal language: zh\nPublish date: January 25, 2026 02:04 AM\nSource: [搜狐](https://mil.sohu.com/a/979662776_121752858?scm=10001.279_13-101000-0_922.0-0.0-0-0-0-0.a2_5X162X1532)\n\n**Protests, Threats, carrier strike group: How US-Iran tensions escalated again**\nTensions between the United States and Iran have escalated significantly, reigniting a long-standing conflict amid ongoing protests in Iran that began in late December 2025. Over 500 people have been killed, and widespread property damage has occurred during anti-government demonstrations triggered by economic collapse, inflation, currency devaluation, and subsidy cuts. Iran's Supreme Leader, Ayatollah Ali Khamenei, accused the U.S. of instigating the unrest. In response, U.S. President Donald Trump issued multiple threats, including vowing to 'wipe out Iran' and 'obliterate' its nuclear capacity during potential strikes in June 2025, while also calling Khamenei 'a sick man' and demanding new leadership. Iran retaliated with a firm warning: any attack would trigger a full-scale war. The deployment of a U.S. carrier strike group—comprising a central aircraft carrier, escort warships, and fighter jets—near Iran has heightened fears of a major military confrontation. The situation intensified in January 2026, with Trump stating in an interview that 'anything happens, they're going to wipe them off the face of this earth,' and reaffirming in Davos that Iran 'does want to talk, and will talk.' A senior Iranian official declared the U.S. military presence a direct threat and vowed retaliation using 'everything at its disposal.'\nOriginal language: en\nPublish date: January 24, 2026 07:31 PM\nSource: [Daily News and Analysis (DNA) India](https://www.dnaindia.com/world/report-protests-threats-carrier-strike-group-how-us-iran-tensions-escalated-again-3198105)\n\n**Why US-Iran Relations Are Deteriorating Again After a Short-Lived Calm?**\nUS-Iran relations have deteriorated again after a brief period of reduced tension, following a surge in internal unrest in Iran that began in late December 2025. The unrest, sparked by economic grievances including high inflation, a collapsing currency, and declining living standards, escalated into widespread political protests. Iranian authorities responded with a nationwide internet and phone blackout on 8 January 2026, aiming to suppress coordination and limit information flow. Activist groups report over 5,000 deaths, though exact figures remain uncertain due to communication restrictions; the Guardian quoted an Iranian official acknowledging thousands died, blaming 'terrorists and armed rioters.' The Human Rights Activists news agency reported more than 24,000 arrests, with Kurdish regions experiencing the worst violence. The US response intensified after President Donald Trump declared Washington would 'come to their rescue,' urged Iranians to 'take over your institutions,' and warned that any attack on him would result in 'wiping them off the face of this earth.' On 14 January 2026, the US reportedly came close to launching military strikes, but the operation was halted at the last moment due to pressure from regional allies, including Israel’s Prime Minister Benjamin Netanyahu, who warned of unpreparedness for retaliation, and Saudi Crown Prince Mohammed bin Salman, who urged caution. A temporary calm followed, with restored internet access, a halt to executions (though Iran’s chief prosecutor denied mass executions were planned), and reduced public protests, though anti-Khamenei slogans persisted in Tehran, Shiraz, and Isfahan. The pause ended when Trump warned of a 'big flotilla' of US warships approaching Iran, including the USS Abraham Lincoln carrier group, which he described as a 'warning rather than a combat mission.' Iran responded sharply: military spokesperson Abolfazl Shekarchi declared that any aggression against Supreme Leader Ayatollah Ali Khamenei would trigger 'war' and that Iran would 'set fire to their world.' Iran’s Revolutionary Guard stated it has its 'finger on the trigger,' and an Iranian official told Reuters that any attack—limited, surgical, or kinetic—would be considered full-scale war. The US faces uncertain outcomes: limited strikes might embolden protesters and undermine regime confidence, but could also provoke intensified repression. Experts emphasize that Iran’s political future hinges on domestic dynamics, not foreign military intervention. The US carrier group provides strategic leverage, but Iran may respond with calibrated escalation to avoid full war. However, targeting Khamenei would likely trigger an unpredictable and catastrophic conflict.\nOriginal language: en\nPublish date: January 24, 2026 12:51 PM\nSource: [The Sunday Guardian Live](https://sundayguardianlive.com/world/why-us-iran-relations-are-deteriorating-again-after-a-short-lived-calm-166114/)\n\n**Iran and the U.S. at the Brink: Between 'I Won't Strike' and the Roar of Battleships**\nThe article analyzes the escalating tension between the United States and Iran, highlighting a stark contrast between public statements and military actions. While Donald Trump publicly declares 'I will not attack,' U.S. military movements—including the repositioning of aircraft carriers, heightened readiness at bases from the Gulf to the Eastern Mediterranean, and open sea deployments—signal a clear military preparedness. The U.S. does not mobilize for show; such actions reflect a real, if restrained, readiness for military options. Trump’s strategy is framed as one of 'brinkmanship,' using the threat of war to extract concessions without direct conflict. Iran, with its nuclear program and regional influence across Iraq, Syria, Lebanon, and Yemen, is seen as both a strategic target and a destabilizing force. The U.S. military buildup serves not only as a deterrent but also as a strategic umbrella for Israel, which views Iran as an existential threat and seeks opportunities for limited, controlled escalation. Israel, though not seeking a full war, interprets U.S. posture as implicit support, enabling it to act with greater confidence. Iran, aware of U.S. reluctance for war and Israeli pressure, carefully manages its responses—raising tensions when advantageous but avoiding full-scale conflict. However, the risk of miscalculation is high due to multiple actors, overlapping interests, and multiple flashpoints. A minor incident—such as a misinterpreted missile launch or a poorly timed attack—could rapidly escalate into a broader conflict. The region, including the Gulf, Iraq, Syria, Lebanon, and even distant countries like Egypt, remains vulnerable to economic, political, and security fallout. The article concludes that while war is not inevitable, the conditions for conflict are fully in place: an openly hostile adversary, military mobilization, an eager ally, and an already volatile regional environment. What remains uncertain is only the timing—often abrupt and unpredictable in the Middle East. The article emphasizes that in international politics, words are for public consumption, but military movements are the true language of power. Between denial and preparation, the region stands at a precipice, aware of the danger but uncertain of the outcome.\nOriginal language: ar\nPublish date: January 24, 2026 10:14 AM\nSource: [Dostor](https://www.dostor.org/5393133)\n\n**Tehran Installs Giant Billboard Warning U.S. Against Military Action Amid Escalating Tensions**\nA large advertising billboard warning the United States against military action was installed in Tehran's Enghelab Square on Sunday, following U.S. President statements about deploying a fleet to the region 'just in case.' The billboard features a dramatic image of a damaged aircraft carrier with destroyed fighters, blood-stained decks, and blood flowing into the water to form patterns resembling the American flag. The slogan 'Sow the wind, reap the storm' appears in the corner. The installation coincided with the movement of the USS Abraham Lincoln and accompanying warships toward Iran. Iran's Revolutionary Guard commander warned that forces are 'as ready as never before, with a finger on the trigger.' Tensions have escalated after the brutal suppression of anti-government protests that began on December 28, triggered by the collapse of Iran's currency. According to U.S.-based Human Rights Watch, 5,848 people have died and over 41,280 protesters arrested. The U.S. President previously threatened military action if Iran continues killing peaceful demonstrators and conducting mass executions. Iran's General Prosecutor dismissed claims that Tehran paused executions of around 800 arrested protesters as 'completely false.' Former President Trump stated that June strikes on Iranian nuclear sites would be 'a minor matter.' The U.S. Central Command confirmed F-15E Strike Eagle fighters were deployed to the Middle East, and the UK Ministry of Defence announced Typhoon fighters were stationed in Qatar 'for defense purposes.' Iran's Foreign Minister warned the U.S. that Iran would 'open fire in response' to any new attack, citing its readiness after the 12-day conflict with Israel in June 2025. The government claims 3,117 deaths, with 2,427 as civilians or security personnel and the rest labeled 'terrorists.' The Associated Press could not independently verify the death toll due to a nationwide internet blackout lasting over two weeks, the largest in Iran's history.\nOriginal language: ru\nPublish date: January 26, 2026 05:47 AM\nSource: [euronews](http://ru.euronews.com/2026/01/26/iran-install-billboard-threatening-usa)\n\n**Iran’s Multi-Dimensional Defense Strategy Amid Escalating Regional Tensions**\nIran has developed a multi-dimensional defense strategy in response to escalating tensions with the United States and Israel following widespread protests that began in late December 2023. Initially peaceful, the protests—sparked by economic collapse and currency devaluation—escalated into violence, particularly in western Iran and the capital, Tehran, prompting the Iranian government to cut internet and phone access nationwide on January 8–9, 2024. Western media and Riza Pahlavi, son of the former Shah of Iran, reported between 12,000 and 20,000 deaths, while Iran’s Martyrs and Veterans Foundation stated 3,117 fatalities, including 2,427 security personnel and civilians. The U.S., under President Donald Trump, responded with military mobilization: the USS Abraham Lincoln carrier strike group, F-15E fighter jets in Jordan, and F-35 and electronic warfare aircraft were deployed to the region. Despite U.S. military readiness, internal assessments suggested insufficient capacity for a large-scale attack, and Trump stated the military option remained on the table, saying, 'We are watching Iran... we have a massive fleet heading there, but maybe we won’t have to use it.' Iran, believing a U.S. attack is likely in early February 2024, is preparing for a multi-front conflict involving external strikes and internal uprisings. Iran’s primary defense mechanism is the Basij, a paramilitary volunteer force established in 1979 under Ayatollah Khomeini. With approximately 20 million members, Basij is organized into a nationwide network of resistance districts, stations, and centers in mosques, schools, factories, and universities. Key units include Khatam al-Anbiya (for men), Fatemeh Zahra (for women), Bayt al-Muqaddas (for protest suppression), Imam Ali (for security), Imam Hussein (for foreign invasion defense), and Al-Kawthar (women-only). The Basij also operates a secure communication network called 'Shabab' (SHABAB), used for rapid command transmission. During the 12-day Iran-Israel conflict, Basij played a critical role in suppressing internal attacks and securing streets within days. The article concludes that Iran’s internal security relies not only on the military and police but primarily on the Basij’s extensive, multi-layered structure, which enables rapid response to internal dissent and external threats, making it extremely difficult for domestic uprisings to succeed during wartime.\nOriginal language: ar\nPublish date: January 25, 2026 10:48 PM\nSource: [Aljazeera](https://www.aljazeera.net/opinions/2026/1/26/%D8%AE%D8%B7%D8%A9-%D8%AF%D9%81%D8%A7%D8%B9-%D8%A5%D9%8A%D8%B1%D8%A7%D9%86-%D9%85%D8%AA%D8%B9%D8%AF%D8%AF%D8%A9-%D8%A7%D9%84%D8%A3%D8%A8%D8%B9%D8%A7%D8%AF)\n\n**Tensions Surge in Middle East: U.S. Military Buildup and Iran's Bunkerized Leadership Amid Escalating Crisis**\nTensions between the United States, Israel, and Iran have escalated, with reports indicating that U.S. military forces are deploying aircraft carriers and fighter jets to the Middle East amid fears of an imminent American strike on Iran. Admiral Brad Cooper, commander of U.S. Central Command (CENTCOM), met with Israeli Defense Forces (IDF) Chief Eyal Zamir in a lengthy and personal meeting, underscoring the deepening strategic military cooperation between the two nations. The U.S. Department of State released a hardline message on X (formerly Twitter) in Persian, stating that violence is an integral part of Iran’s political strategy since 1979, citing the suppression of protests, including the killing of Mahsa Amini and the use of 18-wheel trucks instead of ambulances during crackdowns. According to Time magazine, citing anonymous Iranian health officials, over 30,000 people may have been killed in just two days of protests in early January 2026—far exceeding the official government figure of 3,117. Iran International reported that Supreme Leader Ayatollah Khamenei has reportedly retreated into a bunker, with his son Masoud Khamenei acting as a proxy. Iranian Revolutionary Guards declared readiness to follow orders, stating 'We have our finger on the trigger.' Satellite images show damage to Iran’s nuclear sites, including Fordow and Isfahan. U.S. military activity includes the deployment of the USS Abraham Lincoln Carrier Strike Group, increased fighter presence in Jordan, and a spike in Pentagon Pizza Meter deliveries—used as an informal indicator of geopolitical stress. Meanwhile, several airlines suspended flights to Middle Eastern capitals, only to resume after U.S. envoy Steven Witkoff and Jared Kushner arrived in Israel to meet Prime Minister Netanyahu. The article notes that while the situation is highly volatile, the presence of high-level U.S. officials may be delaying a potential military escalation.\nOriginal language: it\nPublish date: January 25, 2026 08:02 AM\nSource: [DAGOSPIA](http://www.dagospia.com/cronache/tira-aria-guerra-teheran-gli-uniti-stanno-spostando-portaerei-caccia-in-461672)\n\n**War Clouds Over Iran As Trump Issues Military Threats Deploys US Warships; Fears Of Conflict Rise**\nGeopolitical tensions between the United States and Iran are escalating, with the U.S. deploying warships and issuing military threats, leading to growing fears of a potential military confrontation. The situation has intensified as of January 25, 2026, according to TimesNow, though specific details about the deployments, threats, or regional reactions are not provided in the article.\nOriginal language: en\nPublish date: January 25, 2026 05:07 AM\nSource: [TimesNow](https://www.timesnownews.com/videos/times-now/world/war-clouds-over-iran-as-trump-issues-military-threats-deploys-us-warships-fears-of-conflict-rise-video-153502523)\n\n**Iran-US tensions LIVE: Trump vs Tehran war of words intensifies with US warships on standby**\nIran-US tensions escalated in early January 2026 amid a backdrop of recent protests and a severe government crackdown. President Donald Trump stated that the US was positioning naval warships closer to the region 'just in case' he decides to act, following earlier warnings of an 'armada heading' toward Iran. In response, Iran's Revolutionary Guard commander, Gen. Mohammad Pakpour, issued a defiant statement, saying Iran's forces are 'more ready than ever, finger on the trigger,' prepared to execute orders from the Commander-in-Chief. Meanwhile, Iran's ambassador to India publicly thanked New Delhi for voting against a UN Human Rights Council resolution it deemed 'unjust and politically motivated,' calling India's stance 'principled and firm' during a time of heightened Iran-US tensions. The protests, which began in late December 2025 over economic hardship and the collapse of the rial, led to a widespread internet shutdown—the longest and most comprehensive in Iran’s history—severely restricting communication. Activists claim at least 5,000 people were killed during the crackdown, a figure not confirmed by Iranian authorities. By early January 2026, protests appeared to subside, largely due to the communications blackout limiting the flow of footage from the country.\nOriginal language: en\nPublish date: January 25, 2026 03:47 AM\nSource: [Hindustan Times](https://www.hindustantimes.com/world-news/iran-us-tensions-news-live-updates-will-us-attack-iran-trump-khamenei-tehran-protest-101769310603476.html)\n\n**Trump's Escalation Against Iran: Military Posturing or Strategic Gamble?**\nThe article claims that former U.S. President Donald Trump is preparing for military action against Iran, citing the deployment of the USS Lincoln carrier strike group, F-15E fighter jets to Jordan, and B-2 stealth bombers from Missouri, with the potential for a '12-day war' scenario similar to a 2023 operation. It alleges that Iran's hardline leadership defied Trump's earlier diplomatic overtures by announcing the execution of 800 individuals, escalating tensions. The article speculates that China may have sent 16 Y-20 transport aircraft to Iran to deliver HQ-9BE air defense systems, but this claim is dismissed as likely disinformation due to lack of official confirmation and logistical implausibility—16 Y-20s could only carry one full system. The article analyzes three possible scenarios over the next 48 hours: a limited strike followed by de-escalation (30% probability), a full-scale regional war triggered by Iranian retaliation (20% probability), or a diplomatic de-escalation through third-party mediation (50% probability). It concludes that the real conflict is not military but strategic, involving U.S. pressure tactics, Iranian resilience, and the risk of global escalation, with outcomes shaped more by diplomacy, oil markets, and information warfare than by actual combat.\nOriginal language: zh\nPublish date: January 25, 2026 02:04 AM\nSource: [搜狐](https://mil.sohu.com/a/979662776_121752858?scm=10001.279_13-101000-0_922.0-0.0-0-0-0-0.a2_5X162X1532)\n\n**Protests, Threats, carrier strike group: How US-Iran tensions escalated again**\nTensions between the United States and Iran have escalated significantly, reigniting a long-standing conflict amid ongoing protests in Iran that began in late December 2025. Over 500 people have been killed, and widespread property damage has occurred during anti-government demonstrations triggered by economic collapse, inflation, currency devaluation, and subsidy cuts. Iran's Supreme Leader, Ayatollah Ali Khamenei, accused the U.S. of instigating the unrest. In response, U.S. President Donald Trump issued multiple threats, including vowing to 'wipe out Iran' and 'obliterate' its nuclear capacity during potential strikes in June 2025, while also calling Khamenei 'a sick man' and demanding new leadership. Iran retaliated with a firm warning: any attack would trigger a full-scale war. The deployment of a U.S. carrier strike group—comprising a central aircraft carrier, escort warships, and fighter jets—near Iran has heightened fears of a major military confrontation. The situation intensified in January 2026, with Trump stating in an interview that 'anything happens, they're going to wipe them off the face of this earth,' and reaffirming in Davos that Iran 'does want to talk, and will talk.' A senior Iranian official declared the U.S. military presence a direct threat and vowed retaliation using 'everything at its disposal.'\nOriginal language: en\nPublish date: January 24, 2026 07:31 PM\nSource: [Daily News and Analysis (DNA) India](https://www.dnaindia.com/world/report-protests-threats-carrier-strike-group-how-us-iran-tensions-escalated-again-3198105)\n\n**Why US-Iran Relations Are Deteriorating Again After a Short-Lived Calm?**\nUS-Iran relations have deteriorated again after a brief period of reduced tension, following a surge in internal unrest in Iran that began in late December 2025. The unrest, sparked by economic grievances including high inflation, a collapsing currency, and declining living standards, escalated into widespread political protests. Iranian authorities responded with a nationwide internet and phone blackout on 8 January 2026, aiming to suppress coordination and limit information flow. Activist groups report over 5,000 deaths, though exact figures remain uncertain due to communication restrictions; the Guardian quoted an Iranian official acknowledging thousands died, blaming 'terrorists and armed rioters.' The Human Rights Activists news agency reported more than 24,000 arrests, with Kurdish regions experiencing the worst violence. The US response intensified after President Donald Trump declared Washington would 'come to their rescue,' urged Iranians to 'take over your institutions,' and warned that any attack on him would result in 'wiping them off the face of this earth.' On 14 January 2026, the US reportedly came close to launching military strikes, but the operation was halted at the last moment due to pressure from regional allies, including Israel’s Prime Minister Benjamin Netanyahu, who warned of unpreparedness for retaliation, and Saudi Crown Prince Mohammed bin Salman, who urged caution. A temporary calm followed, with restored internet access, a halt to executions (though Iran’s chief prosecutor denied mass executions were planned), and reduced public protests, though anti-Khamenei slogans persisted in Tehran, Shiraz, and Isfahan. The pause ended when Trump warned of a 'big flotilla' of US warships approaching Iran, including the USS Abraham Lincoln carrier group, which he described as a 'warning rather than a combat mission.' Iran responded sharply: military spokesperson Abolfazl Shekarchi declared that any aggression against Supreme Leader Ayatollah Ali Khamenei would trigger 'war' and that Iran would 'set fire to their world.' Iran’s Revolutionary Guard stated it has its 'finger on the trigger,' and an Iranian official told Reuters that any attack—limited, surgical, or kinetic—would be considered full-scale war. The US faces uncertain outcomes: limited strikes might embolden protesters and undermine regime confidence, but could also provoke intensified repression. Experts emphasize that Iran’s political future hinges on domestic dynamics, not foreign military intervention. The US carrier group provides strategic leverage, but Iran may respond with calibrated escalation to avoid full war. However, targeting Khamenei would likely trigger an unpredictable and catastrophic conflict.\nOriginal language: en\nPublish date: January 24, 2026 12:51 PM\nSource: [The Sunday Guardian Live](https://sundayguardianlive.com/world/why-us-iran-relations-are-deteriorating-again-after-a-short-lived-calm-166114/)\n\n**After A Short-Lived Pause, US-Iran Tensions Are Flaring Again: What Triggered The Escalation?**\nTensions between the United States and Iran have escalated again following a brief de-escalation, reigniting fears of military conflict. The crisis originated in late December 2025 amid widespread protests in Iran over economic hardship, inflation, and a collapsing currency, which quickly evolved into anti-government demonstrations. Iranian authorities responded with a nationwide internet blackout on 8 January 2026, restricting communication and obscuring the scale of unrest. Activist groups estimate over 5,000 people were killed, while the Human Rights Activists news agency reported more than 24,000 arrests, with particularly violent clashes in Kurdish regions. The situation intensified in early January when U.S. President Donald Trump publicly urged Iranians to 'take over your institutions' and called Supreme Leader Ayatollah Ali Khamenei 'a sick man who should run his country properly,' escalating rhetoric. On 14 January, the U.S. reportedly came close to launching military strikes, but regional pressure from Israel’s Prime Minister Benjamin Netanyahu and Saudi Arabia’s Crown Prince Mohammed bin Salman led to a pause. A brief period of calm followed on 16 January, when Trump claimed Iran halted the execution of 800 protesters—though Iran’s top prosecutor denied this. Partial internet restoration and reduced public demonstrations created the illusion of stabilization. However, tensions flared again after Trump warned that any assassination attempt on him would trigger 'overwhelming retaliation' against Iran, referencing his call for Khamenei’s removal. Iran responded swiftly: Armed forces spokesperson Abolfazl Shekarchi declared that any aggression against Khamenei would lead to 'setting fire to their world.' Trump then announced a 'big flotilla' of U.S. warships, including the USS Abraham Lincoln carrier strike group, moving toward the Persian Gulf, framing it as a 'warning rather than a combat mission.' Iran’s senior officials stated that any attack—limited or unlimited—would be treated as full-scale war, with the Islamic Revolutionary Guard Corps declaring they are 'on high readiness' and have their 'finger on the trigger.' The U.S. now faces several military options: symbolic strikes on nuclear or missile sites, attacks on Iran’s security forces (IRGC, Basij), cyber operations, strikes on economic infrastructure (oil and gas facilities), or the most unpredictable option—assassination-style strikes targeting Khamenei. Analysts caution that while strikes might boost protester morale and expose regime weaknesses, they risk triggering greater repression, as seen in past uprisings. A U.S. strike on Khamenei could cause a power vacuum, given Iran’s lack of consensus on succession, and would almost certainly lead to war. Experts emphasize that Iran’s future will be determined by Iranians, not U.S. military action. Iran is expected to respond to any U.S. move with calibrated, symbolic retaliation to maintain deterrence while avoiding full-scale war—unless Khamenei is targeted, which would mark a decisive shift toward all-out conflict.\nOriginal language: en\nPublish date: January 24, 2026 11:47 AM\nSource: [News18](https://www.news18.com/explainers/after-a-short-lived-pause-us-iran-tensions-are-flaring-again-what-triggered-the-escalation-ws-l-9854123.html)\n\n**Iran and the U.S. at the Brink: Between 'I Won't Strike' and the Roar of Battleships**\nThe article analyzes the escalating tension between the United States and Iran, highlighting a stark contrast between public statements and military actions. While Donald Trump publicly declares 'I will not attack,' U.S. military movements—including the repositioning of aircraft carriers, heightened readiness at bases from the Gulf to the Eastern Mediterranean, and open sea deployments—signal a clear military preparedness. The U.S. does not mobilize for show; such actions reflect a real, if restrained, readiness for military options. Trump’s strategy is framed as one of 'brinkmanship,' using the threat of war to extract concessions without direct conflict. Iran, with its nuclear program and regional influence across Iraq, Syria, Lebanon, and Yemen, is seen as both a strategic target and a destabilizing force. The U.S. military buildup serves not only as a deterrent but also as a strategic umbrella for Israel, which views Iran as an existential threat and seeks opportunities for limited, controlled escalation. Israel, though not seeking a full war, interprets U.S. posture as implicit support, enabling it to act with greater confidence. Iran, aware of U.S. reluctance for war and Israeli pressure, carefully manages its responses—raising tensions when advantageous but avoiding full-scale conflict. However, the risk of miscalculation is high due to multiple actors, overlapping interests, and multiple flashpoints. A minor incident—such as a misinterpreted missile launch or a poorly timed attack—could rapidly escalate into a broader conflict. The region, including the Gulf, Iraq, Syria, Lebanon, and even distant countries like Egypt, remains vulnerable to economic, political, and security fallout. The article concludes that while war is not inevitable, the conditions for conflict are fully in place: an openly hostile adversary, military mobilization, an eager ally, and an already volatile regional environment. What remains uncertain is only the timing—often abrupt and unpredictable in the Middle East. The article emphasizes that in international politics, words are for public consumption, but military movements are the true language of power. Between denial and preparation, the region stands at a precipice, aware of the danger but uncertain of the outcome.\nOriginal language: ar\nPublish date: January 24, 2026 10:14 AM\nSource: [Dostor](https://www.dostor.org/5393133)\n\n**US-Iran Relations: 2026  --  A New Geopolitical Order on a Powder Keg**\nThe article analyzes the escalating tensions between the United States and Iran in early 2026, framing them as a critical turning point in a decades-long conflict rooted in historical trauma. The 'spine effect'—shaped by the 1953 CIA-backed coup that overthrew Mohammad Mossadegh and the 1979 Islamic Revolution—continues to influence both nations' strategic mindsets. Washington’s 'Maximum Pressure 2.0' strategy and Iran’s position at the 'nuclear threshold' have narrowed diplomatic space. Key developments from 2021 to 2026 include the collapse of JCPOA negotiations, regional proxy escalation (2023), direct missile exchanges between Iran and Israel (2024), the '12-Day War' (2025), and mass domestic protests in Iran (2026) driven by economic collapse. As of January 2026, Iran’s enriched uranium stockpiles are sufficient for 5–10 nuclear warheads, crossing Washington’s red line. The risk of large-scale war is estimated at 65–70%, with triggers including nuclear weaponization, closure of the Strait of Hormuz, and regime-driven scapegoating. Regional consequences include potential oil price spikes to $150–180 per barrel, disruption of global supply chains, and a new refugee wave. Three scenarios are outlined: 'The Grand Bargain' (15% probability), 'Permanent Grey Zone' (50% probability), and 'Regional Apocalypse' (35% probability). The article concludes that 2026 marks the end of strategic ambiguity, with no clear winners in a conflict that would devastate global energy markets and regional stability. Iran’s internal unrest now plays a more decisive role than U.S. military threats.\nOriginal language: en\nPublish date: January 22, 2026 02:49 PM\nSource: [Medium.com](https://medium.com/@geologic990/us-iran-relations-2026-a-new-geopolitical-order-on-a-powder-keg-1f20e03a55ab)\n\n**Analysts Warn Iran’s Instability Could Trigger Nuclear Proliferation Risks**\nAnalysts warn that internal instability in Iran’s theocratic regime, exacerbated by escalating tensions between the U.S. and Iran following Tehran’s crackdown on protests, could heighten the risk of nuclear proliferation. Although former U.S. President Trump appears to have abandoned military strikes, he still called for ending Supreme Leader Ali Khamenei’s nearly 40-year rule on April 17, 2024. Meanwhile, a U.S. aircraft carrier moved from the South China Sea through Singapore and the Strait of Malacca, positioning itself on a potential route to the Middle East. David Albright, founder of the Washington-based non-profit Institute for Science and International Security and a former Iraqi nuclear inspector, stated that during internal chaos, Iran may lose its ability to protect its nuclear assets. He highlighted the 440.9 kilograms of uranium enriched to 60% purity—close to the 90% threshold for weapons-grade material—as particularly concerning, noting that portions could be stolen. Historical precedent exists: after the Soviet Union’s collapse in 1991, weakened security led to the disappearance of weapons-grade uranium and plutonium. Despite Israel’s 12-day attack and U.S. bombing in June 2024, Iran has maintained control over its nuclear facilities. According to the International Atomic Energy Agency (IAEA), Iran’s 60% enriched uranium stockpile remains unverified since the June 2024 conflict, with IAEA losing continuous monitoring records. An IAEA-affiliated diplomat confirmed the agency has not received updated information on the stockpile’s status or location. Albright noted the material could fit into 18–20 cylindrical containers, each weighing about 50 kg and easily movable by two people. Kelsey Davenport, director of non-proliferation policy at the U.S.-based Arms Control Association, warned that the stockpile could be transferred to secret programs or stolen by factions within Iran’s government or military seeking to retain nuclear weapons options. She emphasized that the risk is real but difficult to assess due to the lack of transparency, especially during periods of internal instability or potential regime collapse, when nuclear materials might be smuggled out or sold to non-state actors.\nOriginal language: zh\nPublish date: January 20, 2026 02:47 AM\nSource: [UDN](https://udn.com/news/story/6809/9276373)\n\n**Tensions Between the U.S. and Iran Could Escalate into a Larger Conflict - HSB NOTICIAS**\nTensions between the United States and Iran have escalated following reciprocal threats and military movements in the region. The U.S. has withdrawn part of its military personnel from a key base in Qatar, warning of potential Iranian retaliation. Iranian officials have reaffirmed their commitment to respond to any threat against their country. Internationally, joint military exercises with nations such as South Africa have drawn criticism and indicate deteriorating relations. Domestically, Iran faces ongoing protests, with its leader blaming the U.S. for inciting destabilization, further intensifying the situation. Although there has been a slight decline in the most intense protests, the internal environment remains volatile, marked by a strong presence of security forces. According to international relations experts, if the United States conducts a direct military strike against Iran—whether over its nuclear program or in retaliation—there is a high probability such an action would trigger a broader regional conflict.\nOriginal language: es\nPublish date: January 17, 2026 01:22 PM\nSource: [HSB Noticias](https://www.hsbnoticias.com/tension-entre-ee-uu-e-iran-podria-escalar-en-conflicto-mayor/)\n\n**The Strategic Cost of a Potential U.S. Military Intervention in Iran Before Any Attack**\nTensions between Washington and Tehran are escalating amid repeated threats from former U.S. President Donald Trump, raising questions about the likelihood of U.S. military intervention in Iran and its strategic consequences. Trump has vowed immediate action if protests in Iran intensify, but former U.S. Defense Secretary Leon Panetta warned this rhetoric has undermined American credibility, giving Iranians the impression that U.S. support is imminent—making military action seem necessary to restore credibility. Panetta also noted that rising casualties and internet blackouts in Iran could pressure Trump, who claims his decisions are guided by personal ethics rather than international law. According to Karim Sadjadpour, a U.S. Iran expert at the Carnegie Endowment, Trump has threatened military action against Iran seven times in two weeks, with many hoping the U.S. will provide a 'protective umbrella' for Iranian protesters. Strategic reasons cited by CNN include Iran’s domestic and international weakening due to economic crises and currency collapse, reduced regional influence after the October 7, 2023 war, and the belief among some Americans that the U.S. can leverage this moment to reshape the Middle East. Trump boasts of defying traditional presidential norms, referencing past actions such as the alleged assassination attempt on Venezuelan President Nicolás Maduro, the bombing of Iranian nuclear facilities in June of the previous year, and strong support from Republican allies like Lindsey Graham. However, experts caution that Trump’s threats may lose credibility without accompanying military force. Historical precedents show U.S. military interventions carry risks, including the potential for a new Iranian leadership to emerge. The impact of a U.S. strike on Iranian protesters remains uncertain—while some fear it could backfire and provoke stronger backlash, others question whether strikes would actually protect civilians. Ultimately, any U.S. decision to intervene in Iran would come with a high political and military cost, both regionally and in terms of global credibility, amid complex internal and external challenges that make such a move highly risky.\nOriginal language: ar\nPublish date: January 16, 2026 02:58 PM\nSource: [بوابة اخبار اليوم](https://m.akhbarelyom.com/news/NewDetails/4758540/1/%D9%82%D8%A8%D9%84-%D9%82%D8%B5%D9%81-%D8%A5%D9%8A%D8%B1%D8%A7%D9%86-%D9%85%D8%A7-%D8%A7%D9%84%D8%AB%D9%85%D9%86-%D8%A7%D9%84%D8%A7%D8%B3%D8%AA%D8%B1%D8%A7%D8%AA%D9%8A%D8%AC%D9%8A-%D9%84%D8%AA%D8%AF%D8%AE%D9%84)\n\n**Gulf on edge: Iran warns it will target US military bases if attacked**\nTensions in the Gulf have escalated as Iran has warned Qatar and Saudi Arabia it will target U.S. military bases if attacked, according to Middle East expert Professor Mehran Kamrava of Georgetown University in Qatar. The movement of some U.S. personnel from Al Udeid Air Base in Qatar—described as precautionary by Qatari officials—reflects growing regional fears of direct U.S.-Iran conflict. Kamrava emphasized that Iran’s 'axis of resistance' has collapsed, forcing Tehran to rely on ballistic missiles for retaliation, with no political room to avoid responding if the U.S. strikes. He stated, 'If Iran is hit, they will hit American targets in the region,' and warned that retaliation would be 'much more lethal' than in the past. He cited historical precedents, including the 2020 killing of General Qassem Soleimani and June 2025 strikes on Iranian nuclear facilities, to underscore the consistency of Iranian responses. Additionally, Kamrava noted that protests in Iran—originating from economic hardship and rial collapse—have intensified due to government overreaction and external influence, with widespread anti-government sentiment now prevalent. He stressed that a sober assessment of consequences is essential to prevent further escalation, saying, 'You can't hit Iran and be done with it.'\nOriginal language: en\nPublish date: January 15, 2026 07:17 PM\nSource: [Euronews English](http://www.euronews.com/2026/01/15/iran-warns-qatar-and-saudi-arabia-it-will-strike-us-targets-if-attacked-expert-says)\n\n**Saturday War? Assessing the Likelihood of a U.S.-Iran Conflict Based on Market Timing and Precedent**\nThe Lebanese news outlet Lebanon24 reported on January 15, 2026, that the Israeli website Walla cited intelligence assessments suggesting a potential U.S.-Iran war could begin on the upcoming Saturday. The report linked this timing to the strategic use of weekend operations by both Israel and the United States to minimize disruption to financial markets, referencing the precedent of the U.S. 'Operation Washington' in Venezuela, which occurred on a Saturday, January 3, 2024, resulting in the arrest of President Nicolás Maduro and his wife Cilia Flores. The article noted that U.S. military actions have historically been scheduled on weekends to allow markets time to absorb information before Monday’s trading session. It cited a study analyzing stock market returns from 1926 to 2014, showing average positive returns of over 0.20% on Fridays, while returns on Mondays were near zero or negative. Although the study has no direct link to military operations, the report argued it aligns with the perceived timing of a looming conflict with Iran. The article also suggested that the sudden departure of Benjamin Netanyahu’s family from Israel and the influence of billionaire-led U.S. leadership—where wealth depends on market volatility—further support the scenario. Following the Venezuela operation, major indices such as the Dow Jones and S&P 500 reportedly rose on Monday, indicating market stability after weekend announcements.\nOriginal language: ar\nPublish date: January 15, 2026 04:00 PM\nSource: [Lebanon24](https://www.lebanon24.com/news/world-news/1469061/%D9%8A%D9%88%D9%85-%D8%A7%D9%84%D8%B3%D8%A8%D8%AA-%D9%87%D9%84-%D8%AA%D8%A8%D8%AF%D8%A3-%D8%A7%D9%84%D8%AD%D8%B1%D8%A8-%D8%A7%D9%84%D8%A3%D9%85%D9%8A%D8%B1%D9%83%D9%8A%D9%91%D8%A9-%D8%A7%D9%84%D8%A5%D9%8A%D8%B1%D8%A7%D9%86%D9%8A%D9%91%D8%A9%D8%9F)\n\n**Why is Iran erupting again: Economy in free fall, mass unrest**\nNationwide protests in Iran, sparked by the collapse of the rial and a worsening economic crisis with inflation reaching approximately 40%, have led to a deadly government crackdown, internet blackouts, and heightened tensions with the United States. Over 600 protests have occurred across all 31 provinces, according to the US-based Human Rights Activists News Agency, reporting at least 646 deaths and over 10,700 arrests—figures not independently verified due to internet restrictions. The Iranian government has not released official casualty numbers. The economic crisis intensified after the UN reimposed sanctions in September 2023 over Iran’s nuclear program, causing the rial to fall to over 1.4 million to USD 1. Price increases on subsidized gasoline and the end of preferential exchange rates for food products have further strained the population. Protests began in late December 2025 among Tehran merchants and expanded to include anti-government slogans, with some protesters supporting exiled Crown Prince Reza Pahlavi. Iran’s regional 'Axis of Resistance' has weakened significantly: Hamas was defeated in Gaza, Hezbollah’s leadership was decimated, and Syria’s President Bashar Assad was overthrown in December 2024. China continues to buy Iranian oil, but neither China nor Russia has offered overt military support. The West remains concerned about Iran’s nuclear program; although US intelligence assesses Iran has not yet begun weaponization, it has conducted activities that could enable it. Iran recently claimed to have stopped uranium enrichment, signaling openness to negotiations, but no talks have occurred since the June 2025 US-led attack on Iranian nuclear sites. Tensions between Iran and the US stem from historical enmity: the 1979 Islamic Revolution severed diplomatic ties after the hostage crisis, and US actions during the Iran-Iraq War, including the downing of an Iranian airliner, deepened mistrust. Relations briefly improved with the 2015 nuclear deal, but Trump’s 2018 withdrawal reignited conflict, especially after Hamas’ October 7, 2023, attack on Israel. US President Donald Trump has warned that if Iran violently suppresses protesters, the US will intervene, citing the recent capture of Venezuela’s Nicolás Maduro as a precedent.\nOriginal language: en\nPublish date: January 13, 2026 12:00 PM\nSource: [Telangana Today](https://telanganatoday.com/why-is-iran-erupting-again-economy-in-free-fall-mass-unrest)\n\n**U.S. Military Attack on Iran Probability Surges Past 50% on Prediction Market Amid Escalating Tensions**\nOn January 13, 2026, the Polymarket prediction platform reported that the probability of the United States launching a military attack on Iran had risen to 54%, exceeding 50% for the first time, up 9 percentage points in the past 24 hours. The likelihood of a U.S. military strike occurring by January 23 increased from 29% to 43%. Approximately $13.7 million has been wagered on the outcome. If the U.S. conducts a military attack—via drones, missiles, or airstrikes—on Iranian territory, including embassies and consulates, the market will settle on 'YES'; otherwise, if the attack is prevented, it will be a no-count result. Polymarket, which uses the CRYPTO: POL token, has previously faced criticism for profiting from conflicts and wars. Meanwhile, the probability that Iran's Supreme Leader Ayatollah Ali Khamenei will step down this month remains low at 20%. The surge in speculation follows a new travel advisory issued by the U.S. virtual embassy in Iran, warning U.S. citizens to evacuate due to escalating protests that have entered their 16th day. The advisory cites a significant risk of interrogation, arrest, or detention for U.S. passport holders or those perceived to have ties to the U.S. The U.S. virtual embassy serves as a diplomatic platform since the U.S. and Iran do not maintain formal diplomatic relations. According to the U.S.-based nonprofit Human Rights Activist News Agency, at least 656 people, including 505 protesters, have died during the unrest. Iran claims foreign interference is behind the uprising, which began due to public anger over currency devaluation and hyperinflation. The Trump administration is reportedly considering various responses, including military action. Tehran has signaled both readiness for war and willingness to negotiate.\nOriginal language: ja\nPublish date: January 13, 2026 09:45 AM\nSource: [Benzinga Japan](https://www.benzinga.com/content/49865102/50)\n\n**High Probability of Direct Confrontation Between Iran, the U.S., and Israel**\nIranian sources, including the newspaper 'Kayhan', indicate that a direct confrontation between Iran, the United States, and Israel is 'highly probable.' The article cites Avigdor Lieberman, former Israeli defense minister and leader of 'Yisrael Beiteinu,' who stated on social media platform X that those who believe the issue with Iran is resolved are mistaken, noting Iran's ongoing military and defense advancements, including resumed nuclear site activities, and efforts to surprise its adversaries. The newspaper argues that Iran's strong national unity after the 12-day war—where it delivered a 'strong slap' to the U.S. and the Zionist regime—has made a repeat of the failed strategy used in Syria unlikely. The article claims the enemy attempted to exploit economic hardship in Iran to incite unrest, but failed, prompting renewed efforts to undermine public livelihood through sanctions, media, and social media. The paper asserts that ongoing economic instability in Iran is a continuation of the war's aftermath and that the enemy's open attacks on the population's well-being confirm the likelihood of renewed conflict. It concludes that the world stands at a historical turning point, and a potential confrontation between Iran and the U.S.-Israel alliance could have significant global consequences.\nOriginal language: ar\nPublish date: October 04, 2025 01:16 PM\nSource: [صحيفة السوسنة الأردنية](https://www.assawsana.com/article/694145)\n\n**Iran and Israel on the Brink: Escalating Tensions Amid Sanctions and Military Posturing**\nIran and Israel face heightened tensions following the reactivation of sanctions mechanisms under the 2015 nuclear deal, with the U.S. re-imposing restrictions on arms trade, uranium enrichment, ballistic missile launches, and global asset freezes, while authorizing international inspections of Iranian aircraft and vessels. Israel, closely monitoring the situation, has raised its military readiness, citing Iran’s advanced ballistic and hypersonic missile capabilities as existential threats. Israeli assessments after the June 2024 12-day conflict indicate Iran’s resilience despite strikes, reinforcing the need for massive investment in missile defense systems like Arrow, Iron Dome, David’s Sling, and the newly deployed U.S. THAAD batteries. Iran, in response, has reaffirmed its readiness to defend against any aggression, citing ongoing upgrades to its military systems and the integration between the regular army and the Revolutionary Guard. Iran’s missile range—up to 2,000 km—covers Israel, and its leadership has signaled willingness to extend missile reach as needed. Iran has also received Russian MiG-29s and is acquiring Sukhoi-35s, while relying on 'ghost ships' to evade sanctions. Experts, including Israeli analyst Omar Mubaraki and U.S. advisor Gabriel Somma, warn of a potential new confrontation, with Israel pursuing a strategy of targeted preemptive strikes and strategic pressure, while the U.S. prioritizes diplomacy and sanctions over military action. The region stands at a critical juncture, with the balance of power shifting amid escalating military posturing and intelligence-driven deterrence. Historical precedents show sanctions and deterrence have limited Iran’s nuclear ambitions but failed to eliminate its military capabilities.\nOriginal language: ar\nPublish date: October 04, 2025 06:30 AM\nSource: [Aljazeera](https://www.aljazeera.net/politics/2025/10/4/%d8%a5%d9%8a%d8%b1%d8%a7%d9%86-%d9%88%d8%a5%d8%b3%d8%b1%d8%a7%d8%a6%d9%8a%d9%84-%d8%b3%d9%8a%d9%86%d8%a7%d8%b1%d9%8a%d9%88%d9%87%d8%a7%d8%aa-%d9%85%d9%88%d8%a7%d8%ac%d9%87%d8%a9)\n\n"
  }
]