[
  {
    "title": "There have been five mass extinctions in Earth's history",
    "url": "https://ourworldindata.org/mass-extinctions",
    "snippet": "There's a natural background rate to the timing and frequency of extinctions: 10% of species are lost every million years, 30% every 10 million ..."
  },
  {
    "title": "Extinction Over Time | Smithsonian National Museum of Natural ...",
    "url": "https://naturalhistory.si.edu/education/teaching-resources/paleontology/extinction-over-time",
    "snippet": "Judging from the fossil record, the baseline extinction rate is about one species per every one million species per year."
  },
  {
    "title": "Human Population Growth and Extinction",
    "url": "https://www.biologicaldiversity.org/programs/population_and_sustainability/extinction/",
    "snippet": "Wilson estimated that 30,000 species per year (or three species per hour) are being driven to extinction. Compare this to the natural background rate of one ..."
  },
  {
    "title": "An upper bound for the background rate of human extinction - Nature",
    "url": "https://www.nature.com/articles/s41598-019-47540-7",
    "snippet": "With multiple steps and these parameters, observerhood has less than one in a trillion chance of occurring within 10,000 years (5.6 × 10−17), ..."
  },
  {
    "title": "Since human beings appeared, species extinction is 35 times faster",
    "url": "https://www.reddit.com/r/science/comments/16mlia9/since_human_beings_appeared_species_extinction_is/",
    "snippet": "Scientists calculate that animal genera are going extinct at a rate 35 times faster than expected background rates over the past million years, ..."
  },
  {
    "title": "Extinctions during human era worse than thought | News from Brown",
    "url": "https://archive2.news.brown.edu/2007-2015/articles/2014/09/extinctions.html",
    "snippet": "Extinctions are about 1,000 times more frequent now than in the 60 million years before people came along. The explanation from lead author ..."
  },
  {
    "title": "Biodiversity crisis or sixth mass extinction? Does the current ...",
    "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8728607/",
    "snippet": "Thus, the most robust and well‐documented extinction rates are from the 20th century with an average rate of 3.6 species per year, which ..."
  },
  {
    "title": "Human-driven mass extinction is eliminating entire genera",
    "url": "https://news.stanford.edu/stories/2023/09/human-driven-mass-extinction-eliminating-entire-genera",
    "snippet": "In five centuries, human actions have triggered a surge of genus extinctions that would otherwise have taken 18,000 years to accumulate – what ..."
  },
  {
    "title": "The global species extinction rate is 10 to 100 times higher than the ...",
    "url": "https://www.facebook.com/IPBES/posts/the-global-species-extinction-rate-is-10-to-100-times-higher-than-the-historical/1231924428966671/",
    "snippet": "The global species extinction rate is 10 to 100 times higher than the historical average, accelerating due to human actions, as noted in the ..."
  },
  {
    "title": "Poll: Most Americans Believe Cities Will Be Lost to Rising Sea Levels",
    "url": "https://www.insurancejournal.com/news/national/2026/01/23/855338.htm",
    "snippet": "One-quarter of those polled believe climate change is very or somewhat likely climate change will cause the extinction of the human race."
  },
  {
    "title": "New study shows alarming rate of potential species extinction due to ...",
    "url": "https://today.uconn.edu/experts/expert-spotlight/10331/new-study-shows-alarming-rate-of-potential-species-extinction-due-to-climate-change/",
    "snippet": "Rising temperatures could see one-third of species become extinct by 2100. Business Today. The world is also likely to experience more extreme ..."
  },
  {
    "title": "Meta-analysis of current global warming impacts suggests a third of ...",
    "url": "https://phys.org/news/2024-12-meta-analysis-current-global-impacts.html",
    "snippet": "A biologist at the University of Connecticut has found evidence that up to a third of all species alive today could go extinct by 2100 if greenhouse gas ..."
  },
  {
    "title": "Mathematics predicts a sixth mass extinction | MIT News",
    "url": "https://news.mit.edu/2017/mathematics-predicts-sixth-mass-extinction-0920",
    "snippet": "Daniel Rothman has predicted that the oceans may hold enough carbon to trigger a sixth mass extinction by 2100, reports Trevor Nace for Forbes."
  },
  {
    "title": "Climate crisis could cause new mass extinction, says researcher",
    "url": "https://agenciabrasil.ebc.com.br/en/meio-ambiente/noticia/2025-04/climate-crisis-could-cause-new-mass-extinction-says-researcher",
    "snippet": "If humanity fails to reverse the impacts of climate change, Earth could face a mass extinction event comparable to that of the Permian ..."
  },
  {
    "title": "A third of Earth's species could become extinct by 2100 if climate ...",
    "url": "https://www.livescience.com/planet-earth/climate-change/a-third-of-earths-species-could-become-extinct-by-2100-if-climate-change-isnt-curbed",
    "snippet": "Almost one-third of species around the world would be at risk of extinction by the end of the century if we continue to churn out greenhouse gases, according ..."
  },
  {
    "title": "Human extinction - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Human_extinction",
    "snippet": "On September 11, 2025, Warp News estimated a 20% chance of global catastrophe and a 6% chance of human extinction by 2100. They also estimated a 100% chance ..."
  },
  {
    "title": "Could AI Really Kill Off Humans? - RAND",
    "url": "https://www.rand.org/pubs/commentary/2025/05/could-ai-really-kill-off-humans.html",
    "snippet": "In real-world surveys AI researchers say that they see human extinction as a plausible outcome of AI development."
  },
  {
    "title": "A third of Earth's species could become extinct by 2100 if climate ...",
    "url": "https://www.reddit.com/r/climate/comments/1h7ilwr/a_third_of_earths_species_could_become_extinct_by/",
    "snippet": "The article says that would happen if warming increases by 9.7 F (5.4 C), which is way higher than the likeliest scenarios."
  },
  {
    "title": "An unusual way to figure out if humanity is toast - Vox",
    "url": "https://www.vox.com/future-perfect/23785731/human-extinction-forecasting-superforecasters",
    "snippet": "The median expert put 6 percent odds that humans will go extinct by 2100; they estimated 20 percent odds of a catastrophic event before the ..."
  },
  {
    "title": "Mathematics predicts a sixth mass extinction | MIT News",
    "url": "https://news.mit.edu/2017/mathematics-predicts-sixth-mass-extinction-0920",
    "snippet": "Daniel Rothman has analyzed the Earth's five previous mass extinctions and found that a sixth could be triggered by 2100. Rothman found that, “ ..."
  },
  {
    "title": "Phew! The Odds of Human Extinction by 2100 Do Not Exceed 6%!",
    "url": "https://www.tastylive.com/news-insights/odds-human-extinction-2100",
    "snippet": "The median expert predicted a 20% chance of a “catastrophe” (of any kind) and a 6% chance of human extinction by 2100. · The median expert put ..."
  },
  {
    "title": "Supercomputer Says 27% of Life on Earth Will Be Dead by the End ...",
    "url": "https://www.popularmechanics.com/science/environment/a42556557/supercomputer-mass-extinction-predictions/",
    "snippet": "The results are bleak: the supercomputer says 10 percent of all plant and animal species will disappear by 2050, and 27 percent of vertebrate ..."
  },
  {
    "title": "Could AI Really Kill Off Humans? - RAND",
    "url": "https://www.rand.org/pubs/commentary/2025/05/could-ai-really-kill-off-humans.html",
    "snippet": "In real-world surveys AI researchers say that they see human extinction as a plausible outcome of AI development."
  },
  {
    "title": "Will AI kill us? Superforecasters and experts disagree - Freethink",
    "url": "https://www.freethink.com/robots-ai/ai-predictions-superforecasters",
    "snippet": "In total, experts predicted a 6% chance of human extinction by 2100. Superforecasters put the odds at 1%."
  },
  {
    "title": "What might cause human extinction? AI deemed greatest threat",
    "url": "https://www.oakridger.com/story/opinion/columns/2023/08/14/what-might-cause-human-extinction-ai-deemed-greatest-threat/70549771007/",
    "snippet": "AI topped forecasters' list as the potential cause of catastrophe by the year 2100, but the risk was put at no more than 20%."
  },
  {
    "title": "The Extinction Tournament - by Scott Alexander - Astral Codex Ten",
    "url": "https://www.astralcodexten.com/p/the-extinction-tournament",
    "snippet": "Existential risk expert Toby Ord estimated a 16% total chance of extinction by 2100, which is 16x higher than these superforecasters and 2.5x ..."
  },
  {
    "title": "Ezra Karger on what superforecasters and experts think about ...",
    "url": "https://80000hours.org/podcast/episodes/ezra-karger-forecasting-existential-risks/",
    "snippet": "... human extinction by 2100. Superforecasters said there was a 1% chance of human extinction by 2100. So we can already see that there are ..."
  }
]