[
  {
    "title": "Israeli Army Kills Two Teenagers in Gaza Amid Ongoing Violence and Humanitarian Crisis",
    "url": "https://www.noticiasaominuto.com/mundo/2925564/exercito-israelita-mata-dois-adolescentes-em-gaza",
    "snippet": "Two Palestinian teenagers, aged 14 and 15, were killed in an Israeli drone strike in Beit Lahia, northern Gaza, according to medical sources from the enclave. The Israeli military stated it had 'eliminated several terrorists' who crossed the so-called 'yellow line', an imaginary border established by Israel, which it considers a threat zone where any approach triggers automatic fire. The military claimed the individuals had planted an explosive device and approached Israeli troops, posing an immediate threat. An Israeli military spokesperson confirmed the deceased were not minors. The Palestinian news agency Wafa reported additional injuries from an Israeli airstrike in Jabalia (northern Gaza), and another Palestinian was wounded by Israeli fire in Khan Yunis (southern Gaza). Meanwhile, residents of Al Tufa neighborhood in Gaza City reported armed groups affiliated with the Popular Resistance Forces—led by Rami Hilles—invading homes and forcing families to evacuate, warning of a 'difficult night.' Harsh weather continues to claim lives among Gaza’s displaced population; a 3-month-old baby died of hypothermia in Gaza City, bringing the winter death toll among children to 10 due to lack of adequate shelter. Since the ceasefire began in October 2025, daily mass casualties from Israeli airstrikes have ended, but Israeli forces—still controlling over half of Gaza despite unclear borders—continue daily attacks. The week’s deaths raise the total to 481, including over 100 minors, according to UNICEF, with over 1,300 injured. In September 2025, a UN International Independent Commission of Inquiry, led by Navi Pillay, concluded that Israel 'committed genocide against Palestinians in Gaza.' The total number of Palestinians killed during the two-year Israeli offensive now exceeds 71,600, including more than 20,000 children, according to Gaza authorities, whose data the UN considers reliable."
  },
  {
    "title": "Israeli Forces Raid Beit Fajar South of Bethlehem, UN Rights Office Condemns Escalating Violence in Gaza",
    "url": "https://www.alwafd.news/5793856",
    "snippet": "Israeli occupation forces raided the town of Beit Fajar, south of Bethlehem, in the late afternoon on Friday, April 18, 2024, and stationed themselves in the 'Al-Dairiya' neighborhood. A local source reported that the forces fired tear gas and sound bombs, though no injuries were recorded. The area experienced heightened tension and fear among residents. Meanwhile, Ahmad Abu Holi, member of the PLO Executive Committee and head of the Palestinian refugee affairs department, commended Iraq's financial support of $30 million to UNRWA over three years (2026–2028), describing it as a strategic, multi-year partnership reflecting Iraq's steadfast commitment to the Palestinian cause and the rights of refugees. He emphasized that the funding helps reduce UNRWA’s $384 million 2026 financial shortfall, supports operations for approximately 6.2 million Palestinian refugees, and encourages other donors to contribute. The Office of the United Nations High Commissioner for Human Rights (OHCHR) in the occupied Palestinian territory expressed deep shock over the continued killing of civilians in Israeli attacks on Gaza, reporting at least 11 Palestinians killed in attacks on January 21, 2026, part of an escalating pattern of violence after the ceasefire. The OHCHR stated that 477 Palestinians have been killed in Israeli attacks since the ceasefire, including 216 up to January 21, 2026—46 children and 28 women—with attacks primarily targeting shelters for displaced persons and residential buildings. Of these, 126 drone strikes killed 87 Palestinians (12 children, 7 women), and 167 others were killed near the 'red line' area, including 26 children and 17 women. The OHCHR’s director, Agit Songai, warned that the crisis in Gaza is far from over, with daily deaths from both military strikes and humanitarian restrictions, particularly on shelter and aid, leading to deaths from cold and building collapses."
  },
  {
    "title": "'The crisis has not come close to ending': UN holds Israel responsible for ongoing violence and humanitarian collapse in Gaza",
    "url": "https://www.masrawy.com/news/news_publicaffairs/details/2026/1/23/2930694/-%D8%A7%D9%84%D8%A3%D8%B2%D9%85%D8%A9-%D9%84%D9%85-%D8%AA%D9%82%D8%AA%D8%B1%D8%A8-%D9%85%D9%86-%D9%86%D9%87%D8%A7%D9%8A%D8%AA%D9%87%D8%A7-%D8%A7%D9%84%D8%A3%D9%85%D9%85-%D8%A7%D9%84%D9%85%D8%AA%D8%AD%D8%AF%D8%A9-%D8%AA%D8%AD%D9%85%D9%84-%D8%A5%D8%B3%D8%B1%D8%A7%D8%A6%D9%8A%D9%84-%D9%85%D8%B3%D8%A4%D9%88%D9%84%D9%8A%D8%A9-%D8%A7%D8%B3%D8%AA%D9%85%D8%B1%D8%A7%D8%B1",
    "snippet": "The Office of the United Nations High Commissioner for Human Rights (OHCHR) in the occupied Palestinian territory stated that the crisis in Gaza has not come close to ending, with people dying daily from Israeli military attacks and ongoing restrictions on humanitarian aid, particularly shelter-related supplies, leading to deaths from cold and building collapses. The OHCHR expressed deep shock over the continued killing of civilians in Israeli attacks, reporting at least 11 Palestinians killed in January 2026. On January 21, 2026, an Israeli airstrike killed three Palestinian journalists—Anas Ghanem, Abdul-Rauf Sheth, and Muhammad Salah Qashta—near Nitzanim in central Gaza while they were filming for the Egyptian Relief Committee, raising the total number of journalists killed in Israeli military attacks since October 7, 2023, to 292. The OHCHR emphasized that international journalists remain barred from entering Gaza. On the same day, Israeli ground forces opened fire and conducted artillery attacks in three incidents near the undefined 'Yellow Line' (line of deployment), resulting in the deaths of a 13-year-old boy east of Khan Yunis, three members of a family including a 13-year-old boy in central Gaza, and three Palestinian siblings north of the Bureij refugee camp. The OHCHR reported that since the ceasefire began on October 11, 2025, 477 Palestinians have been killed in Israeli attacks in Gaza, according to the Palestinian Ministry of Health, with most victims being civilians. Of these, at least 216 were killed by January 21, 2026, including 46 children and 28 women, with attacks occurring both inside and outside the 'Yellow Line'. The OHCHR documented 126 drone strikes by Israeli forces across Gaza, killing at least 87 Palestinians, including 12 children and seven women. Additionally, at least 167 Palestinians were killed near the 'Yellow Line', including 26 children and 17 women. Repeated Israeli military operations west of the deployment line have caused civilian displacement and the destruction of residential buildings. The OHCHR warned that continued civilian casualties suggest Israel may be violating its international humanitarian and human rights law obligations, including the right to life. Attacks on civilians near the 'Yellow Line'—even if not directly involved in hostilities—may constitute war crimes. The OHCHR also reported that at least nine Palestinian children have died from extreme cold since the ceasefire, due to deteriorating humanitarian conditions. The UN office urged the international community to intensify pressure on Israel to stop bloodshed and adopt a human rights-based approach to recovery and reconstruction."
  },
  {
    "title": "UN Office Warns of Ongoing Palestinian Deaths Amid Israeli Military Operations in Gaza",
    "url": "https://sana.sy/international/2381931/",
    "snippet": "The Office of the United Nations High Commissioner for Human Rights in the occupied Palestinian territory warned that Palestinian deaths continue due to ongoing Israeli military operations in Gaza, following the ceasefire agreement that entered into force on October 11, 2025. According to Ajith Songhai, Director of the Office, the humanitarian crisis in Gaza remains unresolved, with people dying daily from Israeli attacks and from the severe restrictions on humanitarian aid, particularly shelter, leading to deaths from cold and building collapses. The Office emphasized the need for intensified international pressure on Israel to stop bloodshed and adopt a human rights-based approach to recovery and reconstruction. On January 21, 2026, an Israeli airstrike killed three Palestinian journalists near Nitsarim in central Gaza while they were filming for the Egyptian Relief Committee, raising the total number of journalists killed since October 7, 2023, to 292, according to the UN Office. The Office also reported that Israeli ground forces opened fire and conducted artillery attacks on three occasions on January 21 in areas near the undefined 'Yellow Line', resulting in the deaths of a 13-year-old boy in Khan Yunis, three members of a family including a 13-year-old boy in central Gaza, and three brothers in northern-eastern Beach refugee camp. The UN Office confirmed that patterns of violence since the ceasefire show continued civilian casualties across all five Gaza governorates, including outside and around the 'Yellow Line'. Since the ceasefire, 477 Palestinians have been killed in Israeli attacks, according to the Palestinian Ministry of Health, with most being civilians. The UN Office documented at least 216 Palestinian deaths, including at least 46 children and 28 women, from January 11, 2025, to January 21, 2026, in attacks far from the 'Yellow Line', targeting displacement shelters and residential buildings. The Office warned these killings are deeply concerning as they suggest Israeli forces are violating international humanitarian law and human rights law, including the right to life, and that attacks near the 'Yellow Line' may constitute war crimes by targeting non-combatant civilians merely due to proximity to military lines. Additionally, at least nine Palestinian children have died from extreme cold since the ceasefire. The UN continues to warn of ongoing Israeli military operations—air strikes, artillery fire, and gunfire—across Gaza, combined with a crippling blockade restricting humanitarian aid, worsening living conditions, and increasing civilian casualties, including children and journalists."
  },
  {
    "title": "UN: Israel Continues Killing Palestinians in Gaza",
    "url": "https://www.addustour.com/articles/1543841",
    "snippet": "The Office of the United Nations High Commissioner for Human Rights in the occupied Palestinian territory expressed profound shock over the continued killing of civilians in Gaza due to Israeli attacks. According to a press statement, at least 11 Palestinians were killed in attacks on January 21, 2026, marking an 'expanded pattern of ongoing violence' following the ceasefire and amid the lasting consequences of two years of destruction. The office emphasized that the international community must intensify support and pressure to halt bloodshed and advance a human rights-based approach to recovery and reconstruction. Ajith Songhai, the head of the UN human rights office in the region, stated that 'the crisis in Gaza has not come close to ending; people are dying every day, whether from Israeli attacks or due to ongoing Israeli restrictions on humanitarian aid, particularly shelter, leading to deaths from cold and building collapses.' The office reported that 477 Palestinians have been killed in Israeli attacks in Gaza since the ceasefire, with at least 216 of those deaths occurring between the ceasefire and January 21, 2026. Among them were at least 46 children and 28 women, killed in attacks outside the so-called 'red line'—primarily targeting displacement shelters and residential buildings. The report documented 126 drone strikes by Israeli forces across Gaza, resulting in at least 87 Palestinian deaths, including 12 children and seven women. Additionally, at least 167 Palestinians were killed near the 'red line' during the same period, including 26 children and 17 women."
  },
  {
    "title": "French volunteer protecting village in West Bank 'beaten' by Israeli settlers",
    "url": "https://www.rfi.fr/en/international/20260123-french-volunteer-protecting-village-in-west-bank-beaten-by-israeli-settlers",
    "snippet": "French academic Albane Buriel, volunteering with the Israeli NGO Torat Tzedek in the West Bank, was assaulted on 17 January 2026 in the Bedouin village of Mukhmas, near Jerusalem. She was beaten with iron bars by approximately 20 masked individuals, likely Israeli settlers, who also set fire to a car she was sheltering behind. Buriel, who specializes in education sciences, described the attack as systematic and controlled, with 15–20 blows delivered by crowbars—'horrific' and intended to injure without killing. An American volunteer was similarly attacked. A Palestinian villager was also seriously injured. Buriel filed a complaint in Israel and returned to France. This incident is part of a broader surge in settler violence: according to the UN Office for the Coordination of Humanitarian Affairs, settlers carried out over 750 attacks on Palestinians and their property in the first half of 2025, averaging nearly 130 per month. The Israeli military reported a 27% increase in settler violence in 2025 compared to 2024, with 10 Palestinians killed and nearly 400 injured since 2024. The New York Times previously found that Israeli authorities have failed to impose meaningful accountability on settlers. In a separate incident on 7 December 2025, eight masked settlers attacked a Palestinian home near Ramallah, injuring a 13-year-old boy, his grandmother, and international volunteers from Colombia, the U.S., the UK, and France."
  },
  {
    "title": "Gaza: Civilian killings continue after ceasefire",
    "url": "https://reliefweb.int/report/occupied-palestinian-territory/gaza-civilian-killings-continue-after-ceasefire",
    "snippet": "UN Human Rights in the Occupied Palestinian Territory (OPT) condemned the continued killing of civilians in Israeli attacks in Gaza following the ceasefire that began on 11 October 2025. On 21 January 2026, at least 11 Palestinians were killed in a series of attacks, including three journalists—Anas Ghneim, Abdel Raof Shaat, and Muhammad Salah Qishta—killed in a strike near the Netzarim area after completing a photography assignment for the Egyptian Relief Committee. This brings the total number of journalists killed since 7 October 2023 to 292, as verified by UN Human Rights in OPT. Israeli forces reportedly conducted artillery shelling and gunfire near the unmarked 'yellow line' in three incidents on 21 January, killing a 13-year-old boy east of Khan Younis, three family members including a father and his 13-year-old son in Middle Gaza, and three brothers northeast of Al Bureij camp. Since the ceasefire until 21 January 2026, UN Human Rights in OPT recorded at least 216 Palestinian deaths in Israeli attacks far from the 'yellow line', including 46 children and 28 women, primarily in shelters and residential buildings. Of these, 126 attacks involved Israeli unmanned aerial vehicles (UAVs), killing at least 87 Palestinians, including 12 children and seven women. Additionally, 167 Palestinians were killed near the 'yellow line', including 26 children and 17 women. Repeated Israeli military operations west of the redeployment line have caused civilian displacement and destruction of homes. At least nine children died of hypothermia due to humanitarian shortages, including lack of shelter and heating. UN Human Rights also documented at least 80 killings by Hamas since the ceasefire, mostly in internal clashes and summary executions. The report raises concerns that Israel may be violating international humanitarian and human rights law, including the right to life, particularly through attacks on civilians near the 'yellow line' based solely on proximity, which could constitute war crimes. Ajith Sunghay, Head of UN Human Rights in the OPT, stated, 'The crisis in Gaza is nowhere near over. People are dying every day, both in Israeli attacks and as a result of continued Israeli restrictions on the entry of humanitarian assistance, in particular shelter, leading to deaths from the cold and under collapsing buildings. Palestinian journalists are killed, and international journalists are still barred from entering Gaza.' He urged the international community to intensify pressure to stop the bloodshed and adopt a rights-based approach to recovery and reconstruction."
  },
  {
    "title": "In Occupied Palestine - 20 January 2026",
    "url": "https://thedailyblog.co.nz/2026/01/23/in-occupied-palestine-20-january-2026/",
    "snippet": "According to 'TheDailyBlogNZ', Israel's military actions in occupied Palestine between 20 January 2026 and 21 January 2026 resulted in one additional death and six injuries in Gaza, bringing the total number of Palestinians killed since 7 October 2023 to 71,552 and the wounded to 171,378. The daily average of deaths in Gaza is at least 85, and injuries exceed 204 per day. A UN OCHA report from 14 January 2025 states that approximately 70% of those killed were women and children. Since the start of the Gaza 'ceasefire', Israeli forces have killed 467 Palestinians and injured 1,300. Israeli gunboats and tanks shelled areas including Bani Suhaila, eastern Khan Yunis, prompting evacuation orders. Storms between 12 and 16 January affected 89 additional displacement sites, impacting nearly 17,000 people and displacing about 1,400 from Khan Yunis to Gaza City. Nine child deaths due to cold were reported since winter began. In the West Bank, Israeli forces have maintained a complete closure since 7 October 2023, imposing severe travel restrictions. Multiple incidents were reported, including home invasions, abductions, demolitions, and violent assaults. Israeli forces raided numerous towns and refugee camps, taking prisoners, demolishing homes and livestock shelters, and conducting military incursions. Israeli settlers committed agricultural sabotage, arson, and violence, including attacks on foreign activists. The Israeli military also violated religious sites, including the Al-Aqsa Mosque compound, and raided UNRWA headquarters in Jerusalem, destroying offices and posting confiscation orders. Israeli forces also restricted movement and detained individuals for interrogation, including journalists and residents. These actions are documented in the UN OCHA West Bank Monthly Snapshot and Gaza Situation Report No. 63, published on 20 January 2026."
  },
  {
    "title": "Five Palestinians Killed in Israeli Attacks, Infant Dies from Cold in Gaza Amid Deepening Humanitarian Crisis",
    "url": "https://www.aljazeera.net/news/2026/1/22/%d8%b4%d9%87%d9%8a%d8%af-%d8%a8%d8%b1%d8%b5%d8%a7%d8%b5-%d8%a7%d9%84%d8%a7%d8%ad%d8%aa%d9%84%d8%a7%d9%84-%d9%81%d9%8a-%d8%ba%d8%b2%d8%a9-%d9%88%d8%b1%d8%b6%d9%8a%d8%b9-%d8%ac%d8%af%d9%8a%d8%af",
    "snippet": "On Thursday, five Palestinians were killed by Israeli military gunfire and shelling in various areas of the Gaza Strip, according to sources. Four were killed in a mortar attack outside Israeli deployment zones in the Al-Zeitoun neighborhood, eastern Gaza City, and one, Fadi Wael al-Najjar, was shot near the Bani Suhaila roundabout in Khan Yunis, southern Gaza. On Wednesday, 11 Palestinians, including three journalists, were killed in Israeli attacks across multiple locations. Since the October 2025 ceasefire agreement, Israeli forces have committed 1,300 violations, resulting in 1,820 Palestinian casualties. Additionally, a 3-month-old infant, Ali Abu Zour, died in Gaza due to extreme cold. His death brings the total number of children who have died from cold since winter began to 10. Children and displaced persons are suffering amid severe humanitarian conditions, living in damaged tents without proper shelter, heating, or medical care, due to fuel shortages and a severe stormy cold front. The situation is exacerbated by widespread destruction, lack of aid, and inadequate infrastructure."
  }
]