[
  {
    "title": "AskNews Research",
    "url": "",
    "snippet": "Here are the relevant news articles:\n\n**TikTok Star Sells His 'Face' for Nearly $1 Billion**\nHabib 'Leim, a TikTok star originally from Senegal whose silent reactions gained global internet fame, has closed one of the most significant content creator deals in history, valued at $975 million, according to Tengri Life citing Tell News Magazine. The deal grants U.S.-based Rich Sparkle Holdings exclusive rights to Leim's intellectual property, including the creation of an AI replica, for three years. Crucially, Leim did not receive a lump-sum payment; instead, he became a controlling shareholder in Rich Sparkle Holdings, transforming from an influencer into a corporate stakeholder. Experts note the deal's structure is as revolutionary as its scale—replacing short-term sponsorships or one-time payments with long-term equity ownership, reflecting a strategic shift toward sustained value creation. Leim’s journey—from being laid off from a factory in Italy during the COVID-19 pandemic to becoming TikTok’s most-followed creator with over 160 million subscribers—has redefined success in social media. His minimalist, wordless content has enabled partnerships with global brands. Rich Sparkle projects that Leim’s audience could generate over $4 billion in annual revenue through social commerce, licensing, and AI-driven content. The announcement triggered an immediate market reaction: Rich Sparkle’s stock rose over 250% in a single trading day.\nOriginal language: ru\nPublish date: January 25, 2026 09:53 PM\nSource: [Tengrinews.kz](https://tengrinews.kz/curious/zvezda-tiktok-prodal-svo-litso-pochti-za-1-milliard-dollarov-591075/)\n\n**Russian Analogs of 'Ozempic' Show Threefold Sales Increase in 2025**\nSales of Russian domestic analogs of the drug 'Ozempic' increased nearly threefold in 2025 compared to 2024, according to the Center for the Development of Prospective Technologies (ЦРПТ), operator of the 'Chestny Znak' digital labeling system. In 2024, 1.7 million packages of domestic analogs were sold for 9.2 billion rubles; by 2025, sales rose to 6.1 million packages and revenue reached 35.2 billion rubles. Monthly sales grew from 282,000 packages in January 2025 to 810,000 by December, a nearly threefold increase. Sales in the first half of January 2026 were 17% higher than in the same period of 2025. The growth is attributed to increased domestic production: Russian pharmaceutical companies produced 11.7 million packages of drugs based on semaglutide and tirzepatide in 2025—ten times more than the total import volume of semaglutide-containing drugs from 2020 to 2023. The analogs, produced by Russian firms such as 'Geropharm', 'Promomed', and 'PSK Farma', are registered under 17 trade names as of early 2026. The Russian government authorized the production of these analogs without foreign patent holder consent until the end of 2026 to ensure domestic access to semaglutide. The average price of a domestic package rose from 5,454 rubles in 2024 to 5,763 rubles in 2025, compared to 7,800 rubles for the original imported Ozempic in 2023—reducing treatment costs by over 20%. The highest sales volumes per 10,000 people in 2025 were recorded in Saint Petersburg (807 packages), Moscow (755), Moscow Oblast (738), Krasnodar Krai (650), and Yamalo-Nenets Autonomous Okrug (580). In 2024, the most popular drugs by sales volume were nasal decongestants with xylometazoline, followed by ibuprofen-based painkillers and venous disease treatments with diosmin and hesperidin. Russians spent approximately 1.6 trillion rubles on medicines in 2024, with a 1.4% increase in units sold.\nOriginal language: ru\nPublish date: January 25, 2026 09:00 PM\nSource: [РБК](https://www.rbc.ru/society/26/01/2026/6975092b9a79475b127588bd)\n\n**Isso é Fantástico -- The Health Risk of Illegal Weight-Loss Pen Trade in Brazil**\nThe Globo podcast 'Isso é Fantástico' investigates the health risks associated with the illegal trade of weight-loss pens in Brazil, which contain semaglutide and tirzepatida. Despite being banned in Brazil due to lack of Anvisa registration and quality control, these pens have become a widespread trend, with many Brazilians crossing into Paraguay to buy them at lower prices. The episode features investigative reporter Giovanni Grizotti and Dr. Felipe Gaia, president of the São Paulo Regional Branch of the Brazilian Society of Endocrinology and Metabolism. A woman from Belo Horizonte is currently in critical condition after using a Paraguayan-made pen. In the past year alone, Brazil's Federal Revenue seized over 30,000 such pens, valued at 32 million reais. The illegal trade has already led to criminal cases and poses a serious public health risk.\nOriginal language: pt\nPublish date: January 25, 2026 08:59 PM\nSource: [globo.com](https://g1.globo.com/fantastico/podcast/isso-e-fantastico/noticia/2026/01/25/isso-e-fantastico-o-risco-a-saude-do-comercio-de-canetas-emagrecedoras-proibidas-no-brasil.ghtml)\n\n**Weight-Loss Pens: Key Questions to Ask Your Doctor Before Starting Treatment**\nThe article discusses the growing use of obesity medications known as 'weight-loss pens'—such as Ozempic, Mounjaro, Wegovy, semaglutide, and tirzepatida—in Brazil and globally. These drugs are not intended for short-term weight loss or cosmetic purposes but are prescribed for chronic conditions like obesity (BMI ≥30) or BMI ≥27 with comorbidities such as type 2 diabetes, hypertension, or fatty liver. According to endocrinologist Karen de Marca, clinical evaluation goes beyond BMI, considering factors like genetic predisposition, history of weight gain, medication use, binge eating, and body composition. The primary benefits include significant fat loss, improved metabolic markers (blood sugar, cholesterol, blood pressure, liver fat), and indirect benefits like better physical stamina, self-esteem, and reduced sleep apnea severity. Long-term use is associated with lower risks of heart attack, stroke, certain cancers, osteoarthritis, and chronic kidney disease. However, the medication must be combined with sustainable lifestyle changes—balanced nutrition and physical activity—for optimal and lasting results. Common side effects include nausea, vomiting, diarrhea, constipation, bloating, and headaches, which typically diminish over time with dose titration and hydration. Warning signs requiring medical evaluation include persistent vomiting, continuous abdominal pain, dehydration, jaundice, chest pain, and severe mood changes. There is no fixed treatment duration; use can be long-term or lifelong, especially for chronic obesity, depending on clinical benefit, response, and individual risk-benefit assessment. Discontinuation may lead to weight regain due to restored appetite and reduced satiety, especially without maintained healthy habits. Some patients may require dose reduction or intermittent use under medical supervision. The article emphasizes that while tirzepatida may cause greater weight loss than semaglutide, it is not universally superior. Both drugs are most effective when paired with behavioral changes, as shown in clinical trials. Additionally, these medications may interfere with oral contraceptives due to gastrointestinal side effects, so barrier methods (e.g., condoms) are recommended during initiation or dose adjustment. The Brazilian regulatory agency Anvisa prohibits the use of compounded semaglutide and restricts tirzepatida to exceptional cases due to quality control risks in compounding pharmacies, including improper dosing, contamination, and unpredictable side effects. The article strongly advises against using non-industrial formulations and urges patients to consult a physician before starting treatment.\nOriginal language: pt\nPublish date: January 25, 2026 09:00 AM\nSource: [Revista Marie Claire Brasil](https://revistamarieclaire.globo.com/saude/noticia/2026/01/canetas-emagrecedoras-as-perguntas-que-voce-deve-fazer-ao-medico-antes-de-comecar-a-usar.ghtml)\n\n**Can toy-inspired clogs help spark a fresh fashion buzz for one footwear brand?**\nCrocs has entered a multiyear partnership with Lego to launch Lego-themed clogs, aiming to reinvigorate brand appeal and drive sales growth after a post-pandemic slowdown. The limited-edition clogs, priced at US$150 (approximately RM600), will be available globally on February 16, 2026, and are designed as collectible items for adults, featuring a Lego minifigure with four pairs of miniature Crocs shoes. The collaboration aligns with Crocs’ strategy to reconnect with younger consumers and boost engagement, following a decline in momentum: revenue growth slowed, with analysts projecting a 7.5% drop in the fourth quarter and continued struggles with its HeyDude brand. The partnership is seen as a 'radical move to rebuild brand heat' by Bloomberg analyst Abigail Gilmartin, citing past viral success with unconventional designs like the yellow boot. Lego, which reported record revenue and market share in 2024 and is expanding into gaming and digital toys, previously collaborated with Nike. The clogs debuted at Paris Fashion Week on January 21, 2026, with rapper Tommy Cash, and will be sold on both companies’ websites. The collection will include Lego-brick-inspired Jibbitz charms, and Crocs plans to expand beyond footwear with bags, phone cases, livestreams on TikTok Shop, and an in-person pop-up in Shanghai. Both brands emphasize self-expression, with Lego’s Satwik Saraswati stating the clog 'marks the beginning of a journey.' Financial terms were not disclosed.\nOriginal language: en\nPublish date: January 24, 2026 07:12 AM\nSource: [The Star ](https://www.thestar.com.my/lifestyle/style/2026/01/24/can-toy-inspired-clogs-help-spark-a-fresh-fashion-buzz-for-one-footwear-brand)\n\n**Obesity Fuels a $150 Billion Pharmaceutical Market, with Mexico as a Key Target**\nThe global pharmaceutical market for obesity treatments is projected to reach $150 billion by 2035, up from $105 billion forecasted in 2024, according to Morgan Stanley. This growth is driven by rising obesity rates—37% higher than a decade ago, with 1 in 8 people globally affected, per the World Health Organization. In Mexico, 7 out of 10 adults suffer from overweight or obesity, contributing to health costs of 82 to 98 billion pesos (around $5.1 billion USD) annually. The OECD estimates the pharmaceutical market for obesity treatments in Mexico could reach $200 million, yet only 4% of obese individuals currently receive pharmacological treatment. Investors and funds are shifting capital toward companies developing weight-control drugs, anticipating multi-billion-dollar returns. Key players include Eli Lilly, Roche, Amgen, Pfizer, Novo Nordisk, and Zealand Pharma. Pfizer acquired Metsera for approximately $7 billion, boosting its stock by over 5% in 2025. Eli Lilly, a U.S. leader in obesity drugs, reported 1.1 million active prescriptions for Mounjaro and Zepbound in the U.S., and in Mexico, it aims to treat over 250,000 patients with tirzepatide by 2025, with plans to triple that number by 2026. Eli Lilly’s stock rose over 45% in the past 12 months. In contrast, Novo Nordisk saw its market value drop 24.62% over the same period due to revised sales and profit forecasts, citing a slowdown in obesity treatment growth, especially in the U.S. Despite this, Novo Nordisk continues investing 80% of its $1 billion annual research budget in obesity, with semaglutide 2.4 mg showing up to 20% weight loss in one-third of patients. The company emphasizes that obesity is a chronic, non-communicable disease and faces challenges including widespread use of unregulated 'miracle' weight-loss products sold online for as little as $10–$60, which pose serious health risks such as brain damage, dependence, or death. Legally prescribed drugs in Mexico cost over 7,000 pesos per pen and require weekly administration, often for years, and are only available with a doctor’s prescription. The article highlights the tension between public health needs, pharmaceutical innovation, and the risks posed by unregulated alternatives.\nOriginal language: es\nPublish date: January 24, 2026 06:10 AM\nSource: [Milenio.com](https://www.milenio.com/negocios/obesidad-impulsa-mercado-farmaceutico-150-mil-millones)\n\n**TikTok Star Sells His 'Face' for Nearly $1 Billion**\nHabib 'Leim, a TikTok star originally from Senegal whose silent reactions gained global internet fame, has closed one of the most significant content creator deals in history, valued at $975 million, according to Tengri Life citing Tell News Magazine. The deal grants U.S.-based Rich Sparkle Holdings exclusive rights to Leim's intellectual property, including the creation of an AI replica, for three years. Crucially, Leim did not receive a lump-sum payment; instead, he became a controlling shareholder in Rich Sparkle Holdings, transforming from an influencer into a corporate stakeholder. Experts note the deal's structure is as revolutionary as its scale—replacing short-term sponsorships or one-time payments with long-term equity ownership, reflecting a strategic shift toward sustained value creation. Leim’s journey—from being laid off from a factory in Italy during the COVID-19 pandemic to becoming TikTok’s most-followed creator with over 160 million subscribers—has redefined success in social media. His minimalist, wordless content has enabled partnerships with global brands. Rich Sparkle projects that Leim’s audience could generate over $4 billion in annual revenue through social commerce, licensing, and AI-driven content. The announcement triggered an immediate market reaction: Rich Sparkle’s stock rose over 250% in a single trading day.\nOriginal language: ru\nPublish date: January 25, 2026 09:53 PM\nSource: [Tengrinews.kz](https://tengrinews.kz/curious/zvezda-tiktok-prodal-svo-litso-pochti-za-1-milliard-dollarov-591075/)\n\n**Russian Analogs of 'Ozempic' Show Threefold Sales Increase in 2025**\nSales of Russian domestic analogs of the drug 'Ozempic' increased nearly threefold in 2025 compared to 2024, according to the Center for the Development of Prospective Technologies (ЦРПТ), operator of the 'Chestny Znak' digital labeling system. In 2024, 1.7 million packages of domestic analogs were sold for 9.2 billion rubles; by 2025, sales rose to 6.1 million packages and revenue reached 35.2 billion rubles. Monthly sales grew from 282,000 packages in January 2025 to 810,000 by December, a nearly threefold increase. Sales in the first half of January 2026 were 17% higher than in the same period of 2025. The growth is attributed to increased domestic production: Russian pharmaceutical companies produced 11.7 million packages of drugs based on semaglutide and tirzepatide in 2025—ten times more than the total import volume of semaglutide-containing drugs from 2020 to 2023. The analogs, produced by Russian firms such as 'Geropharm', 'Promomed', and 'PSK Farma', are registered under 17 trade names as of early 2026. The Russian government authorized the production of these analogs without foreign patent holder consent until the end of 2026 to ensure domestic access to semaglutide. The average price of a domestic package rose from 5,454 rubles in 2024 to 5,763 rubles in 2025, compared to 7,800 rubles for the original imported Ozempic in 2023—reducing treatment costs by over 20%. The highest sales volumes per 10,000 people in 2025 were recorded in Saint Petersburg (807 packages), Moscow (755), Moscow Oblast (738), Krasnodar Krai (650), and Yamalo-Nenets Autonomous Okrug (580). In 2024, the most popular drugs by sales volume were nasal decongestants with xylometazoline, followed by ibuprofen-based painkillers and venous disease treatments with diosmin and hesperidin. Russians spent approximately 1.6 trillion rubles on medicines in 2024, with a 1.4% increase in units sold.\nOriginal language: ru\nPublish date: January 25, 2026 09:00 PM\nSource: [РБК](https://www.rbc.ru/society/26/01/2026/6975092b9a79475b127588bd)\n\n**Isso é Fantástico -- The Health Risk of Illegal Weight-Loss Pen Trade in Brazil**\nThe Globo podcast 'Isso é Fantástico' investigates the health risks associated with the illegal trade of weight-loss pens in Brazil, which contain semaglutide and tirzepatida. Despite being banned in Brazil due to lack of Anvisa registration and quality control, these pens have become a widespread trend, with many Brazilians crossing into Paraguay to buy them at lower prices. The episode features investigative reporter Giovanni Grizotti and Dr. Felipe Gaia, president of the São Paulo Regional Branch of the Brazilian Society of Endocrinology and Metabolism. A woman from Belo Horizonte is currently in critical condition after using a Paraguayan-made pen. In the past year alone, Brazil's Federal Revenue seized over 30,000 such pens, valued at 32 million reais. The illegal trade has already led to criminal cases and poses a serious public health risk.\nOriginal language: pt\nPublish date: January 25, 2026 08:59 PM\nSource: [globo.com](https://g1.globo.com/fantastico/podcast/isso-e-fantastico/noticia/2026/01/25/isso-e-fantastico-o-risco-a-saude-do-comercio-de-canetas-emagrecedoras-proibidas-no-brasil.ghtml)\n\n**Weight-Loss Pens: Key Questions to Ask Your Doctor Before Starting Treatment**\nThe article discusses the growing use of obesity medications known as 'weight-loss pens'—such as Ozempic, Mounjaro, Wegovy, semaglutide, and tirzepatida—in Brazil and globally. These drugs are not intended for short-term weight loss or cosmetic purposes but are prescribed for chronic conditions like obesity (BMI ≥30) or BMI ≥27 with comorbidities such as type 2 diabetes, hypertension, or fatty liver. According to endocrinologist Karen de Marca, clinical evaluation goes beyond BMI, considering factors like genetic predisposition, history of weight gain, medication use, binge eating, and body composition. The primary benefits include significant fat loss, improved metabolic markers (blood sugar, cholesterol, blood pressure, liver fat), and indirect benefits like better physical stamina, self-esteem, and reduced sleep apnea severity. Long-term use is associated with lower risks of heart attack, stroke, certain cancers, osteoarthritis, and chronic kidney disease. However, the medication must be combined with sustainable lifestyle changes—balanced nutrition and physical activity—for optimal and lasting results. Common side effects include nausea, vomiting, diarrhea, constipation, bloating, and headaches, which typically diminish over time with dose titration and hydration. Warning signs requiring medical evaluation include persistent vomiting, continuous abdominal pain, dehydration, jaundice, chest pain, and severe mood changes. There is no fixed treatment duration; use can be long-term or lifelong, especially for chronic obesity, depending on clinical benefit, response, and individual risk-benefit assessment. Discontinuation may lead to weight regain due to restored appetite and reduced satiety, especially without maintained healthy habits. Some patients may require dose reduction or intermittent use under medical supervision. The article emphasizes that while tirzepatida may cause greater weight loss than semaglutide, it is not universally superior. Both drugs are most effective when paired with behavioral changes, as shown in clinical trials. Additionally, these medications may interfere with oral contraceptives due to gastrointestinal side effects, so barrier methods (e.g., condoms) are recommended during initiation or dose adjustment. The Brazilian regulatory agency Anvisa prohibits the use of compounded semaglutide and restricts tirzepatida to exceptional cases due to quality control risks in compounding pharmacies, including improper dosing, contamination, and unpredictable side effects. The article strongly advises against using non-industrial formulations and urges patients to consult a physician before starting treatment.\nOriginal language: pt\nPublish date: January 25, 2026 09:00 AM\nSource: [Revista Marie Claire Brasil](https://revistamarieclaire.globo.com/saude/noticia/2026/01/canetas-emagrecedoras-as-perguntas-que-voce-deve-fazer-ao-medico-antes-de-comecar-a-usar.ghtml)\n\n**Can toy-inspired clogs help spark a fresh fashion buzz for one footwear brand?**\nCrocs has entered a multiyear partnership with Lego to launch Lego-themed clogs, aiming to reinvigorate brand appeal and drive sales growth after a post-pandemic slowdown. The limited-edition clogs, priced at US$150 (approximately RM600), will be available globally on February 16, 2026, and are designed as collectible items for adults, featuring a Lego minifigure with four pairs of miniature Crocs shoes. The collaboration aligns with Crocs’ strategy to reconnect with younger consumers and boost engagement, following a decline in momentum: revenue growth slowed, with analysts projecting a 7.5% drop in the fourth quarter and continued struggles with its HeyDude brand. The partnership is seen as a 'radical move to rebuild brand heat' by Bloomberg analyst Abigail Gilmartin, citing past viral success with unconventional designs like the yellow boot. Lego, which reported record revenue and market share in 2024 and is expanding into gaming and digital toys, previously collaborated with Nike. The clogs debuted at Paris Fashion Week on January 21, 2026, with rapper Tommy Cash, and will be sold on both companies’ websites. The collection will include Lego-brick-inspired Jibbitz charms, and Crocs plans to expand beyond footwear with bags, phone cases, livestreams on TikTok Shop, and an in-person pop-up in Shanghai. Both brands emphasize self-expression, with Lego’s Satwik Saraswati stating the clog 'marks the beginning of a journey.' Financial terms were not disclosed.\nOriginal language: en\nPublish date: January 24, 2026 07:12 AM\nSource: [The Star ](https://www.thestar.com.my/lifestyle/style/2026/01/24/can-toy-inspired-clogs-help-spark-a-fresh-fashion-buzz-for-one-footwear-brand)\n\n**Obesity Fuels a $150 Billion Pharmaceutical Market, with Mexico as a Key Target**\nThe global pharmaceutical market for obesity treatments is projected to reach $150 billion by 2035, up from $105 billion forecasted in 2024, according to Morgan Stanley. This growth is driven by rising obesity rates—37% higher than a decade ago, with 1 in 8 people globally affected, per the World Health Organization. In Mexico, 7 out of 10 adults suffer from overweight or obesity, contributing to health costs of 82 to 98 billion pesos (around $5.1 billion USD) annually. The OECD estimates the pharmaceutical market for obesity treatments in Mexico could reach $200 million, yet only 4% of obese individuals currently receive pharmacological treatment. Investors and funds are shifting capital toward companies developing weight-control drugs, anticipating multi-billion-dollar returns. Key players include Eli Lilly, Roche, Amgen, Pfizer, Novo Nordisk, and Zealand Pharma. Pfizer acquired Metsera for approximately $7 billion, boosting its stock by over 5% in 2025. Eli Lilly, a U.S. leader in obesity drugs, reported 1.1 million active prescriptions for Mounjaro and Zepbound in the U.S., and in Mexico, it aims to treat over 250,000 patients with tirzepatide by 2025, with plans to triple that number by 2026. Eli Lilly’s stock rose over 45% in the past 12 months. In contrast, Novo Nordisk saw its market value drop 24.62% over the same period due to revised sales and profit forecasts, citing a slowdown in obesity treatment growth, especially in the U.S. Despite this, Novo Nordisk continues investing 80% of its $1 billion annual research budget in obesity, with semaglutide 2.4 mg showing up to 20% weight loss in one-third of patients. The company emphasizes that obesity is a chronic, non-communicable disease and faces challenges including widespread use of unregulated 'miracle' weight-loss products sold online for as little as $10–$60, which pose serious health risks such as brain damage, dependence, or death. Legally prescribed drugs in Mexico cost over 7,000 pesos per pen and require weekly administration, often for years, and are only available with a doctor’s prescription. The article highlights the tension between public health needs, pharmaceutical innovation, and the risks posed by unregulated alternatives.\nOriginal language: es\nPublish date: January 24, 2026 06:10 AM\nSource: [Milenio.com](https://www.milenio.com/negocios/obesidad-impulsa-mercado-farmaceutico-150-mil-millones)\n\n**Kangpei Resubmits CBL-514 IND Application with Revised Indication to FDA for Subcutaneous Fat Reduction**\nKangpei (6919) announced on January 23, 2026, that it is resubmitting its Investigational New Drug (IND) application for its new drug CBL-514 injection, combined with tirzepatide (Eli Lilly), to the U.S. FDA. The intended indication has been revised from 'weight management' to 'reduction of subcutaneous fat' following FDA feedback. The original Phase 2 clinical trial, CBL-0201WR, was completed and submitted to the FDA on December 24, 2025. The FDA advised that CBL-514 alone does not meet the criteria for weight management, prompting the company to modify the indication. The revised trial design remains unchanged: a randomized, placebo-controlled Phase 2 study to evaluate the efficacy, safety, and tolerability of CBL-514 plus tirzepatide in obese or overweight subjects. The primary efficacy endpoint will be changes in abdominal subcutaneous fat volume and body weight measured by MRI. The trial plans to enroll 100–120 participants. The company has completed Phase 1 and is preparing to reapply for Phase 2 approval. Phase 3 and NDA are still pending. The company cited the global market shift toward reducing fat mass and preventing metabolic deterioration post-treatment as key drivers, noting that GLP-1 drugs like tirzepatide reduce fat cell size temporarily but not number, leading to rebound weight gain and metabolic decline after discontinuation. With tirzepatide's cumulative sales reaching approximately $24.8 billion in the first three quarters of 2025 and Morgan Stanley projecting the global weight-loss drug market to reach $150 billion by 2035 at a 25% CAGR, there is significant market potential for therapies targeting persistent fat reduction. The company emphasized that the clinical development timeline is subject to change and that no financial projections are disclosed. Investors are advised to proceed with caution due to the high risk and uncertainty inherent in drug development.\nOriginal language: zh\nPublish date: January 23, 2026 05:00 PM\nSource: [MoneyDJ理財網](https://www.moneydj.com/kmdj/news/newsviewer.aspx?a=133c8707-1d70-4322-9e46-54378747893a)\n\n**Eli Lilly Soared by 39% in 2025, but Here's Another Healthcare Stock to Buy in 2026**\nEli Lilly (NYSE: LLY) delivered a 39% share gain in 2025, driven by strong performance in the high-growth obesity drug market, particularly through its tirzepatide-based products Mounjaro (for type 2 diabetes) and Zepbound (for weight loss). The global obesity drug market is projected to reach nearly $100 billion by the end of the decade. While Eli Lilly leads the market, the article highlights Viking Therapeutics (NASDAQ: VKTX) as a promising healthcare stock to consider for investment in 2026. Viking is developing VK2735, a dual GIP/GLP-1 receptor agonist in late-stage clinical trials—injectable in phase 3 and oral in phase 2—designed to regulate blood sugar and appetite similarly to Lilly’s tirzepatide. Phase 2 trial results showed up to 14.7% body weight reduction after 13 weeks without a plateau. Although Viking has no commercialized products and faces risks in drug development and regulatory approval, the company could attract strategic partnerships or acquisition interest. The Motley Fool recommends both Novo Nordisk and Viking Therapeutics, noting that while Viking carries high risk due to its early stage, it offers substantial upside potential if successful.\nOriginal language: en\nPublish date: January 23, 2026 10:35 AM\nSource: [The Motley Fool](https://www.fool.com/investing/2026/01/23/lilly-soared-in-2025-but-heres-another-buy/?source=newstex&utm_source=newstex&utm_medium=feed&utm_campaign=article&referring_guid=95e2979e-34c4-4c98-9eec-36962ec4947c)\n\n**Eli Lilly (LLY) Q3 2024 Earnings Call Transcript**\nEli Lilly (LLY) reported strong Q3 2024 financial results, with revenue growing 42% excluding the olanzapine portfolio, driven by Mounjaro and Zepbound sales. Global Mounjaro sales reached $3.1 billion, including $2.4 billion in the U.S. and $728 million internationally. Zepbound U.S. sales surpassed $1.2 billion, with 87% commercial formulary access as of October 1, 2024. Prescription volume for both drugs grew 25% sequentially. New product revenue increased by over $3 billion. Gross margin rose to 82.2%, supported by favorable product mix and higher realized prices. Operating income reached nearly $1.8 billion, while EPS was $1.18, up from $0.10 in Q3 2023, despite a $3.08 per share negative impact from acquired IPR&D charges. R&D expenses increased 13%, primarily due to investments in early- and late-stage development, with $2.8 billion in IPR&D charges from the Morphic Therapeutics acquisition. The company updated its 2024 revenue guidance to $45.4 billion to $46 billion, with the midpoint implying nearly 50% Q4 growth. Expected EPS is $12.05 to $12.55 (reported) and $13.02 to $13.52 (non-GAAP), reflecting $3.1 billion in IPR&D charges. Mounjaro and Zepbound supply is on track to exceed a 50% increase in sellable doses in H2 2024 vs. H2 2023. Key pipeline milestones include: 94% reduction in Type-2 diabetes risk and 23% sustained weight loss in pre-diabetic adults on tirzepatide (SURMOUNT-1); modified dosing for donanemab reduced ARIA-E incidence to 14% (TRAILBLAZER-ALZ 6); insulin efsitora alfa met all five Phase 3 primary endpoints with 40% lower severe hypoglycemia vs. insulin glargine (QWINT-1); and positive EMBER-3 data for imlunestrant in breast cancer, with an NDA submission planned by year-end. The company announced a $2 billion investment in Ireland and a separate $4.5 billion for the Lilly Medicine Foundry in Indiana, bringing total manufacturing expansion commitments since 2020 to over $20 billion. Capital returns totaled $1.6 billion via dividends and share repurchases. Regulatory approvals were received for Ebglyss (atopic dermatitis) in the U.S., Kisunla (early Alzheimer’s) in Japan and the U.K., and Omvoh gained first-line access at two of three major U.S. PBMs. Trulicity revenue declined 22% globally due to lower volume, partially offset by higher prices. U.S. channel inventory for Mounjaro and Zepbound decreased, reducing Q3 sales by a mid-single-digit percentage. Daniel Skovronsky stated, 'the modified titration reduced the incidence of ARIA-E to 14% compared with 24% for those receiving the standard dosing regimen,' supporting an upcoming supplemental FDA submission.\nOriginal language: en\nPublish date: January 22, 2026 05:20 PM\nSource: [The Motley Fool](https://www.fool.com/earnings/call-transcripts/2026/01/22/eli-lilly-lly-q3-2024-earnings-call-transcript/?source=newstex&utm_source=newstex&utm_medium=feed&utm_campaign=article&referring_guid=5b0adb3d-999b-46ff-8c3e-0bbc2c67f014)\n\n**Dr Reddy's lines up biosimilars and GLP 1 launches to counter slowdown in US business - BusinessToday**\nDr Reddy's Laboratories reported a mixed performance for the December quarter (Q3FY26), with consolidated revenue rising 4.4% year-on-year to ₹8,727 crore, while profit attributable to equity shareholders declined 14% to ₹1,210 crore and EBITDA fell 11% to ₹2,049 crore due to pricing pressure, an adverse product mix from reduced lenalidomide sales, and a one-time provision related to India's new labour codes. North America, the most pressured region, saw a 12% year-on-year revenue decline to ₹2,964 crore, driven by lower sales of the high-margin oral cancer drug lenalidomide and ongoing price erosion in generics. Management confirmed that residual lenalidomide contribution is nearing its end, increasing the strategic importance of non-US markets. In contrast, Europe revenue grew 20% to ₹1,448 crore, supported by new generic launches, integration of nicotine replacement therapy, and favourable currency movements. Emerging markets recorded 32% growth to ₹1,896 crore, led by Russia due to new launches, higher volumes, and rouble appreciation. India's domestic revenue rose 19% to ₹1,603 crore, driven by volume growth, price increases, new brand launches, and contributions from acquired brands; Dr Reddy's moved to ninth position in the Indian pharmaceutical market according to IQVIA data. The company is prioritizing deeper product deployment across its existing 45 emerging markets rather than geographic expansion. Capital allocation remains focused on India, emerging markets, and consumer health, with continued investments in generics and biosimilars amid expected global patent expiries. Key near-term product launches include semaglutide—approved in India with planned launches in India, emerging markets, and Canada—and the abatacept biosimilar, expected in key markets including the US and Europe. The company is expanding manufacturing and R&D capabilities in the GLP-1 class, noting its relevance beyond weight loss to diabetes, obesity, and cardiovascular indications. Brokerages, including Systematix Research and Equirus Research, stated the quarter was largely in line with expectations, with growth in India and emerging markets cushioning US weakness. They highlighted semaglutide and abatacept biosimilar as key medium-term drivers but warned of ongoing US business volatility and regulatory and execution risks.\nOriginal language: en\nPublish date: January 22, 2026 12:52 PM\nSource: [Business Today](https://www.businesstoday.in/latest/corporate/story/dr-reddys-lines-up-biosimilars-and-glp-1-launches-512442-2026-01-22)\n\n**The 2026 Medicine Cabinet: Ozempic's Legacy, Multi-Target Cancer Therapies, and Breakthroughs in Inflammatory Diseases**\nThe pharmaceutical landscape for 2026 is poised for transformative growth, led by GLP-1 agonists such as semaglutide (Ozempic, Wegovy) and tirzepatide (Mounjaro), which are no longer limited to treating obesity and diabetes but are showing significant benefits for cardiometabolic conditions like cardiovascular disease, non-alcoholic fatty liver disease, and sleep apnea—often independent of weight loss or glucose control. According to Evaluate's World Preview 2025, tirzepatide alone could reach $62 billion in revenue by 2030, surpassing Humira’s historical peak and doubling Keytruda’s 2024 sales. A major milestone for 2026 is expected with the arrival of oral GLP-1 therapies: Lilly’s orforglipron, the first chemically synthesized oral GLP-1 agonist, and Novo Nordisk’s oral semaglutide (Wegovy), approved by the FDA for diabetes and expected for obesity treatment. Novo Nordisk is set to be the first company to launch an oral GLP-1 for obesity in the U.S. The pipeline also includes next-generation multi-target drugs: Lilly’s retatrutide (a triple GLP-1/GIP/glucagon agonist) and Boehringer Ingelheim’s survodutida (a dual GLP-1/glucagon agonist), while Novo Nordisk’s cagrisema (a dual semaglutide/cagrilintide therapy) could reach $80 billion in peak sales. In inflammatory diseases, AbbVie’s Skyrizi (anti-IL-23) is projected to be the second-best-selling drug globally by 2030, and Rinvoq (upadacitinib), a JAK inhibitor, could approach $15 billion in sales. In oncology, the focus is shifting toward broad-spectrum therapies, including next-generation antibody-drug conjugates (ADCs) and bispecific/multispecific antibodies. Keytruda’s subcutaneous formulation and ivonescimab (a VEGF-PD-1 bispecific by Summit Therapeutics and Akeso), approved in China for non-small cell lung cancer, have shown superior efficacy to Keytruda in trials and could reach $27 billion in peak sales. Enhertu (trastuzumab deruxtecán), developed by Daiichi Sankyo and AstraZeneca, is also on track to exceed $15 billion in annual sales due to its broad efficacy across breast, gastric, and lung cancers.\nOriginal language: es\nPublish date: December 31, 2025 02:44 PM\nSource: [EL MUNDO](https://www.elmundo.es/ciencia-y-salud/salud/2025/12/31/6953b847e9cf4aca798b45aa.html)\n\n**'Old Money' vs. 'New Rich': Lilly Rises, Novo Nordisk Falls, but the Ultimate Battle in the Weight-Loss Drug Race Is Far from Over**\nLilly and Novo Nordisk have become global market barometers, with their every move influencing investor sentiment. On November 21, 2025, Lilly surpassed the $1 trillion market cap milestone, becoming the first pharmaceutical company to join the 'trillion-dollar club,' even surpassing Walmart in market value. In contrast, Novo Nordisk, after briefly becoming Europe's top stock, saw its share price drop nearly 50% year-to-date, losing approximately $190 billion in market value. The volatility underscores how any news from either company—on financial guidance, clinical results, or pricing strategies—can trigger rapid market reassessment. Once the leader in weight-loss drugs, Novo Nordisk now faces fierce competition from Lilly, which has shifted from follower to challenger. The race is far from over. Novo Nordisk’s GLP-1 drug, semaglutide, launched in 2021 for weight loss, initially dominated the market. Lilly responded in 2023 with tirzepatide, which gained approval for both diabetes and weight loss. The turning point came in May 2025, when Lilly’s SURMOUNT-5 trial showed tirzepatide achieved 20.2% average weight loss at week 72—significantly higher than semaglutide’s 13.7%—with a 1.47-fold relative weight reduction. This superiority translated into market share gains: in Q2 2025, tirzepatide sales ($85.8 billion) surpassed semaglutide ($80.3 billion), and in Q3, tirzepatide reached $101.03 billion versus semaglutide’s $88.62 billion. By Q3 2025, tirzepatide held 57.9% of U.S. prescription share, compared to semaglutide’s 41.7%. While semaglutide still leads in total revenue (254.62 billion USD vs. 248.37 billion USD), trend momentum favors Lilly. Lilly raised its 2025 revenue forecast to $630–635 billion, while Novo Nordisk repeatedly cut guidance, now projecting only 4–7% local currency operating profit growth—below its earlier 4–10% range. A key strategic divergence lies in pipeline diversification: Lilly’s multi-target approach includes Alzheimer’s drug donanemab, with projected sales rising from $465 million in 2024 to $3.2 billion by 2030. Novo Nordisk, reliant on semaglutide, is under pressure to expand beyond GLP-1. It has accelerated its oral semaglutide application after Lilly announced its oral GLP-1 orforglipron. In a bid to strengthen its pipeline, Novo Nordisk bid aggressively for Metsera but lost to Pfizer. This reflects broader strategic anxiety as the market shifts from a 'legacy vs. newcomer' rivalry to a more complex, multi-player competition. Novo Nordisk is undergoing frequent leadership changes and urgent strategic shifts, transitioning from market dominance to survival in a new era of therapeutic innovation.\nOriginal language: zh\nPublish date: November 26, 2025 03:25 PM\nSource: [每日经济新闻](https://www.nbd.com.cn/articles/2025-11-26/4158535.html)\n\n**Eli Lilly & Co. (LLY) Stock: Surges as Company Hits Historic $1 Trillion Market Cap**\nEli Lilly & Co. (LLY) briefly reached a $1 trillion market capitalization on November 21, 2025, becoming the first healthcare company—and only the second non-tech company in the U.S., after Berkshire Hathaway—to achieve this milestone. The stock traded around $1,059, rising over 36% year-to-date, driven by surging demand for its GLP-1 drugs Mounjaro and Zepbound. In Q3 2025, Mounjaro generated $6.52 billion in revenue, a 109% year-over-year increase, while Zepbound posted $3.59 billion, up 184%. Analysts project long-term dominance in the projected $150 billion global weight-loss drug market. Eli Lilly’s leadership is attributed to its innovative dual-hormone approach with tirzepatide, approved in 2022, and its upcoming oral versions of GLP-1 drugs. The company continues to outpace rivals Novo Nordisk and Pfizer, which acquired Metsera in a $10 billion deal. Despite intensifying competition, Eli Lilly’s strong financial performance, historical innovation—including the first commercial insulin in 1923 and Prozac—positions it as a central force in the future of metabolic health care.\nOriginal language: en\nPublish date: November 24, 2025 12:00 PM\nSource: [CoinCentral](https://coincentral.com/eli-lilly-co-lly-stock-surges-as-company-hits-historic-1-trillion-market-cap/)\n\n**Eli Lilly's market capitalization hits $1 trillion**\nEli Lilly became the first healthcare company to achieve a market capitalization of $1 trillion on Friday, joining the ranks of the world's largest corporations, traditionally dominated by tech giants. This milestone follows a 36% stock increase since January, driven primarily by the commercial success of its flagship drugs: Mounjaro, a diabetes treatment, and Zepbound, a weight-loss medication. The company, founded in 1876, gained historical prominence with the 1923 launch of the first commercially available insulin. The pivotal moment came in 2022 with the approval of tirzepatide, a dual-action hormone molecule, which revolutionized the antidiabetic market. Mounjaro generated over $1 billion in revenue during its first year, directly competing with Novo Nordisk’s treatments while offering a broader therapeutic approach.\nOriginal language: en\nPublish date: November 22, 2025 03:02 PM\nSource: [Market Screener](https://www.marketscreener.com/news/eli-lilly-s-market-capitalization-hits-1-trillion-ce7d5edcd98af32d)\n\n**Eli Lilly Makes History as First Pharma Company to Reach $1 Trillion Market Capitalization**\nEli Lilly & Company achieved a historic milestone on Friday, November 21, 2025, becoming the first pharmaceutical company to reach a market capitalization of $1.000 trillion (approximately €870 billion), entering the 'trillion-dollar club' previously dominated by technology firms. This financial feat is driven primarily by explosive global demand for two key drugs: Mounjaro, used for diabetes, and Zepbound, designed for obesity treatment. In the first quarter of 2025, Eli Lilly’s revenue grew by 45% year-over-year, largely fueled by sales of these two molecules. The company confirmed full-year revenue guidance between $58 and $61 billion for 2025 and reported that combined sales of Mounjaro and Zepbound surpassed $10 billion in the third quarter of 2025. The company’s success stems from a strategic focus on tirzepatide-based therapies, which target both GLP-1 and GIP hormones, offering dual benefits for blood sugar control and weight loss. Additionally, Lilly is advancing its pipeline with oral GLP-1 agonist orforglipron, showing promising clinical results, and expanding production capacity through new facilities. Despite strong margins and rising earnings forecasts, questions remain about the sustainability of this growth, especially if regulatory price pressures increase or if competitive therapies emerge.\nOriginal language: it\nPublish date: November 21, 2025 03:36 PM\nSource: [Money.it](https://www.money.it/record-per-eli-lilly-e-la-prima-societa-farmaceutica-a-superare-la-soglia-dei-1000-miliardi-di-valore-di-mercato)\n\n**Massive sales for weight loss drugs spur Eli Lilly's Q3**\nEli Lilly reported record-breaking Q3 2025 results, with total revenue surging 54% year-over-year to $17.6 billion—exceeding the Zacks consensus estimate of $16.01 billion by 9.91%. This growth was driven by strong demand for tirzepatide, marketed as Mounjaro (for type 2 diabetes) and Zepbound (for weight loss). Mounjaro generated $6.5 billion in Q3 2025, a 109% increase from the same quarter in 2024, while Zepbound sales rose 185% to $3.6 billion. Global demand for weight-loss drugs offset lower pricing, contributing to the robust performance. Lilly’s shares closed at $844.50 on October 30, 2025, up 3.6% from the prior day, with a market capitalization of $757 billion. Tirzepatide’s sales have surpassed MSD’s Keytruda, signaling a potential shift in the global pharmaceutical market leadership. In response, Lilly raised its full-year 2025 revenue guidance to $63–63.5 billion, up from $62 billion. The results were notable amid CVS Caremark’s announcement to make Novo Nordisk’s Wegovy the preferred GLP-1RA treatment from July 2025. On the same day, Novo Nordisk entered a $9 billion bidding war for Metsera, a move Pfizer criticized as 'reckless'—Pfizer had already agreed to acquire Metsera in September. Metsera is developing longer-acting GLP-1RAs, which Novo aims to integrate into its Ozempic and Wegovy brands. Looking ahead, Eli Lilly plans to submit its oral GLP-1RA candidate, orforglipron, to the FDA for obesity approval in 2025, with a type 2 diabetes application expected in 2026. GlobalData forecasts orforglipron could reach $11 billion in sales by 2031.\nOriginal language: en\nPublish date: October 31, 2025 12:03 PM\nSource: [Yahoo! Finance](https://finance.yahoo.com/news/massive-sales-weight-loss-drugs-120334698.html)\n\n**Eli Lilly's Unstoppable Rise: Obesity Drug Sales Soar and Profit Forecasts Upgraded**\nEli Lilly has achieved remarkable growth, with its two flagship GLP-1-based injectable drugs, Mounjaro and Zepbound (both based on tirzépatide, with different dosages), securing the top spot globally in less than two years. In the third quarter, tirzépatide sales for both brands reached $10.1 billion, surpassing Merck’s cancer drug Keytruda, the world’s top-selling medication. Zepbound sales rose 185% year-on-year to $3.5 billion, while Mounjaro exceeded analyst forecasts by $1 billion, reaching $6.5 billion in revenue. By September 30, tirzépatide generated $24.8 billion in revenue, accounting for over half of Eli Lilly’s total sales. This achievement is especially notable as CVS Health, the largest U.S. health products provider, removed Zepbound from its formulary in favor of Novo Nordisk’s Wegovy. Eli Lilly’s strong volume growth compensated for price reductions. The company’s third-quarter revenue surged 54% year-on-year to $45.8 billion. In response, management raised 2025 revenue guidance to $63–63.5 billion (up from $60–62 billion) and increased earnings per share forecast to $23–23.70 (up from $21.75–23), exceeding consensus expectations by over 5%.\nOriginal language: fr\nPublish date: October 31, 2025 08:30 AM\nSource: [Les Echos](https://investir.lesechos.fr/conseils-boursiers/conseils-actions/eli-lilly-poursuit-son-irresistible-ascension-les-ventes-des-medicaments-vedettes-contre-lobesite-senvolent-et-les-previsions-de-benefices-sont-encore-relevees-2195860)\n\n**Eli Lilly (LLY) Partners with Cipla to Market Tirzepatide in Ind**\nEli Lilly (LLY) has partnered with Indian pharmaceutical company Cipla to launch Tirzepatide, a weight-loss drug, in India under the brand name Yurpeak. The drug, a GLP-1 receptor agonist, will be available as a weekly pre-filled injector in six dosages (2.5 mg to 15 mg), mirroring Lilly’s Mounjaro Kwikpen. Eli Lilly will manufacture the product, while Cipla will handle marketing. The company, a major player in neuroscience, endocrinology, oncology, and immunology with a market cap of $728.6 billion, reports strong financial health: three-year revenue growth of 17.1%, an operating margin of 42.97%, and a net margin of 25.91%. The balance sheet shows a current ratio of 1.28 and a debt-to-equity ratio of 2.18, with an interest coverage ratio of 25.14, indicating manageable debt. The Altman Z-Score of 6.77 and Beneish M-Score of -1.87 suggest strong financial integrity and low earnings manipulation risk. However, 14 insider sell transactions in the past three months raise caution. Valuation metrics show a premium: P/E ratio of 53.12 (vs. historical median 40.25), P/S ratio of 13.77 (vs. 6.31), and P/B ratio of 39.88 (vs. 32.07). Analysts maintain a positive outlook with a target price of $905.2 and a recommendation score of 2. Institutional ownership is high at 87.4%, and technical indicators like RSI (55.03) suggest neutral momentum. The Piotroski F-Score of 7 confirms strong operational health. Sector risks include regulatory changes and competition. The stock’s beta of 0.39 indicates lower volatility than the market. Overall, the Cipla partnership is a strategic expansion move, but investors should weigh the premium valuation and industry risks.\nOriginal language: en\nPublish date: October 23, 2025 02:03 PM\nSource: [GuruFocus](https://www.gurufocus.com/news/3157517/eli-lilly-lly-partners-with-cipla-to-market-tirzepatide-in-india)\n\n**3 Things Investors Need to Know Ahead of Eli Lilly's Q3 Earnings Report | The Motley Fool**\nEli Lilly (LLY) is set to report third-quarter earnings on October 30, 2025, amid heightened investor scrutiny following a 10.7% stock decline from June 2024 to October 20, 2025. The company's rapid growth, driven by the dual GLP-1/GIP receptor agonist tirzepatide—marketed as Mounjaro for diabetes and Zepbound for weight management—has fueled a 32% revenue increase in 2024, with combined sales of the two drugs reaching $16.47 billion. In the first half of 2025, tirzepatide sales surged 121% year over year to $14.7 billion. However, concerns persist over generic and compounding pharmacy competition, though evidence suggests such threats remain limited. Despite strong performance, not all revenue streams are growing: Trulicity, a previously top-selling GLP-1 drug, is losing market share to Mounjaro, and Jardiance’s revenue is declining. Eli Lilly’s second-quarter revenue rose 38% year over year, but analysts at Goldman Sachs have downgraded global anti-obesity drug sales forecasts to $95 billion by 2030 from $130 billion. Tirzepatide’s superior efficacy comes with higher side effects—nausea—making it less tolerable than Novo Nordisk’s Wegovy. The stock trades at 35.8 times forward earnings, a premium valuation justified by a 122% EPS growth over three years. However, the company faces patent cliffs: Trulicity may lose exclusivity in the U.S. by 2027, risking biosimilar competition that could pressure Mounjaro sales. Off-label use could also erode Zepbound’s market. With the GLP-1 market maturing, sustained high growth rates may no longer be sustainable. If tirzepatide’s momentum slows, investors could face significant losses as the stock reverts to typical pharmaceutical industry growth rates.\nOriginal language: en\nPublish date: October 22, 2025 07:49 AM\nSource: [The Motley Fool](https://www.fool.com/investing/2025/10/22/3-things-investors-need-to-know-ahead-of-eli-lilly/)\n\n**These 2 AI Stocks Could Surpass Oracle in Market Cap by 2030**\nOracle (NYSE: ORCL) has transformed from a legacy database company into a key player in global AI infrastructure, with a $455 billion contracted backlog as of August 31, 2026, and a market cap exceeding $801 billion as of October 2025. Its cloud infrastructure revenue grew 54% year over year to $3.3 billion in Q1, driven by its AI database and multicloud strategy. However, Oracle missed analyst estimates for revenue and earnings, reported negative free cash flow, and plans $35 billion in capital expenditures for fiscal 2026, indicating a focus on long-term growth over short-term profits. Its reliance on large contracts, such as the $300 billion deal with OpenAI, exposes it to counterparty risk. Despite its strength, two companies—Palantir Technologies (NASDAQ: PLTR) and Eli Lilly (NYSE: LLY)—are seen as having higher growth potential. Palantir’s revenue rose 48% year over year to $1.03 billion in Q2, with a 46% operating margin and $569 million in adjusted free cash flow. Its Artificial Intelligence Platform (AIP), built on ontology-based architecture and supported by client boot camps, has accelerated sales and delivered real-world efficiency gains. Government contracts, including a $10 billion, 10-year U.S. Army deal, provide sticky revenue. Palantir’s stock trades at 204.8 times forward earnings, but if it sustains over 30% revenue growth and 40%+ operating margins, it could surpass Oracle’s market cap by 2030. Eli Lilly’s revenue grew 38% to $15.6 billion in Q2, with non-GAAP EPS up 61% to $6.31. Its tirzepatide-based drugs—Mounjaro and Zepbound—generated $5.2 billion and $3.4 billion in revenue, respectively, and the company produced 1.6 times more doses in H1 2025 than in H1 2024. Tirzepatide’s cardiovascular benefits may expand insurance coverage, and its oral candidate orforglipron could drive rapid adoption. With a pipeline including donanemab and retatrutide, and market research forecasting $62 billion in annual tirzepatide revenue by 2030, Eli Lilly could grow revenue at over 20% annually and maintain margins above 40%, potentially surpassing Oracle’s market cap before 2030. The article concludes with a promotional note about The Motley Fool’s Stock Advisor service, which did not include Oracle in its top 10 recommended stocks.\nOriginal language: en\nPublish date: October 08, 2025 10:31 AM\nSource: [NASDAQ Stock Market](https://www.nasdaq.com/articles/these-2-ai-stocks-could-surpass-oracle-market-cap-2030)\n\n"
  }
]