[
  {
    "title": "AskNews Research",
    "url": "",
    "snippet": "Here are the relevant news articles:\n\n**Where is Iran's Supreme Leader Khamenei? Has he fled the country or hiding? What do reports say?**\nAccording to reports from THE TIMES OF BENGAL published on January 25, 2026, Iran's Supreme Leader Ayatollah Ali Khamenei has been relocated to a highly secure, fortified underground shelter in Tehran. The move, cited by sources close to the Iranian government, was prompted by assessments from senior military and security officials who deemed a potential U.S. attack a serious threat. The report states that Khamenei has transferred executive command to one of his sons, specifically his third son, Masoud Khamenei, who is now managing daily operations of the Supreme Leader's office and serving as the primary point of contact (POC) with the government's executive branches. The underground facility is described as having multiple interconnected tunnel-like passages, emphasizing its high level of security. The report emerges amid heightened tensions between Iran and the United States, marked by escalating rhetoric and military movements. No official confirmation from Iranian authorities has been provided.\nOriginal language: en\nPublish date: January 25, 2026 10:20 AM\nSource: [THE TIMES OF BENGAL](https://www.thetimesofbengal.com/international/where-is-irans-supreme-leader-khamenei-has-he-fled-the-country-or-hiding-what-do-reports-say/)\n\n**Where is Iran' Supreme Leader Khamenei?**\nIran's Supreme Leader Ayatollah Ali Khamenei is reportedly located in a highly secure, underground shelter in Tehran, according to sources close to the Iranian government. The move is said to have been prompted by a heightened assessment of the threat of a potential U.S. military attack. In the absence of Khamenei, his third son, Masoud Khamenei, is overseeing the daily operations of the Supreme Leader's office and serving as the primary point of contact (POC) with the executive branches of government. The underground facility is described as fortified with multiple interconnected tunnel-like passages. This development comes amid a renewed escalation in military posturing and rhetoric between Iran and the United States, raising concerns over the possibility of a direct military confrontation.\nOriginal language: en\nPublish date: January 25, 2026 10:11 AM\nSource: [India News, Breaking News, Entertainment News | India.com](https://www.india.com/news/world/where-is-irans-supreme-leader-khamenei-has-he-fled-the-country-or-hiding-in-ultra-secure-shelter-what-do-reports-say-tehran-usa-ayatollah-masoud-khamenei-donald-trump-pentagon-centcom-8280957/)\n\n**Khamenei Has Hidden in a Bunker**\nIran's Supreme Leader Ali Khamenei is reportedly hiding in a fortified bunker in Tehran amid concerns over a potential U.S. military strike. According to The Times of Israel, citing Gazeta.ru, high-ranking officials assessed an 'increased risk of a potential U.S. attack' following the deployment of significant U.S. military forces to the region. The bunker, described by Iran International as containing 'interconnected tunnels,' is said to be heavily fortified, though the duration of Khamenei's stay is unspecified. While Khamenei remains in concealment, his third son, Masoud Khamenei, has assumed daily management of the Supreme Leader's office and serves as the 'primary channel of communication' with government leaders.\nOriginal language: ru\nPublish date: January 25, 2026 10:02 AM\nSource: [Информационный портал Day.Az](https://news.day.az/world/1811794.html)\n\n**Potential American Strike Sparks Iranian Supreme Leader Ali Khamenei's Move to Underground Bunker**\nThere are indications of a potential American strike, prompting Iran's Supreme Leader Ali Khamenei to relocate to a fortified underground bunker complex in Tehran. The security circle surrounding Khamenei reported a perceived threat to his safety, leading to the implementation of extraordinary measures, including limiting public appearances and relocating the administrative center of his office. His son, Masoud, has assumed daily oversight and serves as the primary liaison with state and government institutions.\nOriginal language: ar\nPublish date: January 24, 2026 04:30 PM\nSource: [الصباح العربي](https://www.sabaharabi.com/697889)\n\n**Iran: Khamenei Moved to Underground Shelter Amid Rising Risk of U.S. Attack**\nIran International, a London-based opposition channel, reported on January 24, 2026, that Iran's Supreme Leader, Ali Khamenei, had been moved to a specially fortified underground shelter in Tehran. The transfer followed assessments by senior military and security officials indicating an increased risk of a potential U.S. attack. The facility is described as a fortified site with interconnected tunnels. According to two sources close to the Iranian government, Masoud Khamenei, the third son of the Supreme Leader, has assumed daily management of the leader’s office and serves as the primary communication channel with the executive branches of the government.\nOriginal language: it\nPublish date: January 24, 2026 04:15 PM\nSource: [Lapresse](https://www.lapresse.it/esteri/2026/01/24/iran-media-khamenei-trasferito-in-rifugio-sotterraneo-per-rischi-attacco-usa/)\n\n**Ali Khamenei: Portrait of a Theocratic Tyrant**\nAli Khamenei, the Supreme Leader of Iran, is portrayed in a highly critical and condemnatory article as a figure who has ruled the country for over four decades through fear, religious mysticism, and state-sponsored violence. The article traces his rise from a minor cleric to the head of a theocratic regime, emphasizing his role in mass executions, including the 1988 prison massacres, where between 2,800 and 5,000 political prisoners were executed in secret. According to the article, Khamenei justified these killings as necessary to eliminate 'enemies of God' and 'hypocrites' linked to the MEK. The piece cites a 1997 German court verdict that directly implicated Khamenei, President Ali Rafsandjani, and Foreign Minister Ali Velayati in the 1992 Mykonos restaurant assassination in Berlin. It further details a pattern of transnational assassinations of Iranian dissidents in the 1990s, with at least 50 killed abroad, and internal repression under Khamenei’s leadership, including the 1998 'chain murders' of intellectuals and the violent crackdowns on protests in 1999, 2009, 2017, 2019, and 2022–2023. The article describes Khamenei as increasingly isolated, living in a heavily secured compound, disconnected from reality, and promoting a myth of divine infallibility. His rhetoric, such as stating 'the Almighty God was speaking through me,' reflects a megalomania described by exiled opposition figures. The article claims that under his rule, up to 30,000 people have died in purges and executions. In a 2026 statement, Khamenei openly admitted that the Islamic Republic was founded on the blood of hundreds of thousands and vowed not to retreat from its violent foundations. The piece concludes that his regime stands as one of the darkest theocracies of the modern era, where faith is weaponized to justify mass destruction.\nOriginal language: fr\nPublish date: January 24, 2026 10:05 AM\nSource: [www.le360.ma](https://fr.le360.ma/monde/ali-khamenei-portrait-epouvantable_X2R7QOZIK5FENDHHD43EEQIX2I/)\n\n**Iran’s Supreme Leader Khamenei Moves Underground Amid Escalating U.S.-Iran Tensions and Domestic Unrest**\nAmid escalating tensions between the U.S. and Iran, reports have emerged that Iran's Supreme Leader Ayatollah Ali Khamenei has moved into an underground bunker in Tehran, reportedly due to concerns over a potential American strike. While the Iranian government has not officially confirmed the move, sources cited by Iran International indicate it was driven by security reasons amid heightened U.S.-Iran tensions. The U.S. has increased its military presence in the Middle East, including deploying warships and the deadly Tomahawk missiles. Iran’s Defense Ministry spokesperson, Brigadier General Reza Talaei-Nik, claimed that Iran’s missile capabilities have significantly strengthened since the 12-day conflict with Israel in June 2024, citing improvements in both quantity and quality, along with enhanced domestic missile production and defense systems. The situation is further complicated by ongoing domestic unrest, including large-scale protests at the end of December 2025 that were violently suppressed, with human rights organizations reporting over 25,000 deaths—far exceeding Iran’s official figure of approximately 3,100. Additionally, the Trump administration is reportedly planning to deport Iranian immigrants from the U.S. These developments collectively signal a highly precarious moment in the Middle East, with rumors of Khamenei transferring power to his third son potentially indicating a major shift in Iran’s internal politics and regional dynamics.\nOriginal language: hi\nPublish date: January 25, 2026 12:16 PM\nSource: [News18 India](https://hindi.news18.com/world/middle-east-iran-supreme-leader-khamenei-underground-shelter-amid-fears-of-us-attack-tomahawk-cruise-missile-abraham-lincon-nears-10106471.html)\n\n**Where is Iran's Supreme Leader Khamenei? Has he fled the country or hiding? What do reports say?**\nAccording to reports from THE TIMES OF BENGAL published on January 25, 2026, Iran's Supreme Leader Ayatollah Ali Khamenei has been relocated to a highly secure, fortified underground shelter in Tehran. The move, cited by sources close to the Iranian government, was prompted by assessments from senior military and security officials who deemed a potential U.S. attack a serious threat. The report states that Khamenei has transferred executive command to one of his sons, specifically his third son, Masoud Khamenei, who is now managing daily operations of the Supreme Leader's office and serving as the primary point of contact (POC) with the government's executive branches. The underground facility is described as having multiple interconnected tunnel-like passages, emphasizing its high level of security. The report emerges amid heightened tensions between Iran and the United States, marked by escalating rhetoric and military movements. No official confirmation from Iranian authorities has been provided.\nOriginal language: en\nPublish date: January 25, 2026 10:20 AM\nSource: [THE TIMES OF BENGAL](https://www.thetimesofbengal.com/international/where-is-irans-supreme-leader-khamenei-has-he-fled-the-country-or-hiding-what-do-reports-say/)\n\n**Did Khamenei Hide in a Bunker Out of Fear of Trump? Learn Who Has Been Given Iran's Command**\nAccording to a report by Times Network Hindi, Ayatollah Ali Khamenei, Iran's Supreme Leader, has reportedly taken refuge in a special underground bunker in Tehran. The report cites two sources close to the Iranian government, stating that senior military and security officials have assessed the possibility of a potential American attack as a serious threat, prompting the decision. In parallel, Khamenei has reportedly handed over operational command to one of his sons. The report was published on January 25, 2026, at 10:18.\nOriginal language: hi\nPublish date: January 25, 2026 10:18 AM\nSource: [Times Network Hindi](https://www.timesnowhindi.com/world/iran-america-tension-khamenei-underground-bunker-us-navy-middle-east-warning-article-153504020)\n\n**Where is Iran' Supreme Leader Khamenei?**\nIran's Supreme Leader Ayatollah Ali Khamenei is reportedly located in a highly secure, underground shelter in Tehran, according to sources close to the Iranian government. The move is said to have been prompted by a heightened assessment of the threat of a potential U.S. military attack. In the absence of Khamenei, his third son, Masoud Khamenei, is overseeing the daily operations of the Supreme Leader's office and serving as the primary point of contact (POC) with the executive branches of government. The underground facility is described as fortified with multiple interconnected tunnel-like passages. This development comes amid a renewed escalation in military posturing and rhetoric between Iran and the United States, raising concerns over the possibility of a direct military confrontation.\nOriginal language: en\nPublish date: January 25, 2026 10:11 AM\nSource: [India News, Breaking News, Entertainment News | India.com](https://www.india.com/news/world/where-is-irans-supreme-leader-khamenei-has-he-fled-the-country-or-hiding-in-ultra-secure-shelter-what-do-reports-say-tehran-usa-ayatollah-masoud-khamenei-donald-trump-pentagon-centcom-8280957/)\n\n**Khamenei Has Hidden in a Bunker**\nIran's Supreme Leader Ali Khamenei is reportedly hiding in a fortified bunker in Tehran amid concerns over a potential U.S. military strike. According to The Times of Israel, citing Gazeta.ru, high-ranking officials assessed an 'increased risk of a potential U.S. attack' following the deployment of significant U.S. military forces to the region. The bunker, described by Iran International as containing 'interconnected tunnels,' is said to be heavily fortified, though the duration of Khamenei's stay is unspecified. While Khamenei remains in concealment, his third son, Masoud Khamenei, has assumed daily management of the Supreme Leader's office and serves as the 'primary channel of communication' with government leaders.\nOriginal language: ru\nPublish date: January 25, 2026 10:02 AM\nSource: [Информационный портал Day.Az](https://news.day.az/world/1811794.html)\n\n**Khamenei Seeks Shelter in Underground Bunker Amid Fears of U.S. Attack**\nIran's Supreme Leader Ali Khamenei is reportedly hiding in a fortified underground bunker in Tehran amid concerns over a potential U.S. attack. According to The Times of Israel, citing the opposition news site Iran International, senior officials assessed an 'increased risk of a potential U.S. strike' due to the deployment of significant U.S. military forces in the region. The bunker, described as having 'interconnected tunnels,' is said to be well-protected, though the duration of Khamenei's stay has not been specified. While in hiding, his third son, Masoud Khamenei, has assumed daily management of the Supreme Leader's office and serves as the 'primary communication channel' with government leaders. In January 2026, U.S. Senator Lindsey Graham, listed as a terrorist and extremist by Russia, proposed to President Donald Trump that Khamenei be eliminated during ongoing protests in Iran.\nOriginal language: ru\nPublish date: January 25, 2026 09:53 AM\nSource: [Рамблер](https://news.rambler.ru/world/55945271-smi-soobschili-chto-iranskiy-lider-spryatalsya-v-bunkere-v-ozhidanii-udara-ssha/)\n\n**Trump's Warning Sparks Iran's Supreme Leader to Go Underground; India Thanked Amid Escalating Tensions**\nTensions between Iran and the United States have reached a peak. According to reports, Iran's Supreme Leader Ayatollah Ali Khamenei has gone underground in a secure bunker in Tehran amid fears of a potential U.S. attack. The facility reportedly includes interconnected tunnels and modern security systems. During Khamenei's absence, his third son, Masoud Khamenei, is managing daily operations and serving as the primary communication channel with the government. Iranian President Masoud Pezeshkian has warned that any attack on the Supreme Leader would be considered a full-scale war against the entire country. This follows a warning by former U.S. President Trump, who stated that a U.S. 'armada' is moving toward Iran, citing the deployment of the aircraft carrier USS Abraham Lincoln and several destroyers in the Indian Ocean. Trump claimed that his tough stance had caused Iran to cancel plans to execute nearly 840 people. The report also notes that violent crackdowns on protests in Iran since late December 2025 may have resulted in between 5,000 and 20,000 deaths, according to human rights activists and UN experts. On January 8, 2026, Iran implemented its longest and most extensive internet blackout in history, severing nearly all external communication.\nOriginal language: hi\nPublish date: January 25, 2026 06:32 AM\nSource: [Hindustan](https://www.livehindustan.com/international/when-trump-issued-a-threat-iran-supreme-leader-khamenei-hid-in-a-bunker-why-did-he-thank-india-201769322570310.html)\n\n**Potential American Strike Sparks Iranian Supreme Leader Ali Khamenei's Move to Underground Bunker**\nThere are indications of a potential American strike, prompting Iran's Supreme Leader Ali Khamenei to relocate to a fortified underground bunker complex in Tehran. The security circle surrounding Khamenei reported a perceived threat to his safety, leading to the implementation of extraordinary measures, including limiting public appearances and relocating the administrative center of his office. His son, Masoud, has assumed daily oversight and serves as the primary liaison with state and government institutions.\nOriginal language: ar\nPublish date: January 24, 2026 04:30 PM\nSource: [الصباح العربي](https://www.sabaharabi.com/697889)\n\n**Iran: Khamenei Moved to Underground Shelter Amid Rising Risk of U.S. Attack**\nIran International, a London-based opposition channel, reported on January 24, 2026, that Iran's Supreme Leader, Ali Khamenei, had been moved to a specially fortified underground shelter in Tehran. The transfer followed assessments by senior military and security officials indicating an increased risk of a potential U.S. attack. The facility is described as a fortified site with interconnected tunnels. According to two sources close to the Iranian government, Masoud Khamenei, the third son of the Supreme Leader, has assumed daily management of the leader’s office and serves as the primary communication channel with the executive branches of the government.\nOriginal language: it\nPublish date: January 24, 2026 04:15 PM\nSource: [Lapresse](https://www.lapresse.it/esteri/2026/01/24/iran-media-khamenei-trasferito-in-rifugio-sotterraneo-per-rischi-attacco-usa/)\n\n**Ali Khamenei: Portrait of a Theocratic Tyrant**\nAli Khamenei, the Supreme Leader of Iran, is portrayed in a highly critical and condemnatory article as a figure who has ruled the country for over four decades through fear, religious mysticism, and state-sponsored violence. The article traces his rise from a minor cleric to the head of a theocratic regime, emphasizing his role in mass executions, including the 1988 prison massacres, where between 2,800 and 5,000 political prisoners were executed in secret. According to the article, Khamenei justified these killings as necessary to eliminate 'enemies of God' and 'hypocrites' linked to the MEK. The piece cites a 1997 German court verdict that directly implicated Khamenei, President Ali Rafsandjani, and Foreign Minister Ali Velayati in the 1992 Mykonos restaurant assassination in Berlin. It further details a pattern of transnational assassinations of Iranian dissidents in the 1990s, with at least 50 killed abroad, and internal repression under Khamenei’s leadership, including the 1998 'chain murders' of intellectuals and the violent crackdowns on protests in 1999, 2009, 2017, 2019, and 2022–2023. The article describes Khamenei as increasingly isolated, living in a heavily secured compound, disconnected from reality, and promoting a myth of divine infallibility. His rhetoric, such as stating 'the Almighty God was speaking through me,' reflects a megalomania described by exiled opposition figures. The article claims that under his rule, up to 30,000 people have died in purges and executions. In a 2026 statement, Khamenei openly admitted that the Islamic Republic was founded on the blood of hundreds of thousands and vowed not to retreat from its violent foundations. The piece concludes that his regime stands as one of the darkest theocracies of the modern era, where faith is weaponized to justify mass destruction.\nOriginal language: fr\nPublish date: January 24, 2026 10:05 AM\nSource: [www.le360.ma](https://fr.le360.ma/monde/ali-khamenei-portrait-epouvantable_X2R7QOZIK5FENDHHD43EEQIX2I/)\n\n**Who Is Ali Khamenei, the Supreme Leader Who Has Held Power in Iran for Over 30 Years?**\nAli Khamenei, the Supreme Leader of Iran, has held the position since 1989, succeeding Ayatollah Ruhollah Khomeini after his death. At 86 years old, Khamenei serves as both head of state and commander-in-chief, wielding ultimate authority over national policies, the military—including the Revolutionary Guard—and foreign strategy, including Iran’s nuclear program and stance toward Israel and the West. Born in 1939 in Mashhad, he was deeply influenced by Khomeini during the 1960s, becoming a key figure in the anti-monarchical movement against Shah Mohammad Reza Pahlavi. After the 1979 Islamic Revolution, he rose to prominence, was elected president in 1981 with 95% of the vote, and re-elected in 1985. Following Khomeini’s death, despite lacking the religious rank of 'marja' required by the constitution, Khamenei was temporarily appointed while the constitution was amended to confirm his leadership. Over his 35-year rule, he has maintained a strong personality cult, suppressed dissent through violence, and controlled a vast economic empire estimated at $95 billion by Reuters in 2018, largely built through the confiscation of property from citizens and religious minorities. He also appoints judicial leaders and controls state media. His leadership has been challenged by ongoing protests demanding his removal, which have persisted for over two weeks as of January 14, 2026.\nOriginal language: pt\nPublish date: January 14, 2026 06:23 PM\nSource: [GZH](https://gauchazh.clicrbs.com.br/colunistas/rodrigo-lopes/noticia/2026/01/quem-e-ali-khamenei-o-lider-supremo-que-esta-ha-mais-de-30-anos-no-poder-do-ira-cmkebmwk6013g011z7rveb3e1.html)\n\n**Ali Khamenei, the Man Who Embodies Absolute Power at the Heart of Iran in Crisis**\nAli Khamenei has served as the Supreme Leader of Iran since 1989, the figure who has most embodied the continuity and rigidity of the Islamic Republic following the death of its founder, Ruhollah Khomeini. Born on April 19, 1939, in Mashhad, a holy city for Shia Islam, Khamenei was educated in major theological centers including Najaf and Qom, where he developed an early ideological and political alignment with the Khomeinist revolutionary movement. After the fall of the Shah in 1979, he quickly entered the new power structure, serving on the Council of the Revolution and later becoming President of the Islamic Republic during the most difficult years of the Iran-Iraq War. Upon Khomeini’s death, Khamenei was selected as Supreme Leader in an exceptional transition that required a constitutional amendment to meet political needs. Since then, he has become the central figure of the system, holding ultimate authority over domestic policy, security, judiciary, and foreign affairs.\nOriginal language: it\nPublish date: January 12, 2026 04:32 PM\nSource: [Rai news](https://www.rainews.it/articoli/2026/01/ali-khamenei-luomo-che-rappresenta-il-potere-assoluto-al-centro-delliran-in-crisi-70f79646-3ed5-4194-bbfc-dd69d7a16873.html)\n\n**Who is Iran's supreme leader Ayatollah Ali Khamenei?**\nIran's Supreme Leader, Ayatollah Ali Khamenei, faces mounting pressure amid widespread anti-government protests that began on December 28, 2025, and have resulted in at least 544 deaths according to activists, with official figures expected to be higher. The protests were sparked by a call from exiled Crown Prince Reza Pahlavi. US President Donald Trump claimed Khamenei was considering fleeing to Russia, suggesting Iran was 'on the verge of collapsing.' In response, Khamenei denounced Trump as 'arrogant' and vowed the Islamic Republic would not yield to foreign 'mercenaries.' Born in 1939 in Mashhad, Khamenei was a political activist against the Shah, became a close aide to Ayatollah Khomeini after the 1979 Revolution, and survived a 1981 assassination attempt that left him paralyzed in his right arm. He served as Iran's president from 1981 to 1989, then became supreme leader following Khomeini’s death, making him the longest-serving head of state in the Middle East. Under his rule, Khamenei consolidated power by strengthening the Revolutionary Guard, expanding its economic influence, and establishing the 'Axis of Resistance' through proxy networks across the region. He has historically responded to protests with force, including during the 2009, 2017, 2019, and 2022 uprisings. In June 2025, the US bombed three Iranian nuclear facilities during a 12-day war with Iran, but officials admitted the strikes failed to destroy Iran’s alleged nuclear weapons program. As of January 12, 2026, the US military is evaluating options including cyber attacks and direct strikes, with Trump warning that any retaliation from Iran would be met with 'levels that they've never been hit before.'\nOriginal language: en\nPublish date: January 12, 2026 03:15 PM\nSource: [ITV Hub](https://www.itv.com/news/2026-01-12/who-is-irans-supreme-leader-ayatollah-ali-khamenei)\n\n**Who Is Ali Khamenei, the Supreme Leader at the Heart of Iran's Crisis**\nAli Khamenei, the Supreme Leader of Iran since 1989, remains at the center of the country's political crisis. Born on April 19, 1939, in Mashhad—a holy city for Shia Muslims—Khamenei began his religious education in a maktab and later studied at the seminaries of Mashhad, Najaf, and Qom, where he was influenced by prominent scholars including Ruhollah Khomeini. He became a committed revolutionary, joining opposition to the Shah’s regime and the U.S.-aligned policies, leading to multiple arrests in the 1960s. In 1979, he was appointed to the Council of the Islamic Revolution. He served as Iran’s President for two consecutive terms from 1980 to 1989. Throughout his tenure, Khamenei has maintained a staunch anti-Western stance, declaring, 'There is no trust in America,' and referring to Israel as 'a cancer.' He vowed retaliation after the U.S. assassination of Qassem Soleimani in January 2020, ordering missile strikes on U.S. bases in Iraq. The accidental downing of a Ukrainian passenger plane by Iran’s Revolutionary Guard in January 2020, which killed 176 people, triggered widespread protests. Khamenei downplayed the severity of the COVID-19 pandemic, stating it 'is nothing extraordinary.' His leadership has come under increasing scrutiny amid regional conflicts, economic hardship, and speculation over his health and succession, fueled by repeated rumors of his hospitalization or death. His legacy and authority are now central to both domestic and international political dynamics in Iran.\nOriginal language: it\nPublish date: January 12, 2026 01:16 PM\nSource: [adnkronos.com](https://www.adnkronos.com/internazionale/esteri/crisi-iran-chi-e-ali-khamenei-luomo-diventato-ayatollah-in-una-notte_3VQcRQ3gffTR4lYhvKpoHc)\n\n**Who Is Ayatollah Ali Khamenei, Iran's Supreme Leader?**\nAli Khamenei, the 86-year-old Supreme Leader of Iran, has remained unharmed in recent Israeli attacks on Iran, which killed high-ranking figures such as General Hossein Salami, head of Iran's Islamic Revolutionary Guard Corps (IRGC), and Mohammad Bagheri, Chief of Staff of the Iranian Armed Forces. According to three U.S. officials speaking to CBS News, former U.S. President Donald Trump reportedly instructed Israel not to target Khamenei. Khamenei has held power for 35 years, serving as both the country's religious and political leader, with ultimate authority over public policy. He was last seen in public in October 2024, after the assassination of his longtime ally Hassan Nasrallah, leader of Lebanon’s Hezbollah, by Israeli forces. Born in 1939 in Mashhad, Khamenei was deeply influenced by Ayatollah Ruhollah Khomeini during the 1960s and became a key organizer of the Iranian opposition. He participated in the 1978 protests that led to the 1979 Revolution, was appointed Friday prayer leader in Tehran in 1980, and became president in 1981 after surviving a bomb attack that paralyzed his right arm. He served as president until 1989, when Khomeini died. Though not initially qualified by constitutional standards (lacking the rank of marja), Khamenei was temporarily appointed, the constitution was amended, and he was confirmed as Supreme Leader. In 2018, a leaked video revealed his initial disbelief and uncertainty during the 1989 selection process. Since then, he has consolidated power through parallel institutions like the IRGC, suppressed dissent, and maintained a hardline stance on social and political issues. His regime has been accused of repressing protests—such as the 2022 demonstrations following the death of Mahsa Amini, which led to over 500 reported deaths—and of assassinating exiled dissidents. Khamenei’s foreign policy has centered on supporting proxy groups in the so-called 'Axis of Resistance,' including Hezbollah, Hamas, and the Houthis. However, recent Israeli operations—including pager attacks in September 2024 that killed Hezbollah leaders and the assassination of Nasrallah—have significantly weakened these allies. Additionally, Syrian dictator Bashar al-Assad, another key ally, was overthrown in December 2024.\nOriginal language: pt\nPublish date: January 11, 2026 08:32 PM\nSource: [Último Segundo](https://ultimosegundo.ig.com.br/agencias/dw/2026-01-11/quem-e-o-aiatola-ali-khamenei--lider-supremo-do-ira.html)\n\n**Who is Ali Khamenei, the Ayatollah and Supreme Leader of Iran Who Has Held Power for Decades**\nAli Khamenei has served as Iran's Supreme Leader since 1989, succeeding Ayatollah Ruhollah Khomeini after the 1979 Islamic Revolution. As the highest political and religious authority in the Islamic Republic, Khamenei holds control over key state institutions, including the Islamic Revolutionary Guard Corps and the security apparatus. His leadership comes amid massive protests, which international media report have resulted in over 500 deaths and more than 10,000 arrests. These protests have intensified pressure on the regime, coinciding with speculation about a potential military intervention by the United States, as claimed by Donald Trump.\nOriginal language: es\nPublish date: January 11, 2026 07:49 PM\nSource: [Ambito](https://www.ambito.com/mundo/quien-es-ali-jamenei-el-ayatola-y-lider-supremo-iran-que-controla-el-poder-hace-decadas-n6233002)\n\n**Who Is Ali Khamenei, the Ayatollah and Supreme Leader of Iran?**\nAli Khamenei has been the Supreme Leader of Iran since 1989, succeeding Ruhollah Khomeini after the 1979 Islamic Revolution. Born in 1939 in Mashhad, he was raised in a religious family and became a cleric at age 11, studying Islamic law and Arabic. He was a key figure in the opposition to the Shah, Mohammad Reza Pahlavi, and was imprisoned six times before being exiled in 1975, returning in 1978. After the revolution, he held multiple high-ranking positions, including Vice Minister of Defense, head of the Islamic Revolutionary Guard Corps (IRGC), Friday Prayer Leader in Tehran, and Member of the Islamic Consultative Assembly. He served as President of Iran from 1981 to 1989, working closely with Khomeini during the Iran-Iraq War. Following Khomeini’s death, the Assembly of Experts appointed him Supreme Leader through political consensus and reinterpretation of religious leadership. He consolidated absolute power over Iran’s executive, legislative, and judicial branches, maintaining control through the IRGC, the judiciary, and state media. Despite varying presidential administrations, Khamenei remains the ultimate authority on domestic and foreign policy, upholding a confrontational stance toward the West, particularly the United States and Israel. His leadership has been highlighted internationally amid protests in Iran and U.S. threats, including from former President Donald Trump.\nOriginal language: es\nPublish date: January 09, 2026 01:31 AM\nSource: [El Destape](https://www.eldestapeweb.com/internacionales/iran/quien-es-ali-jamenei-el-ayatola-y-lider-supremo-de-iran-20261822344)\n\n**Supreme Leader Khamenei: Iranian People Foil Enemy’s Attempts to Alter National Identity**\nIran's Supreme Leader, Ayatollah Ali Khamenei, stated that the Iranian people have thwarted persistent efforts by adversaries to alter the nation's religious, historical, and cultural identity, reaffirming Iran's resilience against Western military and propaganda pressures. Speaking during a passionate commemoration event marking the birthday of Lady Fatima al-Zahra (Peace be upon her), Khamenei praised the Iranian people's national resistance and emphasized that despite challenges and shortcomings, Iran continues its forward trajectory. He highlighted the need for both defensive and offensive readiness to counter the enemy's propaganda and media campaigns targeting beliefs, hearts, and minds. Khamenei lauded the virtues of Lady Fatima al-Zahra, describing her as beyond human comprehension, and urged emulation in piety, justice, religious advocacy, marital conduct, and child-rearing. He underscored the significance of religious chanting (en'as) as a powerful force in 'resistance literature,' noting that ideas without proper literary expression fade over time. He defined national resistance as enduring pressures—military, economic, media, cultural, and political—exerted by oppressive powers, particularly Western propaganda aimed at regional expansion, resource control, and identity transformation. Khamenei noted that such attempts have spanned over a century and were ultimately defeated by the Islamic Revolution. He affirmed that the concept and literature of resistance have spread from Iran to other nations, and that Iran’s resilience has been tested by pressures sufficient to topple any other country. He emphasized that the enemy now faces a 'propaganda and media war' after realizing military pressure alone cannot subdue Iran. Khamenei called for deep understanding of the enemy’s objectives and targets, including Islamic, Shia, and revolutionary knowledge, and urged religious chanters to transform Husseini gatherings into centers of revolutionary commitment and youth protection. He stressed the importance of clarifying religious and jihad-related concepts using the lives of the Imams (Peace be upon them), countering enemy weaknesses while defending their own positions, and explaining Quranic principles in personal, social, and political domains. He concluded that well-crafted religious chants and accurate content can be more impactful than multiple sermons, warning against the infiltration of 'tyrannical modern culture' into Husseini gatherings. Finally, he dismissed minor issues like dust in Khuzestan as negligible compared to larger national challenges, affirming that the Iranian people continue to achieve progress through sincerity, dedication, and good intentions.\nOriginal language: ar\nPublish date: December 11, 2025 02:29 PM\nSource: [قناة العالم الاخبارية](https://www.alalam.ir/news/7360028/%D9%82%D8%A7%D8%A6%D8%AF-%D8%A7%D9%84%D8%AB%D9%88%D8%B1%D8%A9-%D8%A7%D9%84%D8%B4%D8%B9%D8%A8-%D8%A7%D9%84%D8%A5%D9%8A%D8%B1%D8%A7%D9%86%D9%8A-%D8%A3%D8%AD%D8%A8%D8%B7-%D9%85%D8%AD%D8%A7%D9%88%D9%84%D8%A7%D8%AA-%D8%A7%D9%84%D8%B9%D8%AF%D9%88-%D9%84%D8%AA%D8%BA%D9%8A%D9%8A%D8%B1-%D9%87%D9%88%D9%8A%D8%AA%D9%87-%D8%A7%D9%84%D8%AF%D9%8A%D9%86%D9%8A)\n\n**Supreme Leader Khamenei: Iranian People Thwart Enemy's Efforts to Change National Identity**\nAyatollah Ali Khamenei, Supreme Leader of the Islamic Republic of Iran, stated that the Iranian people have thwarted the enemy's efforts to alter the nation's religious, historical, and cultural identity, despite the country facing numerous shortcomings. Speaking during a passionate ceremony commemorating the birth anniversary of Lady Fatima al-Zahra (peace be upon her), he praised the Iranian people's national resistance and emphasized that the spread of the concept and literature of resistance from Iran to other regional and international countries is a real and established phenomenon. He highlighted the importance of religious chanting (inshad) and Hussaini gatherings in reinforcing resistance and preserving revolutionary values, calling them essential components of 'resistance literature.' Khamenei defined national resistance as resilience against various pressures—military, economic, media, cultural, and political—from oppressive global powers. He noted that the West's media and political campaigns targeting Iran are signs of strategic pressure, with the ultimate goal of changing Iran's identity. He stressed that such efforts have persisted for over a century but were rendered ineffective by the Islamic Revolution and the Iranian people's steadfastness. He also urged religious chanters to transform religious gatherings into centers of revolutionary commitment, protect the youth from enemy influence, and focus on Islamic, Shia, and revolutionary knowledge while countering enemy propaganda. He emphasized that well-structured mourning chants can be more impactful than multiple sermons and warned against the infiltration of 'the music of the era of tyranny' into religious gatherings.\nOriginal language: ar\nPublish date: December 11, 2025 12:46 PM\nSource: [قناة العالم الاخبارية](https://www.alalam.ir/news/7360028/%D9%82%D8%A7%D8%A6%D8%AF-%D8%A7%D9%84%D8%AB%D9%88%D8%B1%D8%A9-%D8%A7%D9%84%D8%B4%D8%B9%D8%A8-%D8%A7%D9%84%D8%A5%D9%8A%D8%B1%D8%A7%D9%86%D9%8A-%D8%A3%D8%AD%D8%A8%D8%B7-%D9%85%D8%B3%D8%A7%D8%B9%D9%8A-%D8%A7%D9%84%D8%B9%D8%AF%D9%88-%D9%84%D8%AA%D8%BA%D9%8A%D9%8A%D8%B1-%D9%87%D9%88%D9%8A%D8%AA%D9%87-%D8%A7%D9%84%D8%AF%D9%8A%D9%86%D9%8A%D8%A9-)\n\n**Ali Chamenei: Biography of Iran's Supreme Leader**\nA new biography of Ali Khamenei, Iran's Supreme Leader, has been published in German, offering limited new insights into his personal life despite his rule since 1989. The book primarily provides historical details about the Islamic Republic of Iran, focusing on its development and context rather than revealing substantial new information about Khamenei himself. The biography was released on November 23, 2025, according to the Süddeutsche Zeitung.\nOriginal language: de\nPublish date: November 23, 2025 11:21 AM\nSource: [Süddeutsche Zeitung](https://www.sueddeutsche.de/politik/ali-chamenei-ali-sadrzadeh-biografie-iran-li.3328641)\n\n"
  }
]