[
  {
    "title": "List of the verified oldest people - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_the_verified_oldest_people",
    "snippet": "The oldest person ever whose age has been independently verified is Jeanne Calment (1875–1997) of France, who lived to the age of 122 years and 164 days."
  },
  {
    "title": "Longevity expert: 3 reasons the world's oldest person lived to 122",
    "url": "https://www.cnbc.com/2023/02/21/longevity-expert-3-reasons-the-worlds-oldest-person-lived-to-122.html",
    "snippet": "Jeanne Calment, a French woman, achieved an incredible feat of living to age 122, thus earning the honor of being the world's oldest person on record."
  },
  {
    "title": "Jeanne Calment remains the oldest verified person in recorded ...",
    "url": "https://www.facebook.com/ThingsYouDontKnowOfficial/posts/jeanne-calment-remains-the-oldest-verified-person-in-recorded-history-having-liv/1271543955013863/",
    "snippet": "Jeanne Calment holds the record as the oldest verified person in history, living to the age of 122 years and 164 days. Born in 1875 and passing ..."
  },
  {
    "title": "The World's Longest Lived - SuperAgers",
    "url": "https://gero.usc.edu/cga/superagers/the-worlds-longest-lived/",
    "snippet": "Jeanne Louise Calment, the world's longest living person (who died at the age of 122) was born in Arles, France on February 21, 1875 and died on August 4, 1997 ..."
  },
  {
    "title": "Jeanne Calment, the oldest person in history, pulls off the ... - YouTube",
    "url": "https://www.youtube.com/watch?v=7kzWe4trOmo",
    "snippet": "Jeanne Calment is the longest living human in history, who passed away at 122 years and 164 days old. Listen to this unforgettable story ..."
  },
  {
    "title": "Jeanne Calment and her 122 years of life and drastic changes to the ...",
    "url": "https://www.reddit.com/r/history/comments/sxsjo9/jeanne_calment_and_her_122_years_of_life_and/",
    "snippet": "The oldest person in history whose age was verified was none other than Jeanne Calment, a French woman who lived to 122 (and a half) years of ..."
  },
  {
    "title": "Oldest person ever | Guinness World Records",
    "url": "https://www.guinnessworldrecords.com/world-records/oldest-person",
    "snippet": "The greatest fully authenticated age to which any human has ever lived is 122 years 164 days by Jeanne Louise Calment (France). Born on 21 February 1875 to ..."
  },
  {
    "title": "The Longest-Lived People in World History: Record-Holders of ...",
    "url": "https://www.nmn.com/news/the-longest-lived-people-in-world-history-record-holders-of-human-longevity",
    "snippet": "A Japanese man named Jiroemon Kimura holds the title of being the oldest known man to have ever lived. As such, Kimura lived a phenomenal 117 ..."
  },
  {
    "title": "Age 100 and Counting - PRB.org",
    "url": "https://www.prb.org/resources/age-100-and-counting/",
    "snippet": "Maine resident Fred Harold Hall is the oldest living American man — at 112 years of age. Some 50,000 Americans were reported as centenarians in the 2000 U.S. ..."
  },
  {
    "title": "Study estimates longevity extremes by 2100 - Future Timeline",
    "url": "https://futuretimeline.net/blog/2021/07/9-human-longevity-2050-2100-future-timeline.htm",
    "snippet": "A new study by the University of Washington has used Bayesian population projections to forecast the world's longest-lived person by 2100."
  },
  {
    "title": "How Different Will Life Be In The Year 2100? - That Joe Scott",
    "url": "https://thatjoescott.com/2024/01/08/how-different-will-life-be-in-the-year-2100/",
    "snippet": "MEDICINE. In 2100 the average life span should be well into the 80s and we may be able to extend life to 130 years. According to some medical ..."
  },
  {
    "title": "Probabilistic forecasting of maximum human lifespan by 2100 using ...",
    "url": "https://www.demographic-research.org/articles/volume/44/52/",
    "snippet": "We estimate the probabilities that a person lives to at least age 126, 128, or 130 this century, as 89%, 44%, and 13%, respectively."
  },
  {
    "title": "Health forecasting - Institute for Health Metrics and Evaluation",
    "url": "https://www.healthdata.org/research-analysis/health-policy-planning/health-forecasting",
    "snippet": "2.37 billion people older than 65 years and 1.7 billion younger than 20 years are forecasted to be alive in 2100. 8.6 years will be added to the global life ..."
  },
  {
    "title": "Life expectancy projections - Our World in Data",
    "url": "https://ourworldindata.org/grapher/future-life-expectancy-projections",
    "snippet": "Projections for the period life expectancy at birth, in the future. This is based on the UN's mid-variant projections."
  },
  {
    "title": "The world of 2100 (ideas/ predictions : r/IsaacArthur - Reddit",
    "url": "https://www.reddit.com/r/IsaacArthur/comments/186ye46/the_world_of_2100_ideas_predictions/",
    "snippet": "I think that by the 2050s, wars won't be fought by human beings anymore, they will be fought by robots. Wars will also be less frequent."
  },
  {
    "title": "El Niño events projected to cut life expectancy gains and cost ...",
    "url": "https://phys.org/news/2026-01-el-nio-events-life-gains.html",
    "snippet": "Future projections under moderate emissions scenarios suggest a cumulative decline of 2.8 years in life expectancy by 2100."
  },
  {
    "title": "Longevity in 50 Years: Predicting Future Timelines - Tomorrow Bio",
    "url": "https://www.tomorrow.bio/post/longevity-in-50-years-predicting-future-timelines-2023-06-4667196686-futurism",
    "snippet": "In this article, we will explore the science of longevity, current global trends, and breakthroughs that could shape the future of human health, wellness, and ..."
  },
  {
    "title": "5 facts about how the world's population is expected to change by ...",
    "url": "https://www.pewresearch.org/short-reads/2025/07/09/5-facts-about-how-the-worlds-population-is-expected-to-change-by-2100/",
    "snippet": "The world's population is expected to get older.​​ The world's median age is projected to rise to 42 by 2100, up from 31 today and 22 in 1950. ..."
  },
  {
    "title": "Implausibility of radical life extension in humans in the twenty-first ...",
    "url": "https://www.nature.com/articles/s43587-024-00702-3",
    "snippet": "Survival to the age of 122.45 years—the maximum lifespan observed for humans as determined by the documented survival of Jeanne Calment, who ..."
  },
  {
    "title": "How long can a person live? The 21st century may see a record ...",
    "url": "https://www.washington.edu/news/2021/07/01/how-long-can-a-person-live-the-21st-century-may-see-a-record-breaker/",
    "snippet": "The world record of 122 years almost certainly will be broken, with a strong likelihood of at least one person living to anywhere between 125 and 132 years."
  },
  {
    "title": "No limit to maximal lifespan in humans: how to beat a 122-year-old ...",
    "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8636159/",
    "snippet": "Leading demographers claim that human lifespan is fixed at a natural limit around 122 years. However, there is no fixed limit in animals."
  },
  {
    "title": "Global life expectancy to increase by nearly 5 years by 2050 despite ...",
    "url": "https://www.healthdata.org/news-events/newsroom/news-releases/global-life-expectancy-increase-nearly-5-years-2050-despite",
    "snippet": "The latest findings from the Global Burden of Disease Study (GBD) forecast that global life expectancy will increase by 4.9 years in males ..."
  },
  {
    "title": "Maximum life span - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Maximum_life_span",
    "snippet": "Maximum life span is a measure of the maximum amount of time one or more members of a population have been observed to survive between birth and death."
  },
  {
    "title": "Humans Could Live up to 150 Years, New Research Suggests",
    "url": "https://www.scientificamerican.com/article/humans-could-live-up-to-150-years-new-research-suggests/",
    "snippet": "Humans could live up to 150 years, new research suggests. A study counts blood cells and footsteps to predict a hard limit to our longevity."
  },
  {
    "title": "The maximum human life span will likely increase this century, but ...",
    "url": "https://www.weforum.org/stories/2021/08/age-human-life-span-aging-populations-health-old/",
    "snippet": "Our estimates suggest that about 300,000 people will reach age 110 by 2080, give or take about 100,000. Although this range is well below a ..."
  },
  {
    "title": "Probabilistic forecasting of maximum human lifespan by 2100 using ...",
    "url": "https://www.demographic-research.org/articles/volume/44/52/",
    "snippet": "We estimate the probabilities that a person lives to at least age 126, 128, or 130 this century, as 89%, 44%, and 13%, respectively."
  },
  {
    "title": "Will Humans Live to 150? Not in Our Lifetime | by Brady Holmer",
    "url": "https://bradyholmer.medium.com/will-humans-live-to-150-not-in-our-lifetime-732a4b81caed",
    "snippet": "The highest survival rates were observed in Hong Kong, where 12.8% of females and 4.4% of males are expected to live to 100. The United States, ..."
  }
]