[
  {
    "title": "AskNews Research",
    "url": "",
    "snippet": "Here are the relevant news articles:\n\n**Russian Analogs of 'Ozempic' Show Threefold Sales Increase in 2025**\nSales of Russian domestic analogs of the drug 'Ozempic' increased nearly threefold in 2025 compared to 2024, according to the Center for the Development of Prospective Technologies (ЦРПТ), operator of the 'Chestny Znak' digital labeling system. In 2024, 1.7 million packages of domestic analogs were sold for 9.2 billion rubles; by 2025, sales rose to 6.1 million packages and revenue reached 35.2 billion rubles. Monthly sales grew from 282,000 packages in January 2025 to 810,000 by December, a nearly threefold increase. Sales in the first half of January 2026 were 17% higher than in the same period of 2025. The growth is attributed to increased domestic production: Russian pharmaceutical companies produced 11.7 million packages of drugs based on semaglutide and tirzepatide in 2025—ten times more than the total import volume of semaglutide-containing drugs from 2020 to 2023. The analogs, produced by Russian firms such as 'Geropharm', 'Promomed', and 'PSK Farma', are registered under 17 trade names as of early 2026. The Russian government authorized the production of these analogs without foreign patent holder consent until the end of 2026 to ensure domestic access to semaglutide. The average price of a domestic package rose from 5,454 rubles in 2024 to 5,763 rubles in 2025, compared to 7,800 rubles for the original imported Ozempic in 2023—reducing treatment costs by over 20%. The highest sales volumes per 10,000 people in 2025 were recorded in Saint Petersburg (807 packages), Moscow (755), Moscow Oblast (738), Krasnodar Krai (650), and Yamalo-Nenets Autonomous Okrug (580). In 2024, the most popular drugs by sales volume were nasal decongestants with xylometazoline, followed by ibuprofen-based painkillers and venous disease treatments with diosmin and hesperidin. Russians spent approximately 1.6 trillion rubles on medicines in 2024, with a 1.4% increase in units sold.\nOriginal language: ru\nPublish date: January 25, 2026 09:00 PM\nSource: [РБК](https://www.rbc.ru/society/26/01/2026/6975092b9a79475b127588bd)\n\n**2025 Preliminary Performance Review: Sustained High Growth and Strong Asset Quality**\nThe company released its 2025 preliminary performance report, showing continued high growth in profitability. In 2025, the company achieved revenue of 38.799 billion yuan, a 1.1% year-on-year increase, with a slight slowdown of 0.3 percentage points compared to the first three quarters. Net profit attributable to shareholders reached 19.03 billion yuan, up 12.1% year-on-year, down 2.5 percentage points from the first three quarters. Net interest income grew by 12.8%, accelerating by 2.9 percentage points compared to the first three quarters, driven by sustained asset growth and a stabilized net interest margin. However, non-interest income declined by 19.5% year-on-year, with other non-interest income falling 31%, a worsening of 6 percentage points from the first three quarters, primarily due to significant fair value losses in trading accounts amid heightened bond market volatility and reduced motivation to redeem existing bonds given strong net interest income growth. Fee and commission income rose 13.1%, up 0.5 percentage points from the first three quarters. Loan balances grew 14.3% year-on-year, with manufacturing, technology, green, and inclusive small business loans increasing 22.25%, 23.44%, 22.75%, and 17.06%, respectively, all exceeding the overall loan growth rate. Asset quality remains strong, with a non-performing loan ratio of 0.76%, overdue ratio of 0.62%, and 90-day overdue ratio of 0.53%, all stable compared to the end of September. The loan loss provision coverage ratio stood at 502%, down 11 percentage points from the end of September but still among the highest in the industry. The investment recommendation adjusts 2026-2027 net profit forecasts to 21.3 billion and 24.1 billion yuan (down from 23.3 billion and 27.3 billion yuan), with year-on-year growth of 12.0% and 13.2%, respectively. The current stock price corresponds to a 2026-2027 price-to-book ratio of 0.79x and 0.70x, maintaining an 'outperform market' rating. Risk factors include weaker-than-expected macroeconomic recovery, which could negatively impact net interest margin and asset quality.\nOriginal language: zh\nPublish date: January 25, 2026 07:56 AM\nSource: [东方财富网](https://data.eastmoney.com/report/zw_stock.jshtml?encodeUrl=8jQuetzjc5zgM1VH0ySlUkUrla1%2F%2FLDYyhV08SkKRCU%253D)\n\n**Cambridge Technology's 2025 Performance Forecast: Strong Growth Amid FX Headwinds and Strategic Expansion**\nCambridge Technology released its 2025 annual performance forecast, projecting a net profit attributable to shareholders of between 252 million and 278 million yuan, a year-on-year increase of 51.19% to 66.79%, and a non-recurring net profit of 249 million to 275 million yuan, up 64.62% to 81.81%. The company's high-speed optical module business benefited from strong demand driven by AI and global data center expansion. The launch of the Jiashan new production base, capacity ramp-up at the Malaysia facility, and ongoing capacity planning have led to significant growth in order volume and shipment volume. Higher-margin, high-speed modules now represent a larger share of sales, improving overall gross margin. However, Q4 was negatively impacted by an estimated foreign exchange loss of 81.61 million yuan due to the Hong Kong dollar's depreciation against the US dollar, as most proceeds from Hong Kong IPO financing were held in HKD. Despite this, the full-year performance remains in line with the forecasted increase. The company has secured silicon photonics chip supply through partnerships with three suppliers via supply agreements or equity stakes, and has secured year-long supply contracts and sufficient inventory for critical components such as lasers and DSPs. Through JDM (Joint Design Manufacturing) partnerships with key North American clients and ongoing product validation with new customers, the company is preparing for large-scale shipments of 1.6T optical modules starting in Q1 2026, with 800G modules remaining the primary product in 2026. Analysts forecast revenue of 5.19 billion, 7.901 billion, and 11.437 billion yuan for 2025–2027, with EPS of 0.77, 2.67, and 4.37 yuan, and corresponding PE ratios of 147, 42, and 26. Despite Q4’s FX loss, the company’s long-term growth trajectory remains strong, leading to an upgraded forecast and a 'Buy' rating. Risks include macroeconomic volatility, R&D delays, intensified industry competition, weaker downstream demand, and slower-than-expected capacity expansion.\nOriginal language: zh\nPublish date: January 25, 2026 07:08 AM\nSource: [东方财富网](https://data.eastmoney.com/report/zw_stock.jshtml?encodeUrl=8jQuetzjc5zgM1VH0ySlUjpbA87DwriqCMm6Yu%2BVgI0%253D)\n\n**Global 3D Printing Leader, Downstream Demand Approaching Breakout Phase**\nThe company is a global leader in 3D printing with a comprehensive vertical integration strategy, offering both metal and polymer 3D printing equipment, materials, proprietary software, and after-sales services. With a research and development intensity of 22.23% in the first three quarters of 2025, the company maintains technological leadership. In December 2025, it established a controlled joint venture with affiliated parties to strategically enter the 3C and civilian 3D printing service market, shifting its business model from equipment and material sales to a dual-driven approach of equipment/materials and service provision. Downstream demand is approaching a breakout point, with aerospace and 3C sectors serving as primary growth engines. In aerospace, the company's revenue from this sector reached nearly 50% in 2024, supported by its FS1521M ultra-large-scale equipment, which features XYZ axes exceeding 1.5 meters and up to 32 fiber lasers. Key client Feierkang has purchased approximately 40 units of the company’s metal 3D printing systems. In the 3C and civilian sectors, companies like Apple and Honor are rapidly adopting 3D-printed titanium alloy technology for precision components such as foldable phone hinges and smart wearable frames. The company’s robust product portfolio and technical capabilities position it to drive large-scale 3D printing adoption in consumer electronics. Additional applications in liquid cooling, embodied intelligence, and low-altitude economy further expand its long-term growth potential. Financially, the company is projected to achieve revenue of 691 million, 1.202 billion, and 1.623 billion RMB in 2025, 2026, and 2027, with year-on-year growth of 40.6%, 73.8%, and 35.0%, respectively. Net profit attributable to shareholders is forecasted at 72 million, 163 million, and 242 million RMB, growing by 7.3%, 125.5%, and 48.9% year-on-year. Using a price-to-sales (PS) valuation method, a 40x PS multiple for 2026 yields a target price of 116.06 RMB, with a 'Buy' rating. Key risks include slower-than-expected downstream adoption, raw material price volatility, technological obsolescence, geopolitical and exchange rate fluctuations, and risks from restricted share unlock.\nOriginal language: zh\nPublish date: January 25, 2026 06:37 AM\nSource: [东方财富网](https://data.eastmoney.com/report/zw_stock.jshtml?encodeUrl=8jQuetzjc5zgM1VH0ySlUgtE5PTAb%2Fnusgu6NzKkVDQ%253D)\n\n**Obesity Fuels a $150 Billion Pharmaceutical Market, with Mexico as a Key Target**\nThe global pharmaceutical market for obesity treatments is projected to reach $150 billion by 2035, up from $105 billion forecasted in 2024, according to Morgan Stanley. This growth is driven by rising obesity rates—37% higher than a decade ago, with 1 in 8 people globally affected, per the World Health Organization. In Mexico, 7 out of 10 adults suffer from overweight or obesity, contributing to health costs of 82 to 98 billion pesos (around $5.1 billion USD) annually. The OECD estimates the pharmaceutical market for obesity treatments in Mexico could reach $200 million, yet only 4% of obese individuals currently receive pharmacological treatment. Investors and funds are shifting capital toward companies developing weight-control drugs, anticipating multi-billion-dollar returns. Key players include Eli Lilly, Roche, Amgen, Pfizer, Novo Nordisk, and Zealand Pharma. Pfizer acquired Metsera for approximately $7 billion, boosting its stock by over 5% in 2025. Eli Lilly, a U.S. leader in obesity drugs, reported 1.1 million active prescriptions for Mounjaro and Zepbound in the U.S., and in Mexico, it aims to treat over 250,000 patients with tirzepatide by 2025, with plans to triple that number by 2026. Eli Lilly’s stock rose over 45% in the past 12 months. In contrast, Novo Nordisk saw its market value drop 24.62% over the same period due to revised sales and profit forecasts, citing a slowdown in obesity treatment growth, especially in the U.S. Despite this, Novo Nordisk continues investing 80% of its $1 billion annual research budget in obesity, with semaglutide 2.4 mg showing up to 20% weight loss in one-third of patients. The company emphasizes that obesity is a chronic, non-communicable disease and faces challenges including widespread use of unregulated 'miracle' weight-loss products sold online for as little as $10–$60, which pose serious health risks such as brain damage, dependence, or death. Legally prescribed drugs in Mexico cost over 7,000 pesos per pen and require weekly administration, often for years, and are only available with a doctor’s prescription. The article highlights the tension between public health needs, pharmaceutical innovation, and the risks posed by unregulated alternatives.\nOriginal language: es\nPublish date: January 24, 2026 06:10 AM\nSource: [Milenio.com](https://www.milenio.com/negocios/obesidad-impulsa-mercado-farmaceutico-150-mil-millones)\n\n**German Fund Managers Boost Infrastructure Stocks Ahead of Economic Recovery**\nGerman equity fund managers are increasing their exposure to companies benefiting from Germany's anticipated economic recovery in 2026, the first year of noticeable growth since the Covid-19 pandemic. In the fourth quarter, funds surveyed by 'The Market NZZ' added or increased positions in infrastructure-related firms. Jens Ehrhardt of DJE Kapital boosted holdings in Hochtief, citing a sustained growth trend and favorable valuation, and added Nordex, noting strong new orders. He also entered Siemens Energy, citing high demand for gas turbines from data centers and power grids. Ehrhardt added Sartorius and Drägerwerk, the latter reporting a 5.3% revenue increase to 3.5 billion euros in 2025 (2 billion from medical tech, 1.5 billion from safety tech) and Ebit rising over 16% to 226 million euros. Christoph Gebert of Acatis Fair Value Deutschland ELM made Drägerwerk his largest holding after increasing stakes in Q2 2025; its share price rose from under 70 to over 85 euros. Gebert believes the stock is undervalued, trading at a discount of over 10% to its 2027 book value, with expected Ebit margin growth and 1–5% revenue growth in 2026, forecasting significant earnings growth. Gebert also added 2G Energy, a block heater and small gas power generator manufacturer, noting 10% real-term annual growth and a projected revenue increase from 400 million to 600 million euros by 2028. He also increased positions in Jungheinrich and SAF-Holland, both benefiting from economic recovery. Christian Krahe raised his stake in Jost-Werke, a truck coupling supplier, after the Möhrle family fully divested their 20% stake, removing a market overhang. Jost reported strong results, with 2025 revenue estimated at 1.5 billion euros (42% growth), though net profit is expected to fall due to integration costs from Hyva acquisition. Analysts project 20% annual revenue growth and 18% net profit growth by 2027, with a modest P/E of 12. Christian Reindl increased exposure to KSB, whose share price tripled from 300 to 1,000 euros in five years, and added Stabilus, a supplier of electric trunk and door systems, expecting a near-doubling of net profit to 47 million euros in 2026 despite a slight revenue dip. Reindl also expanded his position in another company poised to benefit from the German recovery, though the full details are only available in the complete article from 'The Market NZZ'.\nOriginal language: de\nPublish date: January 24, 2026 04:30 AM\nSource: [Neue Zürcher Zeitung](https://www.nzz.ch/finanzen/auf-diese-deutschen-aktien-setzen-die-fondsmanager-ld.1921715)\n\n**Russian Analogs of 'Ozempic' Show Threefold Sales Increase in 2025**\nSales of Russian domestic analogs of the drug 'Ozempic' increased nearly threefold in 2025 compared to 2024, according to the Center for the Development of Prospective Technologies (ЦРПТ), operator of the 'Chestny Znak' digital labeling system. In 2024, 1.7 million packages of domestic analogs were sold for 9.2 billion rubles; by 2025, sales rose to 6.1 million packages and revenue reached 35.2 billion rubles. Monthly sales grew from 282,000 packages in January 2025 to 810,000 by December, a nearly threefold increase. Sales in the first half of January 2026 were 17% higher than in the same period of 2025. The growth is attributed to increased domestic production: Russian pharmaceutical companies produced 11.7 million packages of drugs based on semaglutide and tirzepatide in 2025—ten times more than the total import volume of semaglutide-containing drugs from 2020 to 2023. The analogs, produced by Russian firms such as 'Geropharm', 'Promomed', and 'PSK Farma', are registered under 17 trade names as of early 2026. The Russian government authorized the production of these analogs without foreign patent holder consent until the end of 2026 to ensure domestic access to semaglutide. The average price of a domestic package rose from 5,454 rubles in 2024 to 5,763 rubles in 2025, compared to 7,800 rubles for the original imported Ozempic in 2023—reducing treatment costs by over 20%. The highest sales volumes per 10,000 people in 2025 were recorded in Saint Petersburg (807 packages), Moscow (755), Moscow Oblast (738), Krasnodar Krai (650), and Yamalo-Nenets Autonomous Okrug (580). In 2024, the most popular drugs by sales volume were nasal decongestants with xylometazoline, followed by ibuprofen-based painkillers and venous disease treatments with diosmin and hesperidin. Russians spent approximately 1.6 trillion rubles on medicines in 2024, with a 1.4% increase in units sold.\nOriginal language: ru\nPublish date: January 25, 2026 09:00 PM\nSource: [РБК](https://www.rbc.ru/society/26/01/2026/6975092b9a79475b127588bd)\n\n**Cambridge Technology's 2025 Performance Forecast: Strong Growth Amid FX Headwinds and Strategic Expansion**\nCambridge Technology released its 2025 annual performance forecast, projecting a net profit attributable to shareholders of between 252 million and 278 million yuan, a year-on-year increase of 51.19% to 66.79%, and a non-recurring net profit of 249 million to 275 million yuan, up 64.62% to 81.81%. The company's high-speed optical module business benefited from strong demand driven by AI and global data center expansion. The launch of the Jiashan new production base, capacity ramp-up at the Malaysia facility, and ongoing capacity planning have led to significant growth in order volume and shipment volume. Higher-margin, high-speed modules now represent a larger share of sales, improving overall gross margin. However, Q4 was negatively impacted by an estimated foreign exchange loss of 81.61 million yuan due to the Hong Kong dollar's depreciation against the US dollar, as most proceeds from Hong Kong IPO financing were held in HKD. Despite this, the full-year performance remains in line with the forecasted increase. The company has secured silicon photonics chip supply through partnerships with three suppliers via supply agreements or equity stakes, and has secured year-long supply contracts and sufficient inventory for critical components such as lasers and DSPs. Through JDM (Joint Design Manufacturing) partnerships with key North American clients and ongoing product validation with new customers, the company is preparing for large-scale shipments of 1.6T optical modules starting in Q1 2026, with 800G modules remaining the primary product in 2026. Analysts forecast revenue of 5.19 billion, 7.901 billion, and 11.437 billion yuan for 2025–2027, with EPS of 0.77, 2.67, and 4.37 yuan, and corresponding PE ratios of 147, 42, and 26. Despite Q4’s FX loss, the company’s long-term growth trajectory remains strong, leading to an upgraded forecast and a 'Buy' rating. Risks include macroeconomic volatility, R&D delays, intensified industry competition, weaker downstream demand, and slower-than-expected capacity expansion.\nOriginal language: zh\nPublish date: January 25, 2026 07:08 AM\nSource: [东方财富网](https://data.eastmoney.com/report/zw_stock.jshtml?encodeUrl=8jQuetzjc5zgM1VH0ySlUjpbA87DwriqCMm6Yu%2BVgI0%253D)\n\n**Obesity Fuels a $150 Billion Pharmaceutical Market, with Mexico as a Key Target**\nThe global pharmaceutical market for obesity treatments is projected to reach $150 billion by 2035, up from $105 billion forecasted in 2024, according to Morgan Stanley. This growth is driven by rising obesity rates—37% higher than a decade ago, with 1 in 8 people globally affected, per the World Health Organization. In Mexico, 7 out of 10 adults suffer from overweight or obesity, contributing to health costs of 82 to 98 billion pesos (around $5.1 billion USD) annually. The OECD estimates the pharmaceutical market for obesity treatments in Mexico could reach $200 million, yet only 4% of obese individuals currently receive pharmacological treatment. Investors and funds are shifting capital toward companies developing weight-control drugs, anticipating multi-billion-dollar returns. Key players include Eli Lilly, Roche, Amgen, Pfizer, Novo Nordisk, and Zealand Pharma. Pfizer acquired Metsera for approximately $7 billion, boosting its stock by over 5% in 2025. Eli Lilly, a U.S. leader in obesity drugs, reported 1.1 million active prescriptions for Mounjaro and Zepbound in the U.S., and in Mexico, it aims to treat over 250,000 patients with tirzepatide by 2025, with plans to triple that number by 2026. Eli Lilly’s stock rose over 45% in the past 12 months. In contrast, Novo Nordisk saw its market value drop 24.62% over the same period due to revised sales and profit forecasts, citing a slowdown in obesity treatment growth, especially in the U.S. Despite this, Novo Nordisk continues investing 80% of its $1 billion annual research budget in obesity, with semaglutide 2.4 mg showing up to 20% weight loss in one-third of patients. The company emphasizes that obesity is a chronic, non-communicable disease and faces challenges including widespread use of unregulated 'miracle' weight-loss products sold online for as little as $10–$60, which pose serious health risks such as brain damage, dependence, or death. Legally prescribed drugs in Mexico cost over 7,000 pesos per pen and require weekly administration, often for years, and are only available with a doctor’s prescription. The article highlights the tension between public health needs, pharmaceutical innovation, and the risks posed by unregulated alternatives.\nOriginal language: es\nPublish date: January 24, 2026 06:10 AM\nSource: [Milenio.com](https://www.milenio.com/negocios/obesidad-impulsa-mercado-farmaceutico-150-mil-millones)\n\n**German Fund Managers Boost Infrastructure Stocks Ahead of Economic Recovery**\nGerman equity fund managers are increasing their exposure to companies benefiting from Germany's anticipated economic recovery in 2026, the first year of noticeable growth since the Covid-19 pandemic. In the fourth quarter, funds surveyed by 'The Market NZZ' added or increased positions in infrastructure-related firms. Jens Ehrhardt of DJE Kapital boosted holdings in Hochtief, citing a sustained growth trend and favorable valuation, and added Nordex, noting strong new orders. He also entered Siemens Energy, citing high demand for gas turbines from data centers and power grids. Ehrhardt added Sartorius and Drägerwerk, the latter reporting a 5.3% revenue increase to 3.5 billion euros in 2025 (2 billion from medical tech, 1.5 billion from safety tech) and Ebit rising over 16% to 226 million euros. Christoph Gebert of Acatis Fair Value Deutschland ELM made Drägerwerk his largest holding after increasing stakes in Q2 2025; its share price rose from under 70 to over 85 euros. Gebert believes the stock is undervalued, trading at a discount of over 10% to its 2027 book value, with expected Ebit margin growth and 1–5% revenue growth in 2026, forecasting significant earnings growth. Gebert also added 2G Energy, a block heater and small gas power generator manufacturer, noting 10% real-term annual growth and a projected revenue increase from 400 million to 600 million euros by 2028. He also increased positions in Jungheinrich and SAF-Holland, both benefiting from economic recovery. Christian Krahe raised his stake in Jost-Werke, a truck coupling supplier, after the Möhrle family fully divested their 20% stake, removing a market overhang. Jost reported strong results, with 2025 revenue estimated at 1.5 billion euros (42% growth), though net profit is expected to fall due to integration costs from Hyva acquisition. Analysts project 20% annual revenue growth and 18% net profit growth by 2027, with a modest P/E of 12. Christian Reindl increased exposure to KSB, whose share price tripled from 300 to 1,000 euros in five years, and added Stabilus, a supplier of electric trunk and door systems, expecting a near-doubling of net profit to 47 million euros in 2026 despite a slight revenue dip. Reindl also expanded his position in another company poised to benefit from the German recovery, though the full details are only available in the complete article from 'The Market NZZ'.\nOriginal language: de\nPublish date: January 24, 2026 04:30 AM\nSource: [Neue Zürcher Zeitung](https://www.nzz.ch/finanzen/auf-diese-deutschen-aktien-setzen-die-fondsmanager-ld.1921715)\n\n**Kangpei Resubmits CBL-514 IND Application with Revised Indication to FDA for Subcutaneous Fat Reduction**\nKangpei (6919) announced on January 23, 2026, that it is resubmitting its Investigational New Drug (IND) application for its new drug CBL-514 injection, combined with tirzepatide (Eli Lilly), to the U.S. FDA. The intended indication has been revised from 'weight management' to 'reduction of subcutaneous fat' following FDA feedback. The original Phase 2 clinical trial, CBL-0201WR, was completed and submitted to the FDA on December 24, 2025. The FDA advised that CBL-514 alone does not meet the criteria for weight management, prompting the company to modify the indication. The revised trial design remains unchanged: a randomized, placebo-controlled Phase 2 study to evaluate the efficacy, safety, and tolerability of CBL-514 plus tirzepatide in obese or overweight subjects. The primary efficacy endpoint will be changes in abdominal subcutaneous fat volume and body weight measured by MRI. The trial plans to enroll 100–120 participants. The company has completed Phase 1 and is preparing to reapply for Phase 2 approval. Phase 3 and NDA are still pending. The company cited the global market shift toward reducing fat mass and preventing metabolic deterioration post-treatment as key drivers, noting that GLP-1 drugs like tirzepatide reduce fat cell size temporarily but not number, leading to rebound weight gain and metabolic decline after discontinuation. With tirzepatide's cumulative sales reaching approximately $24.8 billion in the first three quarters of 2025 and Morgan Stanley projecting the global weight-loss drug market to reach $150 billion by 2035 at a 25% CAGR, there is significant market potential for therapies targeting persistent fat reduction. The company emphasized that the clinical development timeline is subject to change and that no financial projections are disclosed. Investors are advised to proceed with caution due to the high risk and uncertainty inherent in drug development.\nOriginal language: zh\nPublish date: January 23, 2026 05:00 PM\nSource: [MoneyDJ理財網](https://www.moneydj.com/kmdj/news/newsviewer.aspx?a=133c8707-1d70-4322-9e46-54378747893a)\n\n**Eli Lilly Soared by 39% in 2025, but Here's Another Healthcare Stock to Buy in 2026**\nEli Lilly (NYSE: LLY) delivered a 39% share gain in 2025, driven by strong performance in the high-growth obesity drug market, particularly through its tirzepatide-based products Mounjaro (for type 2 diabetes) and Zepbound (for weight loss). The global obesity drug market is projected to reach nearly $100 billion by the end of the decade. While Eli Lilly leads the market, the article highlights Viking Therapeutics (NASDAQ: VKTX) as a promising healthcare stock to consider for investment in 2026. Viking is developing VK2735, a dual GIP/GLP-1 receptor agonist in late-stage clinical trials—injectable in phase 3 and oral in phase 2—designed to regulate blood sugar and appetite similarly to Lilly’s tirzepatide. Phase 2 trial results showed up to 14.7% body weight reduction after 13 weeks without a plateau. Although Viking has no commercialized products and faces risks in drug development and regulatory approval, the company could attract strategic partnerships or acquisition interest. The Motley Fool recommends both Novo Nordisk and Viking Therapeutics, noting that while Viking carries high risk due to its early stage, it offers substantial upside potential if successful.\nOriginal language: en\nPublish date: January 23, 2026 10:35 AM\nSource: [The Motley Fool](https://www.fool.com/investing/2026/01/23/lilly-soared-in-2025-but-heres-another-buy/?source=newstex&utm_source=newstex&utm_medium=feed&utm_campaign=article&referring_guid=95e2979e-34c4-4c98-9eec-36962ec4947c)\n\n**Intel Faces Major Sell-Off After Weak Guidance Despite Strong Q4 Earnings**\nIntel faced a major setback in the U.S. stock market after releasing its quarterly earnings report on January 23, 2026, with its stock plunging over 11% in after-hours trading due to disappointing guidance. While Intel reported Q4 2025 revenue of $13.67 billion (slightly above the $13.43 billion market estimate) and adjusted EPS of $0.15 (above the $0.09 forecast), the company projected Q1 2026 adjusted EPS of $0.00—well below the $0.08 consensus—and revenue between $11.7 billion and $12.7 billion, below the $12.56 billion expectation. The adjusted gross margin was forecast at 34.5%, below the 36.5% analyst estimate. Intel CEO Patrick Pichette stated that 'demand is strong, but we are struggling with manufacturing yield,' adding that 'our execution needs to improve.' CFO David Zinsner confirmed that Q1 2026 supply would reach its 'lowest point,' citing insufficient inventory to meet seasonal demand. The company had exhausted most of its inventory in Q4 2025. Analysts warn that ongoing yield issues may lead to lost market share to AMD and long-term structural risks. Despite Intel’s prior stock surge—up 47% year-to-date and nearly 150% over 12 months—driven by optimism over data center growth, CEO reforms, and investments from the U.S. government, NVIDIA, and SoftBank, the weak outlook triggered a sharp correction. Meanwhile, the broader U.S. market rose: the S&P 500 gained 0.55%, the Nasdaq rose 0.91%, and major tech stocks like Meta (+5%), Tesla (+4%), and NVIDIA rose. Positive macro data—including a revised Q3 2025 GDP growth of 4.4% (vs. 4.3% forecast), lower-than-expected jobless claims, and stronger-than-expected unemployment data—boosted market sentiment. Additionally, President Trump’s remarks at the Davos Forum, where he ruled out tariffs on European nations over Greenland and signaled a framework for future agreements, eased geopolitical tensions. Furthermore, NVIDIA CEO Jensen Huang’s call for 'trillions of dollars' in global AI infrastructure investment amplified demand for semiconductor stocks. Chinese stocks also rallied: the Nasdaq China Golden Dragon Index rose 1.58%, with Alibaba, Pony.ai, and Bilibili gaining over 5%, and JD.com, Li Auto, and NIO rising over 3%.\nOriginal language: zh\nPublish date: January 23, 2026 12:04 AM\nSource: [证券时报网_证券时报旗下资讯平台_股票_基金_期货_债券_理财_财经_行情_数据_股吧_博客_论坛](https://stcn.com/article/detail/3607681.html)\n\n**2025 'Annual Report Season' Kicks Off with Strong Performance in Hard-Tech Sectors**\nThe 2025 'annual report season' for A-shares officially began with the release of the first annual report by Shenzhen-listed company Wohua Pharmaceutical. In 2025, Wohua Pharmaceutical reported revenue of 817 million yuan, a 6.96% increase year-on-year, and net profit attributable to shareholders of 95.7153 million yuan, up 162.93% year-on-year, with operating cash flow increasing 40.45%. The company also announced a cash dividend plan of 1.46 yuan per 10 shares (tax included) for the 2025 interim report, with plans for further stable dividends. As of January 22, 2026, Wind statistics show 569 companies have released annual performance forecasts, with 243 reporting positive results—42.71% of the total. Among them, 209 companies expect net profit exceeding 100 million yuan, and 130 expect a year-on-year increase of over 100%. For example, Huisheng Biological expects a median net profit increase of 1,355.24%, while Hocomm (a subsidiary of Midea) forecasts a 385.62% to 628.43% increase. According to Tian Lihui, director of the Institute of Financial Development at Nankai University, the strong performance reflects China's structural shift toward 'new growth drivers' and 'high-quality development,' with innovation and global competitiveness replacing traditional factor-driven growth. Key sectors like AI, computing power, semiconductors, and communication equipment are leading growth, with sub-sectors such as digital chip design and integrated circuit packaging and testing showing strong pre-announcement trends. Moer Technology, a newly listed company, expects revenue of 1.45 billion to 1.52 billion yuan (230.70% to 246.67% increase) and a narrowed loss of 950 million to 1.06 billion yuan (from 1.618 billion yuan loss in 2024), citing strong demand for high-performance GPUs in AI and improved market recognition. Bawei Storage, a leading storage module company, forecasts revenue of 10 to 12 billion yuan (49.36% to 79.23% increase) and net profit of 850 million to 1 billion yuan (427.19% to 520.22% increase), attributing growth to stabilized and rising storage prices from Q2 2025, project deliveries, and a new wafer-level advanced packaging project in Dongguan’s Songshan Lake, expected to contribute revenue by end-2026. Tian Lihui notes that the surge in hard-tech sectors results from the 'resonance' between global AI computing investment and China’s industrial upgrading strategy, marking a transition from quantitative to qualitative progress in supply chain self-reliance. Beyond hard tech, gold-related firms like Chifeng Gold and Zijin Mining also reported strong growth: Chifeng Gold expects net profit of 3 to 3.2 billion yuan (70% to 81% increase), while Zijin Mining forecasts 51 to 52 billion yuan (59% to 62% increase). Chaohong Ji also expects a 125% to 175% profit increase. As of February 15, 2026, 10 more companies, including Zhinanbiao and Xindao Technology, are scheduled to release annual reports before the Lunar New Year. Tian Lihui advises investors to shift focus from mere growth numbers to assessing growth quality, emphasizing sustainability, innovation value, and global business capability, particularly distinguishing between short-term cyclical gains and long-term trends driven by technological moats and market share. Key metrics for innovation include R&D intensity and the efficiency of converting R&D into core patents and products.\nOriginal language: zh\nPublish date: January 22, 2026 11:53 PM\nSource: [经济参考报](http://jjckb.xinhuanet.com/20260123/8fa67f46e9304deb82def6be94abc349/c.html)\n\n**Eli Lilly (LLY) Q3 2024 Earnings Call Transcript**\nEli Lilly (LLY) reported strong Q3 2024 financial results, with revenue growing 42% excluding the olanzapine portfolio, driven by Mounjaro and Zepbound sales. Global Mounjaro sales reached $3.1 billion, including $2.4 billion in the U.S. and $728 million internationally. Zepbound U.S. sales surpassed $1.2 billion, with 87% commercial formulary access as of October 1, 2024. Prescription volume for both drugs grew 25% sequentially. New product revenue increased by over $3 billion. Gross margin rose to 82.2%, supported by favorable product mix and higher realized prices. Operating income reached nearly $1.8 billion, while EPS was $1.18, up from $0.10 in Q3 2023, despite a $3.08 per share negative impact from acquired IPR&D charges. R&D expenses increased 13%, primarily due to investments in early- and late-stage development, with $2.8 billion in IPR&D charges from the Morphic Therapeutics acquisition. The company updated its 2024 revenue guidance to $45.4 billion to $46 billion, with the midpoint implying nearly 50% Q4 growth. Expected EPS is $12.05 to $12.55 (reported) and $13.02 to $13.52 (non-GAAP), reflecting $3.1 billion in IPR&D charges. Mounjaro and Zepbound supply is on track to exceed a 50% increase in sellable doses in H2 2024 vs. H2 2023. Key pipeline milestones include: 94% reduction in Type-2 diabetes risk and 23% sustained weight loss in pre-diabetic adults on tirzepatide (SURMOUNT-1); modified dosing for donanemab reduced ARIA-E incidence to 14% (TRAILBLAZER-ALZ 6); insulin efsitora alfa met all five Phase 3 primary endpoints with 40% lower severe hypoglycemia vs. insulin glargine (QWINT-1); and positive EMBER-3 data for imlunestrant in breast cancer, with an NDA submission planned by year-end. The company announced a $2 billion investment in Ireland and a separate $4.5 billion for the Lilly Medicine Foundry in Indiana, bringing total manufacturing expansion commitments since 2020 to over $20 billion. Capital returns totaled $1.6 billion via dividends and share repurchases. Regulatory approvals were received for Ebglyss (atopic dermatitis) in the U.S., Kisunla (early Alzheimer’s) in Japan and the U.K., and Omvoh gained first-line access at two of three major U.S. PBMs. Trulicity revenue declined 22% globally due to lower volume, partially offset by higher prices. U.S. channel inventory for Mounjaro and Zepbound decreased, reducing Q3 sales by a mid-single-digit percentage. Daniel Skovronsky stated, 'the modified titration reduced the incidence of ARIA-E to 14% compared with 24% for those receiving the standard dosing regimen,' supporting an upcoming supplemental FDA submission.\nOriginal language: en\nPublish date: January 22, 2026 05:20 PM\nSource: [The Motley Fool](https://www.fool.com/earnings/call-transcripts/2026/01/22/eli-lilly-lly-q3-2024-earnings-call-transcript/?source=newstex&utm_source=newstex&utm_medium=feed&utm_campaign=article&referring_guid=5b0adb3d-999b-46ff-8c3e-0bbc2c67f014)\n\n**Thyroid Function Tests Market Accelerates with Rising Demand in Endocrine Diagnostics Forecast 2025-2031**\nThe global thyroid function tests market was valued at US$ 1,603 million in 2024 and is projected to reach US$ 2,130 million by 2031, growing at a compound annual growth rate (CAGR) of 4.2% from 2025 to 2031. According to a report by QY Research, key drivers of market expansion include rising demand in endocrine diagnostics, technological advancements, and increasing regulatory emphasis on sustainability and compliance. The market is segmented by type—TSH Tests, FT4 Tests, and FT3 Tests—and by application—Hospitals, Diagnostic Laboratories, and Clinics. Regional analysis covers North America, Europe, Asia Pacific, Central and South America, and the Middle East & Africa, with detailed sales and revenue forecasts from 2025 to 2031. Key players include Beckman Coulter, Siemens, bioMérieux, DiaSorin, and IBL-America. The report highlights sustainability-driven innovation, strategic activities such as mergers and acquisitions, and R&D initiatives as critical for market competitiveness. It offers customizable insights, including country-level analysis and competitive assessments, to support strategic decision-making for manufacturers, investors, and new entrants.\nOriginal language: en\nPublish date: January 21, 2026 02:03 PM\nSource: [openPR.com - Open Public Relations Free of Charge](https://www.openpr.com/news/4358230/thyroid-function-tests-market-accelerates-with-rising-demand)\n\n**GLP-1 Obesity Drugs Surpass Keytruda in Global Sales, Marking a Paradigm Shift**\nIn 2024, global sales of GLP-1 obesity drugs, including Eli Lilly's 'Mounjaro' and 'Zepbound' (tirzepatide) and Novo Nordisk's 'Wegovy' and 'Ozempic' (semaglutide), reached approximately $358 billion and $356 billion respectively, surpassing the $315 billion in sales of the long-standing top-selling immunotherapy cancer drug Keytruda (pembrolizumab) by Merck (MSD). Although Keytruda remains the top-selling single product, the combined sales of GLP-1 obesity drugs now exceed Keytruda's revenue by about 13–14%, according to a report by Yujeung Investment Securities citing Bloomberg consensus. The report interprets this shift as a structural signal that the paradigm in treatment for obesity and metabolic diseases is reshaping the blockbuster drug landscape, previously dominated by cancer therapeutics. Sales of GLP-1 drugs are projected to reach around $850 billion in 2024, with Mounjaro expected to generate $450 billion and Wegovy $400 billion. Keytruda’s sales forecast for 2024 is below $350 billion. The report attributes the sustained dominance of obesity drugs to the introduction of oral formulations, such as Novo’s recently FDA-approved Wegovy tablets and Eli Lilly’s pending application for its oral version of tirzepatide, dubbed 'Oral Mounjaro'.\nOriginal language: ja\nPublish date: January 08, 2026 09:19 AM\nSource: [Chosunbiz](https://biz.chosun.com/jp/jp-science/2026/01/08/32S5Q6DLDVFB5ACWGKS7AMHTFI/)\n\n**Prediction: This Surprising Growth Stock Will Reach -- and Stay in -- the Trillion-Dollar Club in 2026.**\nThe article predicts that Eli Lilly (NYSE: LLY), a healthcare company, will become the first non-technology firm to join the 'trillion-dollar club'—defined as companies with a market capitalization of $1 trillion—by 2026. While the club currently includes tech giants like Nvidia, Apple, and Microsoft, and Warren Buffett’s Berkshire Hathaway, the article highlights Eli Lilly’s recent rise: it briefly touched $1 trillion in market cap in November 2025, becoming the first healthcare company to do so, before falling to approximately $904 billion. The prediction is based on Lilly’s strong growth in the weight loss drug market, driven by its drugs tirzepatide—marketed as Mounjaro for type 2 diabetes and Zepbound for weight loss—which have generated blockbuster revenue. Goldman Sachs Research estimates the global weight loss drug market will grow from $28 billion to $95 billion by 2030 and exceed $100 billion, supporting the forecast. The article emphasizes that while market cap alone does not determine investment value, Lilly’s combination of stable revenue, dividends, and explosive growth in its weight-loss portfolio makes it a likely long-term contender for sustained trillion-dollar status.\nOriginal language: en\nPublish date: December 10, 2025 10:30 PM\nSource: [Yahoo! Finance](https://finance.yahoo.com/news/prediction-surprising-growth-stock-reach-183500332.html)\n\n**Meet the Supercharged Growth Stock That Could Join Apple, Nvidia, Microsoft, and Alphabet in the $2 Trillion Club by 2028**\nEli Lilly (NYSE: LLY) has seen its market capitalization briefly exceed $1 trillion, driven by the success of its GLP-1 agonist drugs, tirzepatide, sold as Mounjaro for type 2 diabetes and Zepbound for weight loss. In the third quarter, tirzepatide generated $10.1 billion in revenue, accounting for 57% of Eli Lilly’s total revenue and contributing to a 54% year-over-year revenue increase. The drug surpassed Keytruda (Merck) to become the world’s best-selling medication. Since May 2022, Lilly’s stock has risen 633% over five years and 38% in 2025, outpacing the S&P 500’s 87% five-year gain and 16% annual return. Analysts project the GLP-1 market could grow from $49 billion in 2025 to over $157 billion by 2035, though some forecasts are being revised downward due to 'price erosion'—notably, Lilly and Novo Nordisk agreed in November 2025 to lower prices for Medicare patients. However, growth potential remains strong due to expanding global demand, especially in emerging markets like China, where obesity rates are projected to reach 65% by 2030. Additionally, new applications for GLP-1 drugs are emerging, including treatments for addiction, osteoarthritis, Alzheimer’s disease, and even pet obesity. Despite short-term pricing pressures, Eli Lilly is positioned as a market leader, with the potential to reach a $2 trillion market cap by 2028, according to the article’s author. The article is published by The Motley Fool and includes disclosures of stock positions in related companies.\nOriginal language: en\nPublish date: December 05, 2025 05:05 PM\nSource: [The Motley Fool](https://www.fool.com/investing/2025/12/05/meet-the-supercharged-growth-stock-that-could-join/?source=newstex&utm_source=newstex&utm_medium=feed&utm_campaign=article&referring_guid=a1816468-ad6d-4193-a02f-4453139c5091)\n\n**'Old Money' vs. 'New Rich': Lilly Rises, Novo Nordisk Falls, but the Ultimate Battle in the Weight-Loss Drug Race Is Far from Over**\nLilly and Novo Nordisk have become global market barometers, with their every move influencing investor sentiment. On November 21, 2025, Lilly surpassed the $1 trillion market cap milestone, becoming the first pharmaceutical company to join the 'trillion-dollar club,' even surpassing Walmart in market value. In contrast, Novo Nordisk, after briefly becoming Europe's top stock, saw its share price drop nearly 50% year-to-date, losing approximately $190 billion in market value. The volatility underscores how any news from either company—on financial guidance, clinical results, or pricing strategies—can trigger rapid market reassessment. Once the leader in weight-loss drugs, Novo Nordisk now faces fierce competition from Lilly, which has shifted from follower to challenger. The race is far from over. Novo Nordisk’s GLP-1 drug, semaglutide, launched in 2021 for weight loss, initially dominated the market. Lilly responded in 2023 with tirzepatide, which gained approval for both diabetes and weight loss. The turning point came in May 2025, when Lilly’s SURMOUNT-5 trial showed tirzepatide achieved 20.2% average weight loss at week 72—significantly higher than semaglutide’s 13.7%—with a 1.47-fold relative weight reduction. This superiority translated into market share gains: in Q2 2025, tirzepatide sales ($85.8 billion) surpassed semaglutide ($80.3 billion), and in Q3, tirzepatide reached $101.03 billion versus semaglutide’s $88.62 billion. By Q3 2025, tirzepatide held 57.9% of U.S. prescription share, compared to semaglutide’s 41.7%. While semaglutide still leads in total revenue (254.62 billion USD vs. 248.37 billion USD), trend momentum favors Lilly. Lilly raised its 2025 revenue forecast to $630–635 billion, while Novo Nordisk repeatedly cut guidance, now projecting only 4–7% local currency operating profit growth—below its earlier 4–10% range. A key strategic divergence lies in pipeline diversification: Lilly’s multi-target approach includes Alzheimer’s drug donanemab, with projected sales rising from $465 million in 2024 to $3.2 billion by 2030. Novo Nordisk, reliant on semaglutide, is under pressure to expand beyond GLP-1. It has accelerated its oral semaglutide application after Lilly announced its oral GLP-1 orforglipron. In a bid to strengthen its pipeline, Novo Nordisk bid aggressively for Metsera but lost to Pfizer. This reflects broader strategic anxiety as the market shifts from a 'legacy vs. newcomer' rivalry to a more complex, multi-player competition. Novo Nordisk is undergoing frequent leadership changes and urgent strategic shifts, transitioning from market dominance to survival in a new era of therapeutic innovation.\nOriginal language: zh\nPublish date: November 26, 2025 03:25 PM\nSource: [每日经济新闻](https://www.nbd.com.cn/articles/2025-11-26/4158535.html)\n\n**This Healthcare Company Just Touched $1 Trillion in Market Cap. Should You Invest $1,000?**\nEli Lilly (NYSE: LLY) became the first healthcare company to reach a $1 trillion market capitalization, briefly surpassing the threshold on November 21, 2025, during intraday trading, though its value dipped slightly to around $950 billion before rebounding to $1 trillion again on Monday, November 24, 2025. The company's shares have risen 38% in 2025 and 645% over the past five years. This surge is primarily driven by tirzepatide, a GLP-1 drug sold as Mounjaro for type 2 diabetes and Zepbound for weight loss, which became the world’s best-selling drug in the third quarter of 2025, capturing 58% of the GLP-1 market. The global GLP-1 drug market, valued at $52 billion in 2024, is projected to grow to $187 billion by 2032, with a compound annual growth rate of nearly 17%. Additionally, in early November 2025, Eli Lilly struck a deal with the Trump administration to reduce prices for Medicare and Medicaid patients—cutting Zepbound’s cost from $1,000 to $299 per month—gaining a three-year tariff exemption and expanded access to 68 million Medicare and 71 million Medicaid beneficiaries, significantly increasing its potential patient base and revenue stream.\nOriginal language: en\nPublish date: November 26, 2025 05:29 AM\nSource: [Yahoo! Finance](https://finance.yahoo.com/news/healthcare-company-just-touched-1-173549485.html)\n\n**Massive sales for weight loss drugs spur Eli Lilly's Q3**\nEli Lilly reported record-breaking Q3 2025 results, with total revenue surging 54% year-over-year to $17.6 billion—exceeding the Zacks consensus estimate of $16.01 billion by 9.91%. This growth was driven by strong demand for tirzepatide, marketed as Mounjaro (for type 2 diabetes) and Zepbound (for weight loss). Mounjaro generated $6.5 billion in Q3 2025, a 109% increase from the same quarter in 2024, while Zepbound sales rose 185% to $3.6 billion. Global demand for weight-loss drugs offset lower pricing, contributing to the robust performance. Lilly’s shares closed at $844.50 on October 30, 2025, up 3.6% from the prior day, with a market capitalization of $757 billion. Tirzepatide’s sales have surpassed MSD’s Keytruda, signaling a potential shift in the global pharmaceutical market leadership. In response, Lilly raised its full-year 2025 revenue guidance to $63–63.5 billion, up from $62 billion. The results were notable amid CVS Caremark’s announcement to make Novo Nordisk’s Wegovy the preferred GLP-1RA treatment from July 2025. On the same day, Novo Nordisk entered a $9 billion bidding war for Metsera, a move Pfizer criticized as 'reckless'—Pfizer had already agreed to acquire Metsera in September. Metsera is developing longer-acting GLP-1RAs, which Novo aims to integrate into its Ozempic and Wegovy brands. Looking ahead, Eli Lilly plans to submit its oral GLP-1RA candidate, orforglipron, to the FDA for obesity approval in 2025, with a type 2 diabetes application expected in 2026. GlobalData forecasts orforglipron could reach $11 billion in sales by 2031.\nOriginal language: en\nPublish date: October 31, 2025 12:03 PM\nSource: [Yahoo! Finance](https://finance.yahoo.com/news/massive-sales-weight-loss-drugs-120334698.html)\n\n**3 Things Investors Need to Know Ahead of Eli Lilly's Q3 Earnings Report | The Motley Fool**\nEli Lilly (LLY) is set to report third-quarter earnings on October 30, 2025, amid heightened investor scrutiny following a 10.7% stock decline from June 2024 to October 20, 2025. The company's rapid growth, driven by the dual GLP-1/GIP receptor agonist tirzepatide—marketed as Mounjaro for diabetes and Zepbound for weight management—has fueled a 32% revenue increase in 2024, with combined sales of the two drugs reaching $16.47 billion. In the first half of 2025, tirzepatide sales surged 121% year over year to $14.7 billion. However, concerns persist over generic and compounding pharmacy competition, though evidence suggests such threats remain limited. Despite strong performance, not all revenue streams are growing: Trulicity, a previously top-selling GLP-1 drug, is losing market share to Mounjaro, and Jardiance’s revenue is declining. Eli Lilly’s second-quarter revenue rose 38% year over year, but analysts at Goldman Sachs have downgraded global anti-obesity drug sales forecasts to $95 billion by 2030 from $130 billion. Tirzepatide’s superior efficacy comes with higher side effects—nausea—making it less tolerable than Novo Nordisk’s Wegovy. The stock trades at 35.8 times forward earnings, a premium valuation justified by a 122% EPS growth over three years. However, the company faces patent cliffs: Trulicity may lose exclusivity in the U.S. by 2027, risking biosimilar competition that could pressure Mounjaro sales. Off-label use could also erode Zepbound’s market. With the GLP-1 market maturing, sustained high growth rates may no longer be sustainable. If tirzepatide’s momentum slows, investors could face significant losses as the stock reverts to typical pharmaceutical industry growth rates.\nOriginal language: en\nPublish date: October 22, 2025 07:49 AM\nSource: [The Motley Fool](https://www.fool.com/investing/2025/10/22/3-things-investors-need-to-know-ahead-of-eli-lilly/)\n\n**3 Things Investors Need to Know Ahead of Eli Lilly's Q3 Earnings Report**\nEli Lilly (NYSE: LLY) is set to release its third-quarter earnings on October 30, 2025, amid mixed investor sentiment. The company's stock rose 147.5% from late 2022 to mid-2024 due to strong performance of its tirzepatide-based drugs, Mounjaro (for diabetes) and Zepbound (for weight management), which generated combined sales of $16.47 billion in 2024—more than tripling year-over-year. In the first half of 2025, tirzepatide sales surged 121% year over year to $14.7 billion. Despite this, Eli Lilly's stock declined 10.7% from late June 2024 to October 20, 2025, due to concerns over unauthorized compounding pharmacies undercutting branded sales, though these fears appear unfounded given the robust sales growth. However, not all revenue streams are expanding: Trulicity, a GLP-1 diabetes drug, and Jardiance are losing market share. Patent expirations, particularly Trulicity’s U.S. exclusivity ending in 2027, could lead to biosimilar competition, threatening future sales. Additionally, tirzepatide’s side effects, such as nausea, make it less tolerable than Novo Nordisk’s Wegovy, which could limit market share. Eli Lilly’s stock trades at a rich 35.8 times forward earnings, supported by a 122% EPS growth over the past three years. Analysts at Goldman Sachs have lowered their 2030 global anti-obesity drug market forecast to $95 billion from $130 billion, signaling potential growth deceleration. The Motley Fool’s Stock Advisor team did not include Eli Lilly in its current list of top 10 stocks to buy, warning that if tirzepatide’s growth stalls and the company reverts to typical pharma industry growth rates, investors could face significant losses.\nOriginal language: en\nPublish date: October 22, 2025 07:43 AM\nSource: [NASDAQ Stock Market](https://www.nasdaq.com/articles/3-things-investors-need-know-ahead-eli-lillys-q3-earnings-report)\n\n**These 2 AI Stocks Could Surpass Oracle in Market Cap by 2030**\nOracle (NYSE: ORCL) has transformed from a legacy database company into a key player in global AI infrastructure, with a $455 billion contracted backlog as of August 31, 2026, and a market cap exceeding $801 billion as of October 2025. Its cloud infrastructure revenue grew 54% year over year to $3.3 billion in Q1, driven by its AI database and multicloud strategy. However, Oracle missed analyst estimates for revenue and earnings, reported negative free cash flow, and plans $35 billion in capital expenditures for fiscal 2026, indicating a focus on long-term growth over short-term profits. Its reliance on large contracts, such as the $300 billion deal with OpenAI, exposes it to counterparty risk. Despite its strength, two companies—Palantir Technologies (NASDAQ: PLTR) and Eli Lilly (NYSE: LLY)—are seen as having higher growth potential. Palantir’s revenue rose 48% year over year to $1.03 billion in Q2, with a 46% operating margin and $569 million in adjusted free cash flow. Its Artificial Intelligence Platform (AIP), built on ontology-based architecture and supported by client boot camps, has accelerated sales and delivered real-world efficiency gains. Government contracts, including a $10 billion, 10-year U.S. Army deal, provide sticky revenue. Palantir’s stock trades at 204.8 times forward earnings, but if it sustains over 30% revenue growth and 40%+ operating margins, it could surpass Oracle’s market cap by 2030. Eli Lilly’s revenue grew 38% to $15.6 billion in Q2, with non-GAAP EPS up 61% to $6.31. Its tirzepatide-based drugs—Mounjaro and Zepbound—generated $5.2 billion and $3.4 billion in revenue, respectively, and the company produced 1.6 times more doses in H1 2025 than in H1 2024. Tirzepatide’s cardiovascular benefits may expand insurance coverage, and its oral candidate orforglipron could drive rapid adoption. With a pipeline including donanemab and retatrutide, and market research forecasting $62 billion in annual tirzepatide revenue by 2030, Eli Lilly could grow revenue at over 20% annually and maintain margins above 40%, potentially surpassing Oracle’s market cap before 2030. The article concludes with a promotional note about The Motley Fool’s Stock Advisor service, which did not include Oracle in its top 10 recommended stocks.\nOriginal language: en\nPublish date: October 08, 2025 10:31 AM\nSource: [NASDAQ Stock Market](https://www.nasdaq.com/articles/these-2-ai-stocks-could-surpass-oracle-market-cap-2030)\n\n**Navigating the Future: Unit Dose Manufacturing Market Trends and Forecast Insights, 2025 Edition**\nThe press release reports that the unit dose manufacturing market is projected to grow from $32.82 billion in 2024 to $39.37 billion in 2025, a compound annual growth rate (CAGR) of 19.9% (article). By 2029 it could reach $86.68 billion, growing at a CAGR of 21.8% (article). Growth is driven by rising healthcare spending; the U.S. pharmaceutical sector generated $550 billion in revenue in 2024 and projected spending is set to rise to $605–$635 billion by 2025 (article). The report highlights product innovation, noting that Eli Lilly and Company unveiled in August 2024 single‑dose Zepbound (tirzepatide) vials at 50% lower price than other GLP‑1 obesity treatments (article). Segmentation covers product type (liquid, solid, other), sourcing (in‑house, outsourcing), and end‑user (independent pharmacies, long‑term care, hospitals, others) (article). Key players listed include Nipro Corporation, Thermo Fisher Scientific, Amcor plc, Berry Global, CCL Industries, and others (article). North America was the largest region in 2024 (article).\nOriginal language: en\nPublish date: September 12, 2025 07:18 AM\nSource: [openPR.com - Open Public Relations Free of Charge](https://www.openpr.com/news/4180511/navigating-the-future-unit-dose-manufacturing-market-trends)\n\n"
  }
]