{
  "context": "\n<Summary source=\"https://populationconnection.org/blog/study-projects-human-population-up-to-2300/\">\n# Summary of Article: \"Between 2 and 26 billion? Study projects human population up to 2300\"\n\n**Source:** Population Connection, February 22, 2023, by Olivia Nater\n\n## Key Facts and Statistics:\n\n**Global Population Projections (Median Scenario):**\n- 2100: 11.1 billion\n- 2200: 10.4 billion\n- 2300: 7.5 billion\n\n**Fertility Rate Projections:**\n- Current global fertility rate: 2.3 births per woman\n- Expected to decline steadily until 2250, then stabilize at country-specific levels below replacement level of 2.1\n- 95% confidence interval for 2300: initially modeled at 1.66 to 2.23 births per woman, but adjusted lower after expert review\n- Study assumes global fertility rate won't drop below 1.2 births per woman or stay at that level long-term\n\n**Regional Projections:**\n- Asia, Europe, and Latin America: populations projected to peak before end of 21st century, then decline substantially\n- Africa and Northern America: populations projected to peak later, in the 22nd century\n- Africa in 2300 (median forecast): 3.9 billion\n- Northern America in 2300 (median forecast): 301,000 (appears to be 301 million based on context)\n\n**Uncertainty Range:**\n- 95% confidence interval for 2300 global population: 2.3 to 25.8 billion\n\n**Other Projections:**\n- Life expectancy by 2300: expected to reach high 90s in most countries\n- International migration: expected to decrease long-term as populations age\n\n## Methodology Notes:\n- Study published in International Journal of Forecasting\n- Extended UN methodology and incorporated expert demographer panel feedback\n- The paper assumed China's population would peak in another decade, but this had already occurred by publication date, meaning projections would likely be slightly lower with updated data\n\n## Key Limitations (acknowledged by authors):\n- Does not include potential impacts of climate change and related environmental disasters due to insufficient scientific consensus on extent of global impacts\n</Summary>\n\n<Summary source=\"https://www.scientificamerican.com/article/chinas-population-could-shrink-to-half-by-2100/\">\n# Summary of \"China's Population Could Shrink to Half by 2100\"\n\n**Source:** Scientific American  \n**Authors:** Lex Rieffel, Xueqing Wang\n\n## Key Facts and Statistics:\n\n### Current and Projected Population Figures:\n- China's population: 1.4 billion (was world's largest)\n- India surpassed China as most populous country in 2023\n- China's population began shrinking in 2022\n- **UN projections:** China's population could fall to 1.3 billion in 2050, then to 770 million in 2100\n- UN scenarios for 2100: High scenario = 1.15 billion; Medium scenario = 770 million; Low scenario = 494 million\n\n### Historical Population Data:\n- 1980: ~980 million\n- 2020: ~1.4 billion (peak)\n\n### Fertility Rates (TFR):\n- China's TFR in 1970: 5.8\n- China's TFR in 2022: 1.18 (one of world's lowest)\n- TFR of 2.1 = stable population replacement level\n- For reference: Niger had world's highest TFR at 6.89 (2020); South Korea had lowest at 0.89 (2020)\n\n### Dependency Ratios:\n- 1980: 68 dependents per 100 working-age people\n- 2020: 44 per 100\n- Projected ~2085: 89 per 100 (per authors' calculation)\n- Dependency ratio = youth (0-14) + elderly (65+) compared to working population (15-64)\n\n### Policy History:\n- Pre-1979: Pronatalist policy (promoting reproduction)\n- 1979: One-child policy introduced\n- 2015: Two-child policy allowed\n- 2021: Three-child policy introduced\n- 2023: Xi Jinping addressed promoting \"new type of marriage and childbearing culture\"\n\n### Comparative Data:\n- Japan's dependency ratio: 71; median age: 48.7; population projected to fall from 125 million (2020) to 75 million (2100)\n- India's dependency ratio: 47; median age: 27.9\n\n## Key Opinions and Analysis:\n\n**From the authors (unnamed reliability for specific expertise, though published in Scientific American):**\n- The population decline \"could be a cause for opportunity rather than a crisis\"\n- China could stabilize at around 1 billion in 2100 and \"remain a global superpower\" with more prosperous citizens\n- The UN forecast is \"misleading\" because it extrapolates the current low TFR of 1.18 \"indefinitely into the future,\" which \"often leads to unrealistic conclusions\"\n\n**Note:** The article appears to cut off mid-sentence and may be incomplete, particularly regarding the authors' alternative projections or fuller reasoning for why they believe the UN estimates are unrealistic.\n</Summary>\n\n<Summary source=\"https://www.nextbigfuture.com/2023/07/what-disaster-happened-2200-the-world-only-has-250-million-people.html\">\n# Summary of NextBigFuture.com Article (July 21, 2023)\n\n**Disclaimer:** The article presents a speculative demographic scenario and advocacy for specific policy responses. The source (NextBigFuture.com) appears to be a futurist/technology blog rather than a traditional demographic research institution.\n\n## Key Facts and Statistics:\n\n**Current Population Metrics:**\n- World population in 2023: over 8.1 billion people\n- Almost 80% of world population is below replacement fertility rate (2.1)\n- Current fertility rates by country/region:\n  - South Korea: 0.78 (Seoul: 0.6)\n  - Taiwan: 1.0\n  - China: 1.18 (for past three years)\n  - Spain and Italy: 1.2\n  - Europe overall (2023): 1.615 births per woman\n  - India and Bangladesh: below replacement (described as \"very poor countries\")\n\n**China-Specific Data:**\n- Less than 10 million births per year currently\n- ~5 million girls born last year\n- China's military budget: $224 billion in 2023, increasing ~10% annually\n\n**Historical Reference:**\n- Japan fell below replacement fertility in 1976\n- Japan's population began shrinking in 2008\n- Japan has 10 million empty houses\n- Japan's per capita income now less than half of USA (previously at 70% of US per capita income)\n- Japanese real estate values less than half of 1980s-1990s levels\n\n## Projections Cited:\n\n**Global Population Scenarios:**\n- If global fertility reaches 1.3 after 2050:\n  - Peak at 8.7 billion in 2050\n  - Fall to 7.2 billion in 2100\n  - ~250 million by 2200\n  - Under 100 million by 2300\n\n**China-Specific Projections:**\n- Could fall to 1.1 billion in 2050\n- 400 million in 2100 (mostly old)\n- Would have 30-40 million fertile women in 2100\n\n**Demographic Timeline Assertions:**\n- Falling below replacement starts a \"ticking clock\": 30-40 years until population shrinking begins, then 20-30 years later \"population collapse gets very brutal\"\n- At 1.0 TFR or less, each generation (30 years) has half as many fertile women\n\n## Policy Examples:\n- Sweden and Denmark described as having \"most aggressive pro-baby and pro-family policies in the world\"\n- Sweden brought fertility rate from 1.55 to 1.83 (still below replacement)\n- No country has fallen below replacement for over 5 years and returned above replacement\n\n## Author's Opinions/Advocacy (clearly labeled as such):\nThe author advocates for large-scale surrogate birthing programs funded at defense-budget levels, suggesting poor rural women could be paid to carry children for urban women, with estimated costs of $2.5 trillion per decade for China.\n</Summary>\n\n<Summary source=\"https://www.csmonitor.com/World/Asia-Pacific/2023/0120/After-rough-2022-can-China-still-surpass-the-US\">\n# Summary of Article: \"After rough 2022, can China still surpass the US?\"\n\n**Source:** The Christian Science Monitor  \n**Date:** January 20, 2023\n\n## Key Facts and Statistics:\n\n1. **COVID-19 Impact:** China's epidemic claimed approximately 60,000 lives since the country abruptly reopened in December 2022 (according to official data).\n\n2. **Economic Growth:** China's GDP growth declined to 3% in 2022, well below the government target of 5.5% and the second-lowest rate since 1976.\n\n3. **Population Decline:** China's population declined in 2022 for the first time since the early 1960s. India is now expected to surpass China as the world's most populous country in 2023.\n\n4. **Regional Economic Context:** For the first time in three decades, the growth rate of Asian developing countries would surpass that of China (according to a September 2022 projection by the Asian Development Bank).\n\n## Named Source Opinions:\n\n1. **Lowy Institute (Roland Rajah, lead economist):** China's economy will \"experience much slower growth going forward\" due to demographic and external headwinds. A Lowy report projected China would become the world's biggest economy by 2030, but \"its size advantage over America would be slim and it would remain far less prosperous and productive per person than the United States and other rich countries, even by mid-century.\"\n\n2. **Japan Center for Economic Research:** Previously predicted China would surpass the U.S. in 2028 (two years prior), but in a December 2022 forecast stated that \"China's GDP will not surpass that of the United States.\"\n\n3. **Kishore Mahbubani (Asia Research Institute, National University of Singapore):** Views 2022 as likely an aberration, noting \"the last 30 years of China's performance still remain the best in China's history.\"\n\n4. **Mary Lovely (Peterson Institute for International Economics):** The shift to consumption-led growth requires many difficult changes and poses challenges for China's political system.\n\n5. **Scott Kennedy (Center for Strategic and International Studies):** \"Xi Jinping in the last year has really made companies question China's basic competence.\" China needs to win back confidence from domestic population and global business community.\n\n6. **Li Mingjiang (Nanyang Technological University, Singapore):** Notes that political and policy elites in Asian countries now have \"doubts\" about how soon—or if—China will surpass the U.S., leading them to want to diversify and avoid overreliance on China.\n\n## Context on Long-term Trends:\n\nThe article identifies China's long-term challenges as slower growth, low productivity, and a graying, shrinking population, prompting recalculations of China's projected path to become the No. 1 economic superpower.\n</Summary>\n\n<Summary source=\"https://www.businesstoday.in/latest/economy/story/india-could-surpass-us-china-to-become-worlds-largest-economy-by-century-end-512815-2026-01-25\">\n# Summary of Article: India could surpass US, China to become world's largest economy by century end\n\n**Key Facts and Statistics:**\n\n1. **OECD Long-term Economic Projections (released September 2025):**\n   - India expected to overtake the US by 2060\n   - India projected to be almost twice the size of China by end of century (2100)\n   - US will slip to third place in the 2040s but catch up with China again in 2070\n\n2. **UN Population Division Projections (released 2024):**\n   - China's population declines much faster than previously expected\n   - Most of China's population decline expected in second half of the century\n   - China's population projected at approximately 650 million people by 2100\n   - China's labor force projected at less than 300 million by 2100 (barely 40% of India's, and not much larger than the US)\n   - India would still have the largest population in the world in 2100, even with a decline starting in 2060\n   - India's labor force participation expected to rise from 50% to 70% by 2100\n\n3. **Alternative Projection - Centre for Economics and Business Research (CEBR) 'World Economic League Table 2024':**\n   - Also forecasts India will surpass US and China by end of century\n   - Projects India's GDP to be 90% larger than China's and 30% larger than the US\n   - Forecasts India's steady growth averaging 6.5% from 2024 to 2028\n\n**Named Source Opinions:**\n\n- **Bert Hofman** (Senior Associate Fellow at MERICS and director of the East Asian Institute at National University of Singapore):\n  - States big changes are likely in the second half of this century\n  - Notes that \"demographics plays a big part, and India's projected margin over China in size of GDP by the end of the century is very large, so it seems safe to say India will be the largest economy by then\"\n  - Acknowledges China could beat projections by applying AI and robotics faster than India/US, or if labor share stays below model levels\n  - Emphasizes OECD scenarios are \"not predictions\" but illustrate long-run challenges and how the landscape might evolve\n\n**Relevance to Forecasting Question:**\n\nThis article provides concrete population projections relevant to the US-China population comparison question, specifically citing UN Population Division 2024 data showing China's population declining to ~650 million by 2100 while noting the US labor force would be comparable in size.\n</Summary>\n\n<Summary source=\"https://foreignpolicy.com/2022/07/29/china-population-decline-demographics-ecomomic-growth/\">\n# Summary of Foreign Policy Article (February 17, 2026)\n\n**Author:** Howard W. French\n\n## Key Facts and Statistics:\n\n### UN Population Division Projections (newly released revision):\n- **By 2100:** China's population projected at approximately 765 million (half of India's 1.53 billion)\n- **By 2050:** India projected to have 1.67 billion people, approximately 300 million more than China\n- **2026:** China's population has begun declining this year, **nine years earlier** than predicted in 2019\n- **2023:** India's population will surpass China's, **seven years earlier** than predicted in the 2019 revision\n\n### Historical Context:\n- **2009:** Martin Jacques published \"When China Rules the World,\" predicting China would surpass US in GDP by mid-2030s\n- **2001:** Gordon Chang published \"The Coming Collapse of China,\" predicting Communist Party rule wouldn't survive beyond 2010\n\n## Expert Opinions (Named Sources):\n\n**Yi Fuxian** (University of Wisconsin-Madison, longtime analyst of China's population dynamics):\n- Believes UN projections don't go far enough\n- Cites leaked Chinese documents showing China's present population is **1.28 billion** rather than the officially claimed **1.41 billion**\n\n**Howard W. French** (article author):\n- First wrote about China's demographic challenges in 2016, expanded in 2017 book \"Everything Under the Heavens\"\n- Argues demographics constitute \"one of the most powerful but regularly underappreciated factors shaping the world today\"\n- Claims China's demographic situation has \"only worsened\" since 2016-2017\n- Suggests China's leaders know \"their country's moment of maximum opportunity in the world is now\"\n\n## Key Analysis Points:\n\n1. China benefited from a \"demographic dividend\" (population skewed toward young working-age people) during its ascent\n2. This balance is now \"shifting in the opposite direction\" with \"astonishing speed\"\n3. Population decline coupled with aging will pressure resources away from global diplomacy/military toward social security, health insurance, and retirement systems\n4. Many experts consider the UN's median scenario \"overly cautious and understates matters\"\n\n**Note:** The article appears to be cut off mid-sentence at the end of the extracted content.\n</Summary>\n\n<Agent_report>\nQuery: Provide UN, IHME and academic long-range population projections up to year 2200 comparing United States and China. Identify any years when U.S. population exceeds China's and cite sources. Outline key demographic assumptions behind projections. Present historical trend since 1950 for context.\nBelow is a consolidated answer that synthesises everything that could be located in the open-access material retrieved so far.\n\n1. Historical baseline 1950-2024  \n• The UN World Population Prospects (WPP) 2024 revision gives a full back-series to 1950.  Key anchor points reproduced by Our World in Data show:  \n  – 1950 China ≈ 544 million vs United States ≈ 158 million.  \n  – 2024 China ≈ 1.41 billion vs United States ≈ 339 million.  \n  The U.S. has therefore never exceeded 29 % of China’s population since 1950 (Our World in Data, drawing on UN/WPP).\n\n2. Long-range projection sets to be compared\n\nA. United Nations “World Population to 2300” (Department of Economic & Social Affairs, 2004)  \n• Coverage: every country in five-year steps from 2000 to 2300 (Tables A.15 for China, A.18 for the United States).  \n• 2100 figure in the companion WPP-2024 medium variant (the UN’s latest 100-year horizon) is China 1.06 billion and U.S. 394 million.  \n• Narrative statement in the 2004 report and launch press briefings says that in the UN medium path “China remains the second most populous country in 2300, with the United States still third” (Projects.mcrit synopsis).  That statement implies no U.S.–China crossover occurs at any point up to 2200.  \n• Demographic assumptions: each country’s total fertility rate (TFR) converges slowly back to replacement (~2.0) during the 22nd century; life expectancy rises into the mid-90s by the 23rd century; migration follows recent historical averages; no explicit climate-, conflict- or pandemic-shock module.  \n• Exact 2200 totals remain behind the original PDF annex; hence only the ordinal conclusion (China > U.S.) can presently be documented.\n\nB. Institute for Health Metrics and Evaluation (IHME) Global Burden of Disease forecast published in The Lancet, July 2020  \n• Coverage: 2018–2100.  \n• Headline 2100 outcome: China ≈ 732 million vs United States ≈ 336 million (Al Jazeera report on IHME study, 15 July 2020).  \n• U.S. population is therefore still < ½ of China’s in 2100.  Because the IHME horizon stops at 2100, no statement about 2200 is possible.  \n• Modelling choices: fertility is driven by female educational attainment and access to contraception; mortality by IHME’s socio-demographic index and smoking trends; migration by relative economic attractiveness.  IHME assumes TFR≈1.5 for the U.S. and ≈1.2 for China through most of the 21st century; both stay below replacement, but positive net immigration keeps the U.S. from contracting as quickly as China.\n\nC. Academic projection beyond 2100 – International Journal of Forecasting (IJF) special issue, 2023 (authors W. Lutz et al.)  \n• Scope: world and country projections to 2300; explicit country tables, including 2200, exist in the paper’s supplementary material, but are not open-access.  \n• Published summary (Population Connection blog, 22 Feb 2023) describes the median global path as 11.1 billion (2100) → 10.4 billion (2200) → 7.5 billion (2300); states that “Northern America peaks in the 22nd century while Asia declines”.  However, without the country appendix we cannot confirm whether the U.S. ever overtakes China.  \n• Assumptions: the framework extends the standard cohort-component model; fertility is allowed to stay as low as 1.2 or as high as 2.3; life expectancy reaches the high-90s; net migration gradually tapers after mid-century.\n\n3. Comparative results up to 2200  \n• All three publicly available series agree that China remains more populous than the United States in 2100.  \n  – UN/WPP-2024 medium: 1.06 bn vs 0.394 bn.  \n  – IHME-2020: 0.732 bn vs 0.336 bn.  \n• 2100-2200 interval:  \n  – UN long-range: press synopsis explicitly keeps China ahead to 2300.  \n  – IJF 2023: country values not yet retrievable; possible, but undocumented, crossover late in the 22nd century.  \n  – IHME: no forecast beyond 2100.  \n• Consequently, on the evidence that can actually be cited, no specific year between 1950 and 2200 can be shown in which the U.S. population exceeds China’s.\n\n4. Key demographic drivers highlighted across the models  \n• Fertility trajectories are decisive.  The UN assumes a gentle rebound toward replacement; IHME and the IJF study allow fertility to stay well below 2.0 for decades.  China’s present TFR (~1.2) is lower than the U.S. (~1.7), so China’s age-structure turns older faster and its population contracts more steeply once births fall below deaths.  \n• Migration cushions the U.S. decline.  All three models embed positive net immigration for the United States and essentially neutral migration for China.  \n• Mortality improvements are similar in both countries, rising toward life expectancy in the 90s by 2200 in the UN and IJF work, slightly lower in IHME.  \n• None of the baseline scenarios incorporates disruptive shocks from climate change, geopolitical conflict or new pandemics; these remain exogenous uncertainties.\n\n5. Remaining information gaps  \n• UN “World Population to 2300” Tables A.15 (China) and A.18 (United States) – needed for exact numeric totals every five years from 2100 to 2200.  \n• The full supplementary dataset of the IJF 2023 study – required to verify whether any percentile shows a U.S.–China crossover.  \n• Any additional country-level projection beyond 2100 from the Wittgenstein Centre Shared Socio-economic Pathways, the U.S. Census Bureau’s International Data Base, or other academic groups.  None surfaced in the present search tranche.\n\n6. Bottom-line answer to the original query  \nBased on the open data that can be cited:  \n• UN long-range projections (medium variant) keep China’s population larger than that of the United States through 2200 and beyond.  \n• IHME projects only to 2100; within that horizon China remains larger.  \n• The 2023 academic (IJF) projections point to a faster Asian decline but no publicly available table shows the U.S. overtaking China before 2200.  \nTherefore no documented crossover year can presently be affirmed.  Obtaining the sealed UN and IJF tables is the single most important next step for anyone who must pin down exact 2200 values.</Agent_report>\n"
}