[
  {
    "title": "AskNews Research",
    "url": "",
    "snippet": "Here are the relevant news articles:\n\n**Tehran Installs Giant Billboard Warning U.S. Against Military Action Amid Escalating Tensions**\nA large advertising billboard warning the United States against military action was installed in Tehran's Enghelab Square on Sunday, following U.S. President statements about deploying a fleet to the region 'just in case.' The billboard features a dramatic image of a damaged aircraft carrier with destroyed fighters, blood-stained decks, and blood flowing into the water to form patterns resembling the American flag. The slogan 'Sow the wind, reap the storm' appears in the corner. The installation coincided with the movement of the USS Abraham Lincoln and accompanying warships toward Iran. Iran's Revolutionary Guard commander warned that forces are 'as ready as never before, with a finger on the trigger.' Tensions have escalated after the brutal suppression of anti-government protests that began on December 28, triggered by the collapse of Iran's currency. According to U.S.-based Human Rights Watch, 5,848 people have died and over 41,280 protesters arrested. The U.S. President previously threatened military action if Iran continues killing peaceful demonstrators and conducting mass executions. Iran's General Prosecutor dismissed claims that Tehran paused executions of around 800 arrested protesters as 'completely false.' Former President Trump stated that June strikes on Iranian nuclear sites would be 'a minor matter.' The U.S. Central Command confirmed F-15E Strike Eagle fighters were deployed to the Middle East, and the UK Ministry of Defence announced Typhoon fighters were stationed in Qatar 'for defense purposes.' Iran's Foreign Minister warned the U.S. that Iran would 'open fire in response' to any new attack, citing its readiness after the 12-day conflict with Israel in June 2025. The government claims 3,117 deaths, with 2,427 as civilians or security personnel and the rest labeled 'terrorists.' The Associated Press could not independently verify the death toll due to a nationwide internet blackout lasting over two weeks, the largest in Iran's history.\nOriginal language: ru\nPublish date: January 26, 2026 05:47 AM\nSource: [euronews](http://ru.euronews.com/2026/01/26/iran-install-billboard-threatening-usa)\n\n**War Clouds Over Iran As Trump Issues Military Threats Deploys US Warships; Fears Of Conflict Rise**\nGeopolitical tensions between the United States and Iran are escalating, with the U.S. deploying warships and issuing military threats, leading to growing fears of a potential military confrontation. The situation has intensified as of January 25, 2026, according to TimesNow, though specific details about the deployments, threats, or regional reactions are not provided in the article.\nOriginal language: en\nPublish date: January 25, 2026 05:07 AM\nSource: [TimesNow](https://www.timesnownews.com/videos/times-now/world/war-clouds-over-iran-as-trump-issues-military-threats-deploys-us-warships-fears-of-conflict-rise-video-153502523)\n\n**Protests, Threats, carrier strike group: How US-Iran tensions escalated again**\nTensions between the United States and Iran have escalated significantly, reigniting a long-standing conflict amid ongoing protests in Iran that began in late December 2025. Over 500 people have been killed, and widespread property damage has occurred during anti-government demonstrations triggered by economic collapse, inflation, currency devaluation, and subsidy cuts. Iran's Supreme Leader, Ayatollah Ali Khamenei, accused the U.S. of instigating the unrest. In response, U.S. President Donald Trump issued multiple threats, including vowing to 'wipe out Iran' and 'obliterate' its nuclear capacity during potential strikes in June 2025, while also calling Khamenei 'a sick man' and demanding new leadership. Iran retaliated with a firm warning: any attack would trigger a full-scale war. The deployment of a U.S. carrier strike group—comprising a central aircraft carrier, escort warships, and fighter jets—near Iran has heightened fears of a major military confrontation. The situation intensified in January 2026, with Trump stating in an interview that 'anything happens, they're going to wipe them off the face of this earth,' and reaffirming in Davos that Iran 'does want to talk, and will talk.' A senior Iranian official declared the U.S. military presence a direct threat and vowed retaliation using 'everything at its disposal.'\nOriginal language: en\nPublish date: January 24, 2026 07:31 PM\nSource: [Daily News and Analysis (DNA) India](https://www.dnaindia.com/world/report-protests-threats-carrier-strike-group-how-us-iran-tensions-escalated-again-3198105)\n\n**Why US-Iran Relations Are Deteriorating Again After a Short-Lived Calm?**\nUS-Iran relations have deteriorated again after a brief period of reduced tension, following a surge in internal unrest in Iran that began in late December 2025. The unrest, sparked by economic grievances including high inflation, a collapsing currency, and declining living standards, escalated into widespread political protests. Iranian authorities responded with a nationwide internet and phone blackout on 8 January 2026, aiming to suppress coordination and limit information flow. Activist groups report over 5,000 deaths, though exact figures remain uncertain due to communication restrictions; the Guardian quoted an Iranian official acknowledging thousands died, blaming 'terrorists and armed rioters.' The Human Rights Activists news agency reported more than 24,000 arrests, with Kurdish regions experiencing the worst violence. The US response intensified after President Donald Trump declared Washington would 'come to their rescue,' urged Iranians to 'take over your institutions,' and warned that any attack on him would result in 'wiping them off the face of this earth.' On 14 January 2026, the US reportedly came close to launching military strikes, but the operation was halted at the last moment due to pressure from regional allies, including Israel’s Prime Minister Benjamin Netanyahu, who warned of unpreparedness for retaliation, and Saudi Crown Prince Mohammed bin Salman, who urged caution. A temporary calm followed, with restored internet access, a halt to executions (though Iran’s chief prosecutor denied mass executions were planned), and reduced public protests, though anti-Khamenei slogans persisted in Tehran, Shiraz, and Isfahan. The pause ended when Trump warned of a 'big flotilla' of US warships approaching Iran, including the USS Abraham Lincoln carrier group, which he described as a 'warning rather than a combat mission.' Iran responded sharply: military spokesperson Abolfazl Shekarchi declared that any aggression against Supreme Leader Ayatollah Ali Khamenei would trigger 'war' and that Iran would 'set fire to their world.' Iran’s Revolutionary Guard stated it has its 'finger on the trigger,' and an Iranian official told Reuters that any attack—limited, surgical, or kinetic—would be considered full-scale war. The US faces uncertain outcomes: limited strikes might embolden protesters and undermine regime confidence, but could also provoke intensified repression. Experts emphasize that Iran’s political future hinges on domestic dynamics, not foreign military intervention. The US carrier group provides strategic leverage, but Iran may respond with calibrated escalation to avoid full war. However, targeting Khamenei would likely trigger an unpredictable and catastrophic conflict.\nOriginal language: en\nPublish date: January 24, 2026 12:51 PM\nSource: [The Sunday Guardian Live](https://sundayguardianlive.com/world/why-us-iran-relations-are-deteriorating-again-after-a-short-lived-calm-166114/)\n\n**After A Short-Lived Pause, US-Iran Tensions Are Flaring Again: What Triggered The Escalation?**\nTensions between the United States and Iran have escalated again following a brief de-escalation, reigniting fears of military conflict. The crisis originated in late December 2025 amid widespread protests in Iran over economic hardship, inflation, and a collapsing currency, which quickly evolved into anti-government demonstrations. Iranian authorities responded with a nationwide internet blackout on 8 January 2026, restricting communication and obscuring the scale of unrest. Activist groups estimate over 5,000 people were killed, while the Human Rights Activists news agency reported more than 24,000 arrests, with particularly violent clashes in Kurdish regions. The situation intensified in early January when U.S. President Donald Trump publicly urged Iranians to 'take over your institutions' and called Supreme Leader Ayatollah Ali Khamenei 'a sick man who should run his country properly,' escalating rhetoric. On 14 January, the U.S. reportedly came close to launching military strikes, but regional pressure from Israel’s Prime Minister Benjamin Netanyahu and Saudi Arabia’s Crown Prince Mohammed bin Salman led to a pause. A brief period of calm followed on 16 January, when Trump claimed Iran halted the execution of 800 protesters—though Iran’s top prosecutor denied this. Partial internet restoration and reduced public demonstrations created the illusion of stabilization. However, tensions flared again after Trump warned that any assassination attempt on him would trigger 'overwhelming retaliation' against Iran, referencing his call for Khamenei’s removal. Iran responded swiftly: Armed forces spokesperson Abolfazl Shekarchi declared that any aggression against Khamenei would lead to 'setting fire to their world.' Trump then announced a 'big flotilla' of U.S. warships, including the USS Abraham Lincoln carrier strike group, moving toward the Persian Gulf, framing it as a 'warning rather than a combat mission.' Iran’s senior officials stated that any attack—limited or unlimited—would be treated as full-scale war, with the Islamic Revolutionary Guard Corps declaring they are 'on high readiness' and have their 'finger on the trigger.' The U.S. now faces several military options: symbolic strikes on nuclear or missile sites, attacks on Iran’s security forces (IRGC, Basij), cyber operations, strikes on economic infrastructure (oil and gas facilities), or the most unpredictable option—assassination-style strikes targeting Khamenei. Analysts caution that while strikes might boost protester morale and expose regime weaknesses, they risk triggering greater repression, as seen in past uprisings. A U.S. strike on Khamenei could cause a power vacuum, given Iran’s lack of consensus on succession, and would almost certainly lead to war. Experts emphasize that Iran’s future will be determined by Iranians, not U.S. military action. Iran is expected to respond to any U.S. move with calibrated, symbolic retaliation to maintain deterrence while avoiding full-scale war—unless Khamenei is targeted, which would mark a decisive shift toward all-out conflict.\nOriginal language: en\nPublish date: January 24, 2026 11:47 AM\nSource: [News18](https://www.news18.com/explainers/after-a-short-lived-pause-us-iran-tensions-are-flaring-again-what-triggered-the-escalation-ws-l-9854123.html)\n\n**Iran and the U.S. at the Brink: Between 'I Won't Strike' and the Roar of Battleships**\nThe article analyzes the escalating tension between the United States and Iran, highlighting a stark contrast between public statements and military actions. While Donald Trump publicly declares 'I will not attack,' U.S. military movements—including the repositioning of aircraft carriers, heightened readiness at bases from the Gulf to the Eastern Mediterranean, and open sea deployments—signal a clear military preparedness. The U.S. does not mobilize for show; such actions reflect a real, if restrained, readiness for military options. Trump’s strategy is framed as one of 'brinkmanship,' using the threat of war to extract concessions without direct conflict. Iran, with its nuclear program and regional influence across Iraq, Syria, Lebanon, and Yemen, is seen as both a strategic target and a destabilizing force. The U.S. military buildup serves not only as a deterrent but also as a strategic umbrella for Israel, which views Iran as an existential threat and seeks opportunities for limited, controlled escalation. Israel, though not seeking a full war, interprets U.S. posture as implicit support, enabling it to act with greater confidence. Iran, aware of U.S. reluctance for war and Israeli pressure, carefully manages its responses—raising tensions when advantageous but avoiding full-scale conflict. However, the risk of miscalculation is high due to multiple actors, overlapping interests, and multiple flashpoints. A minor incident—such as a misinterpreted missile launch or a poorly timed attack—could rapidly escalate into a broader conflict. The region, including the Gulf, Iraq, Syria, Lebanon, and even distant countries like Egypt, remains vulnerable to economic, political, and security fallout. The article concludes that while war is not inevitable, the conditions for conflict are fully in place: an openly hostile adversary, military mobilization, an eager ally, and an already volatile regional environment. What remains uncertain is only the timing—often abrupt and unpredictable in the Middle East. The article emphasizes that in international politics, words are for public consumption, but military movements are the true language of power. Between denial and preparation, the region stands at a precipice, aware of the danger but uncertain of the outcome.\nOriginal language: ar\nPublish date: January 24, 2026 10:14 AM\nSource: [Dostor](https://www.dostor.org/5393133)\n\n**Tehran Installs Giant Billboard Warning U.S. Against Military Action Amid Escalating Tensions**\nA large advertising billboard warning the United States against military action was installed in Tehran's Enghelab Square on Sunday, following U.S. President statements about deploying a fleet to the region 'just in case.' The billboard features a dramatic image of a damaged aircraft carrier with destroyed fighters, blood-stained decks, and blood flowing into the water to form patterns resembling the American flag. The slogan 'Sow the wind, reap the storm' appears in the corner. The installation coincided with the movement of the USS Abraham Lincoln and accompanying warships toward Iran. Iran's Revolutionary Guard commander warned that forces are 'as ready as never before, with a finger on the trigger.' Tensions have escalated after the brutal suppression of anti-government protests that began on December 28, triggered by the collapse of Iran's currency. According to U.S.-based Human Rights Watch, 5,848 people have died and over 41,280 protesters arrested. The U.S. President previously threatened military action if Iran continues killing peaceful demonstrators and conducting mass executions. Iran's General Prosecutor dismissed claims that Tehran paused executions of around 800 arrested protesters as 'completely false.' Former President Trump stated that June strikes on Iranian nuclear sites would be 'a minor matter.' The U.S. Central Command confirmed F-15E Strike Eagle fighters were deployed to the Middle East, and the UK Ministry of Defence announced Typhoon fighters were stationed in Qatar 'for defense purposes.' Iran's Foreign Minister warned the U.S. that Iran would 'open fire in response' to any new attack, citing its readiness after the 12-day conflict with Israel in June 2025. The government claims 3,117 deaths, with 2,427 as civilians or security personnel and the rest labeled 'terrorists.' The Associated Press could not independently verify the death toll due to a nationwide internet blackout lasting over two weeks, the largest in Iran's history.\nOriginal language: ru\nPublish date: January 26, 2026 05:47 AM\nSource: [euronews](http://ru.euronews.com/2026/01/26/iran-install-billboard-threatening-usa)\n\n**Iran's Ambassador to Spain: 'If There Is a Threat from Trump Against Denmark, Why Not Against Iran?'**\nReza Zabib, the Iranian ambassador to Spain, stated in an interview with Europa Press that Iran cannot rule out a potential U.S. attack, especially given former U.S. President Trump's threats against countries like Denmark. He emphasized that Iran is prepared to confront any foreign aggression, whether from the United States or the 'Zionist regime.' Zabib confirmed that direct and indirect diplomatic channels with the U.S. administration remained active during periods of heightened tension, noting that Iran has never withdrawn from such communication and responds to reasonable messages. He praised regional countries like Saudi Arabia and Israel for avoiding military escalation, calling it a wise move based on the principle that security is indivisible. Zabib dismissed claims by European leaders, including German Chancellor Friedrich Merz, that Iran's regime is nearing collapse, accusing Western media and political narratives of exaggerating events and spreading misinformation. He referenced the 1953 coup (Operation Ajax) as a historical precedent for foreign interference and asserted that Iran has successfully resisted both direct aggression in June 2025 and a covert terrorist operation. Iran remains open to negotiation, citing the 2015 nuclear deal as proof, but insists it is prepared to defend itself if other actors choose confrontation.\nOriginal language: es\nPublish date: January 25, 2026 09:30 AM\nSource: [europa press](https://www.europapress.es/internacional/noticia-embajador-iran-espana-reza-zabib-si-existe-amenaza-trump-contra-dinamarca-no-contra-iran-20260125103038.html)\n\n**Tensions Surge in Middle East: U.S. Military Buildup and Iran's Bunkerized Leadership Amid Escalating Crisis**\nTensions between the United States, Israel, and Iran have escalated, with reports indicating that U.S. military forces are deploying aircraft carriers and fighter jets to the Middle East amid fears of an imminent American strike on Iran. Admiral Brad Cooper, commander of U.S. Central Command (CENTCOM), met with Israeli Defense Forces (IDF) Chief Eyal Zamir in a lengthy and personal meeting, underscoring the deepening strategic military cooperation between the two nations. The U.S. Department of State released a hardline message on X (formerly Twitter) in Persian, stating that violence is an integral part of Iran’s political strategy since 1979, citing the suppression of protests, including the killing of Mahsa Amini and the use of 18-wheel trucks instead of ambulances during crackdowns. According to Time magazine, citing anonymous Iranian health officials, over 30,000 people may have been killed in just two days of protests in early January 2026—far exceeding the official government figure of 3,117. Iran International reported that Supreme Leader Ayatollah Khamenei has reportedly retreated into a bunker, with his son Masoud Khamenei acting as a proxy. Iranian Revolutionary Guards declared readiness to follow orders, stating 'We have our finger on the trigger.' Satellite images show damage to Iran’s nuclear sites, including Fordow and Isfahan. U.S. military activity includes the deployment of the USS Abraham Lincoln Carrier Strike Group, increased fighter presence in Jordan, and a spike in Pentagon Pizza Meter deliveries—used as an informal indicator of geopolitical stress. Meanwhile, several airlines suspended flights to Middle Eastern capitals, only to resume after U.S. envoy Steven Witkoff and Jared Kushner arrived in Israel to meet Prime Minister Netanyahu. The article notes that while the situation is highly volatile, the presence of high-level U.S. officials may be delaying a potential military escalation.\nOriginal language: it\nPublish date: January 25, 2026 08:02 AM\nSource: [DAGOSPIA](http://www.dagospia.com/cronache/tira-aria-guerra-teheran-gli-uniti-stanno-spostando-portaerei-caccia-in-461672)\n\n**War Clouds Over Iran As Trump Issues Military Threats Deploys US Warships; Fears Of Conflict Rise**\nGeopolitical tensions between the United States and Iran are escalating, with the U.S. deploying warships and issuing military threats, leading to growing fears of a potential military confrontation. The situation has intensified as of January 25, 2026, according to TimesNow, though specific details about the deployments, threats, or regional reactions are not provided in the article.\nOriginal language: en\nPublish date: January 25, 2026 05:07 AM\nSource: [TimesNow](https://www.timesnownews.com/videos/times-now/world/war-clouds-over-iran-as-trump-issues-military-threats-deploys-us-warships-fears-of-conflict-rise-video-153502523)\n\n**Iran-US tensions LIVE: Trump vs Tehran war of words intensifies with US warships on standby**\nIran-US tensions escalated in early January 2026 amid a backdrop of recent protests and a severe government crackdown. President Donald Trump stated that the US was positioning naval warships closer to the region 'just in case' he decides to act, following earlier warnings of an 'armada heading' toward Iran. In response, Iran's Revolutionary Guard commander, Gen. Mohammad Pakpour, issued a defiant statement, saying Iran's forces are 'more ready than ever, finger on the trigger,' prepared to execute orders from the Commander-in-Chief. Meanwhile, Iran's ambassador to India publicly thanked New Delhi for voting against a UN Human Rights Council resolution it deemed 'unjust and politically motivated,' calling India's stance 'principled and firm' during a time of heightened Iran-US tensions. The protests, which began in late December 2025 over economic hardship and the collapse of the rial, led to a widespread internet shutdown—the longest and most comprehensive in Iran’s history—severely restricting communication. Activists claim at least 5,000 people were killed during the crackdown, a figure not confirmed by Iranian authorities. By early January 2026, protests appeared to subside, largely due to the communications blackout limiting the flow of footage from the country.\nOriginal language: en\nPublish date: January 25, 2026 03:47 AM\nSource: [Hindustan Times](https://www.hindustantimes.com/world-news/iran-us-tensions-news-live-updates-will-us-attack-iran-trump-khamenei-tehran-protest-101769310603476.html)\n\n**Protests, Threats, carrier strike group: How US-Iran tensions escalated again**\nTensions between the United States and Iran have escalated significantly, reigniting a long-standing conflict amid ongoing protests in Iran that began in late December 2025. Over 500 people have been killed, and widespread property damage has occurred during anti-government demonstrations triggered by economic collapse, inflation, currency devaluation, and subsidy cuts. Iran's Supreme Leader, Ayatollah Ali Khamenei, accused the U.S. of instigating the unrest. In response, U.S. President Donald Trump issued multiple threats, including vowing to 'wipe out Iran' and 'obliterate' its nuclear capacity during potential strikes in June 2025, while also calling Khamenei 'a sick man' and demanding new leadership. Iran retaliated with a firm warning: any attack would trigger a full-scale war. The deployment of a U.S. carrier strike group—comprising a central aircraft carrier, escort warships, and fighter jets—near Iran has heightened fears of a major military confrontation. The situation intensified in January 2026, with Trump stating in an interview that 'anything happens, they're going to wipe them off the face of this earth,' and reaffirming in Davos that Iran 'does want to talk, and will talk.' A senior Iranian official declared the U.S. military presence a direct threat and vowed retaliation using 'everything at its disposal.'\nOriginal language: en\nPublish date: January 24, 2026 07:31 PM\nSource: [Daily News and Analysis (DNA) India](https://www.dnaindia.com/world/report-protests-threats-carrier-strike-group-how-us-iran-tensions-escalated-again-3198105)\n\n**Escalation Over Iran: U.S. Military Moves, Israeli Coordination, and Warnings of a Decisive Response**\nTensions surrounding Iran have escalated on both military and political fronts, with U.S. military movements and Israeli security coordination countered by Iran’s warnings of a existential threat from any attack and readiness to respond to the worst-case scenarios. The U.S. Central Command Commander, Brad Cooper, arrived in Israel to hold security and military coordination meetings with Israeli leadership, including Chief of Staff Eyal Zamir and the Air Force Commander, according to Israeli media and the Haaretz newspaper. Simultaneously, the U.S. Navy confirmed that the aircraft carrier USS Abraham Lincoln, accompanied by three destroyers, arrived in the Indian Ocean from the South China Sea, with plans to join U.S. destroyers already stationed in the Gulf. Iran’s UN mission cited a senior Iranian official stating that any U.S. attack would be considered an existential threat, and that Iran’s military is prepared for the worst-case scenarios. The official also expressed hope that the military buildup is not a prelude to real conflict and mentioned ongoing discussions about reviving nuclear talks. Iran’s Ground Forces and Revolutionary Guard emphasized unity and coordination among armed forces as decisive in thwarting enemy plots. Ground Forces Commander Brigadier General Ali Jahanshahi stated that 'unity of the armed forces is the key to defeating the enemy in crises' and affirmed that ground forces will defend Iranian soil alongside the Revolutionary Guard, pledging to defend Iran 'to the death.' Revolutionary Guard Ground Forces Commander Brigadier General Mohammad Karami described inter-service coordination as a 'valuable asset' requiring serious preservation and enhancement. Deputy Commander of the Revolutionary Guard Ahmad Vahidi declared that 'it is wrong to retest what has already been tested,' asserting Iran is 'at the peak of its strength' and ready to respond forcefully to any aggression, calling the latest conspiracy against Iran a continuation of the '12-day war.'\nOriginal language: ar\nPublish date: January 24, 2026 04:24 PM\nSource: [Aljazeera](https://www.aljazeera.net/news/2026/1/24/%D8%AA%D8%B5%D8%B9%D9%8A%D8%AF-%D8%AD%D9%88%D9%84-%D8%A5%D9%8A%D8%B1%D8%A7%D9%86-%D8%AA%D8%AD%D8%B1%D9%83%D8%A7%D8%AA-%D8%A3%D9%85%D8%B1%D9%8A%D9%83%D9%8A%D8%A9-%D9%88%D8%AA%D9%86%D8%B3%D9%8A%D9%82)\n\n**Why US-Iran Relations Are Deteriorating Again After a Short-Lived Calm?**\nUS-Iran relations have deteriorated again after a brief period of reduced tension, following a surge in internal unrest in Iran that began in late December 2025. The unrest, sparked by economic grievances including high inflation, a collapsing currency, and declining living standards, escalated into widespread political protests. Iranian authorities responded with a nationwide internet and phone blackout on 8 January 2026, aiming to suppress coordination and limit information flow. Activist groups report over 5,000 deaths, though exact figures remain uncertain due to communication restrictions; the Guardian quoted an Iranian official acknowledging thousands died, blaming 'terrorists and armed rioters.' The Human Rights Activists news agency reported more than 24,000 arrests, with Kurdish regions experiencing the worst violence. The US response intensified after President Donald Trump declared Washington would 'come to their rescue,' urged Iranians to 'take over your institutions,' and warned that any attack on him would result in 'wiping them off the face of this earth.' On 14 January 2026, the US reportedly came close to launching military strikes, but the operation was halted at the last moment due to pressure from regional allies, including Israel’s Prime Minister Benjamin Netanyahu, who warned of unpreparedness for retaliation, and Saudi Crown Prince Mohammed bin Salman, who urged caution. A temporary calm followed, with restored internet access, a halt to executions (though Iran’s chief prosecutor denied mass executions were planned), and reduced public protests, though anti-Khamenei slogans persisted in Tehran, Shiraz, and Isfahan. The pause ended when Trump warned of a 'big flotilla' of US warships approaching Iran, including the USS Abraham Lincoln carrier group, which he described as a 'warning rather than a combat mission.' Iran responded sharply: military spokesperson Abolfazl Shekarchi declared that any aggression against Supreme Leader Ayatollah Ali Khamenei would trigger 'war' and that Iran would 'set fire to their world.' Iran’s Revolutionary Guard stated it has its 'finger on the trigger,' and an Iranian official told Reuters that any attack—limited, surgical, or kinetic—would be considered full-scale war. The US faces uncertain outcomes: limited strikes might embolden protesters and undermine regime confidence, but could also provoke intensified repression. Experts emphasize that Iran’s political future hinges on domestic dynamics, not foreign military intervention. The US carrier group provides strategic leverage, but Iran may respond with calibrated escalation to avoid full war. However, targeting Khamenei would likely trigger an unpredictable and catastrophic conflict.\nOriginal language: en\nPublish date: January 24, 2026 12:51 PM\nSource: [The Sunday Guardian Live](https://sundayguardianlive.com/world/why-us-iran-relations-are-deteriorating-again-after-a-short-lived-calm-166114/)\n\n**After A Short-Lived Pause, US-Iran Tensions Are Flaring Again: What Triggered The Escalation?**\nTensions between the United States and Iran have escalated again following a brief de-escalation, reigniting fears of military conflict. The crisis originated in late December 2025 amid widespread protests in Iran over economic hardship, inflation, and a collapsing currency, which quickly evolved into anti-government demonstrations. Iranian authorities responded with a nationwide internet blackout on 8 January 2026, restricting communication and obscuring the scale of unrest. Activist groups estimate over 5,000 people were killed, while the Human Rights Activists news agency reported more than 24,000 arrests, with particularly violent clashes in Kurdish regions. The situation intensified in early January when U.S. President Donald Trump publicly urged Iranians to 'take over your institutions' and called Supreme Leader Ayatollah Ali Khamenei 'a sick man who should run his country properly,' escalating rhetoric. On 14 January, the U.S. reportedly came close to launching military strikes, but regional pressure from Israel’s Prime Minister Benjamin Netanyahu and Saudi Arabia’s Crown Prince Mohammed bin Salman led to a pause. A brief period of calm followed on 16 January, when Trump claimed Iran halted the execution of 800 protesters—though Iran’s top prosecutor denied this. Partial internet restoration and reduced public demonstrations created the illusion of stabilization. However, tensions flared again after Trump warned that any assassination attempt on him would trigger 'overwhelming retaliation' against Iran, referencing his call for Khamenei’s removal. Iran responded swiftly: Armed forces spokesperson Abolfazl Shekarchi declared that any aggression against Khamenei would lead to 'setting fire to their world.' Trump then announced a 'big flotilla' of U.S. warships, including the USS Abraham Lincoln carrier strike group, moving toward the Persian Gulf, framing it as a 'warning rather than a combat mission.' Iran’s senior officials stated that any attack—limited or unlimited—would be treated as full-scale war, with the Islamic Revolutionary Guard Corps declaring they are 'on high readiness' and have their 'finger on the trigger.' The U.S. now faces several military options: symbolic strikes on nuclear or missile sites, attacks on Iran’s security forces (IRGC, Basij), cyber operations, strikes on economic infrastructure (oil and gas facilities), or the most unpredictable option—assassination-style strikes targeting Khamenei. Analysts caution that while strikes might boost protester morale and expose regime weaknesses, they risk triggering greater repression, as seen in past uprisings. A U.S. strike on Khamenei could cause a power vacuum, given Iran’s lack of consensus on succession, and would almost certainly lead to war. Experts emphasize that Iran’s future will be determined by Iranians, not U.S. military action. Iran is expected to respond to any U.S. move with calibrated, symbolic retaliation to maintain deterrence while avoiding full-scale war—unless Khamenei is targeted, which would mark a decisive shift toward all-out conflict.\nOriginal language: en\nPublish date: January 24, 2026 11:47 AM\nSource: [News18](https://www.news18.com/explainers/after-a-short-lived-pause-us-iran-tensions-are-flaring-again-what-triggered-the-escalation-ws-l-9854123.html)\n\n**Iran and the U.S. at the Brink: Between 'I Won't Strike' and the Roar of Battleships**\nThe article analyzes the escalating tension between the United States and Iran, highlighting a stark contrast between public statements and military actions. While Donald Trump publicly declares 'I will not attack,' U.S. military movements—including the repositioning of aircraft carriers, heightened readiness at bases from the Gulf to the Eastern Mediterranean, and open sea deployments—signal a clear military preparedness. The U.S. does not mobilize for show; such actions reflect a real, if restrained, readiness for military options. Trump’s strategy is framed as one of 'brinkmanship,' using the threat of war to extract concessions without direct conflict. Iran, with its nuclear program and regional influence across Iraq, Syria, Lebanon, and Yemen, is seen as both a strategic target and a destabilizing force. The U.S. military buildup serves not only as a deterrent but also as a strategic umbrella for Israel, which views Iran as an existential threat and seeks opportunities for limited, controlled escalation. Israel, though not seeking a full war, interprets U.S. posture as implicit support, enabling it to act with greater confidence. Iran, aware of U.S. reluctance for war and Israeli pressure, carefully manages its responses—raising tensions when advantageous but avoiding full-scale conflict. However, the risk of miscalculation is high due to multiple actors, overlapping interests, and multiple flashpoints. A minor incident—such as a misinterpreted missile launch or a poorly timed attack—could rapidly escalate into a broader conflict. The region, including the Gulf, Iraq, Syria, Lebanon, and even distant countries like Egypt, remains vulnerable to economic, political, and security fallout. The article concludes that while war is not inevitable, the conditions for conflict are fully in place: an openly hostile adversary, military mobilization, an eager ally, and an already volatile regional environment. What remains uncertain is only the timing—often abrupt and unpredictable in the Middle East. The article emphasizes that in international politics, words are for public consumption, but military movements are the true language of power. Between denial and preparation, the region stands at a precipice, aware of the danger but uncertain of the outcome.\nOriginal language: ar\nPublish date: January 24, 2026 10:14 AM\nSource: [Dostor](https://www.dostor.org/5393133)\n\n**USS Abraham Lincoln's Movement Toward Arabian Sea Sparks Tensions with Iran Amid Escalating Rhetoric and Strategic Uncertainty**\nThe USS Abraham Lincoln, a Nimitz-class aircraft carrier of the U.S. Navy, is moving through the Strait of Malacca and heading toward the Arabian Sea, according to a report by the U.S. Naval Institute. This movement has heightened tensions, as the vessel is entering range of Iran's military strike capabilities. The carrier has turned off its Automatic Identification System (AIS) transponder, a move common in military operations for security but now amplifying uncertainty amid already high U.S.-Iran tensions. Iran has issued a direct warning stating, 'Our finger is on the trigger,' interpreted as a clear military threat. In response, the U.S. has affirmed its military advance in that direction. Former U.S. President Donald Trump has added pressure, warning that if Iran does not agree to a deal, U.S. actions could become even stricter, signaling a 'pressure strategy.' The U.S. Naval Institute notes that while turning off AIS is part of military tactics, the geopolitical context deepens the strategic implications. Analysts question whether this deployment is a show of pressure or a prelude to a major military confrontation, recalling historical precedents where similar moves either led to diplomacy or escalated into war. The world now watches closely to see if this crisis remains confined to warnings or triggers a larger conflict.\nOriginal language: hi\nPublish date: January 23, 2026 08:39 AM\nSource: [OneIndia](https://hindi.oneindia.com/news/international/us-iran-war-conflict-uss-abraham-lincoln-movement-strait-of-hormuz-world-news-hindi-1478453.html)\n\n**Analysts Warn Iran’s Instability Could Trigger Nuclear Proliferation Risks**\nAnalysts warn that internal instability in Iran’s theocratic regime, exacerbated by escalating tensions between the U.S. and Iran following Tehran’s crackdown on protests, could heighten the risk of nuclear proliferation. Although former U.S. President Trump appears to have abandoned military strikes, he still called for ending Supreme Leader Ali Khamenei’s nearly 40-year rule on April 17, 2024. Meanwhile, a U.S. aircraft carrier moved from the South China Sea through Singapore and the Strait of Malacca, positioning itself on a potential route to the Middle East. David Albright, founder of the Washington-based non-profit Institute for Science and International Security and a former Iraqi nuclear inspector, stated that during internal chaos, Iran may lose its ability to protect its nuclear assets. He highlighted the 440.9 kilograms of uranium enriched to 60% purity—close to the 90% threshold for weapons-grade material—as particularly concerning, noting that portions could be stolen. Historical precedent exists: after the Soviet Union’s collapse in 1991, weakened security led to the disappearance of weapons-grade uranium and plutonium. Despite Israel’s 12-day attack and U.S. bombing in June 2024, Iran has maintained control over its nuclear facilities. According to the International Atomic Energy Agency (IAEA), Iran’s 60% enriched uranium stockpile remains unverified since the June 2024 conflict, with IAEA losing continuous monitoring records. An IAEA-affiliated diplomat confirmed the agency has not received updated information on the stockpile’s status or location. Albright noted the material could fit into 18–20 cylindrical containers, each weighing about 50 kg and easily movable by two people. Kelsey Davenport, director of non-proliferation policy at the U.S.-based Arms Control Association, warned that the stockpile could be transferred to secret programs or stolen by factions within Iran’s government or military seeking to retain nuclear weapons options. She emphasized that the risk is real but difficult to assess due to the lack of transparency, especially during periods of internal instability or potential regime collapse, when nuclear materials might be smuggled out or sold to non-state actors.\nOriginal language: zh\nPublish date: January 20, 2026 02:47 AM\nSource: [UDN](https://udn.com/news/story/6809/9276373)\n\n**War, Diplomacy, or Revolution: What Lies Ahead for Iran?**\nFollowing the largest protests in Iran in years, a tense silence has returned to the streets after a wave of violent crackdowns. Residents of Tehran described the atmosphere as eerily calm, resembling the Iranian New Year (Nowruz) holiday, but without any celebration—only a sense of dread. The Iranian regime, weakened by recent conflicts with Israel and the U.S., the loss of regional allies, and internal instability, faces its most serious threat to survival since 1979. Protests, initially sparked by economic grievances, rapidly evolved into mass demands to overthrow the regime, with some calling for the return of Reza Pahlavi, the exiled son of Iran’s last Shah. The crackdown has reportedly killed nearly 3,000 people, according to the U.S.-based Human Rights News Agency (HRANA), though CNN cannot independently verify the figure. The U.S. under Donald Trump has threatened military action if Iran continues violence, but recent reports indicate a pause in killings, possibly due to diplomatic pressure from Gulf states including Qatar, Oman, Saudi Arabia, and Egypt. Despite a temporary de-escalation, analysts warn that the risk of U.S. or Israeli strikes remains. The balance of power has shifted dramatically: Iran’s nuclear facilities were severely damaged in U.S. strikes, and its regional proxies have been neutralized by Israel. While Iran still holds a large stockpile of highly enriched uranium, its military and symbolic strength has been significantly weakened. Experts like Trita Parsi of the Quincy Institute argue that the root causes of tension remain unresolved. Even if diplomacy resumes, Iran enters negotiations from its weakest position ever. The U.S. is expected to demand limits on Iran’s missile program and its support for groups like Hamas and Hezbollah—issues Iran has historically refused to negotiate. Past precedents, such as Iran’s acceptance of a ceasefire after the Iran-Iraq War, suggest that survival may require painful concessions. However, the social contract between the regime and the people is now 'irreparably damaged,' as the state has used brutal force not only against external threats but also against its own citizens. There is no effective domestic opposition, and exiled groups remain divided. Reza Pahlavi has emerged as a potential transitional figure, but his return is controversial and lacks broad support. Analysts warn that regime collapse could lead to state fragmentation due to Iran’s ethnic and regional diversity. Nevertheless, the cycle of protest suggests another wave is inevitable—history shows that the 1979 revolution took a full year of sustained unrest before toppling the Shah.\nOriginal language: ar\nPublish date: January 17, 2026 03:09 AM\nSource: [CNN Arabic](https://arabic.cnn.com/middle-east/article/2026/01/17/war-diplomacy-or-revolt-what-comes-next-in-iran)\n\n**Gulf on edge: Iran warns it will target US military bases if attacked**\nTensions in the Gulf have escalated as Iran has warned Qatar and Saudi Arabia it will target U.S. military bases if attacked, according to Middle East expert Professor Mehran Kamrava of Georgetown University in Qatar. The movement of some U.S. personnel from Al Udeid Air Base in Qatar—described as precautionary by Qatari officials—reflects growing regional fears of direct U.S.-Iran conflict. Kamrava emphasized that Iran’s 'axis of resistance' has collapsed, forcing Tehran to rely on ballistic missiles for retaliation, with no political room to avoid responding if the U.S. strikes. He stated, 'If Iran is hit, they will hit American targets in the region,' and warned that retaliation would be 'much more lethal' than in the past. He cited historical precedents, including the 2020 killing of General Qassem Soleimani and June 2025 strikes on Iranian nuclear facilities, to underscore the consistency of Iranian responses. Additionally, Kamrava noted that protests in Iran—originating from economic hardship and rial collapse—have intensified due to government overreaction and external influence, with widespread anti-government sentiment now prevalent. He stressed that a sober assessment of consequences is essential to prevent further escalation, saying, 'You can't hit Iran and be done with it.'\nOriginal language: en\nPublish date: January 15, 2026 07:17 PM\nSource: [Euronews English](http://www.euronews.com/2026/01/15/iran-warns-qatar-and-saudi-arabia-it-will-strike-us-targets-if-attacked-expert-says)\n\n**Why is Iran erupting again: Economy in free fall, mass unrest**\nNationwide protests in Iran, sparked by the collapse of the rial and a worsening economic crisis with inflation reaching approximately 40%, have led to a deadly government crackdown, internet blackouts, and heightened tensions with the United States. Over 600 protests have occurred across all 31 provinces, according to the US-based Human Rights Activists News Agency, reporting at least 646 deaths and over 10,700 arrests—figures not independently verified due to internet restrictions. The Iranian government has not released official casualty numbers. The economic crisis intensified after the UN reimposed sanctions in September 2023 over Iran’s nuclear program, causing the rial to fall to over 1.4 million to USD 1. Price increases on subsidized gasoline and the end of preferential exchange rates for food products have further strained the population. Protests began in late December 2025 among Tehran merchants and expanded to include anti-government slogans, with some protesters supporting exiled Crown Prince Reza Pahlavi. Iran’s regional 'Axis of Resistance' has weakened significantly: Hamas was defeated in Gaza, Hezbollah’s leadership was decimated, and Syria’s President Bashar Assad was overthrown in December 2024. China continues to buy Iranian oil, but neither China nor Russia has offered overt military support. The West remains concerned about Iran’s nuclear program; although US intelligence assesses Iran has not yet begun weaponization, it has conducted activities that could enable it. Iran recently claimed to have stopped uranium enrichment, signaling openness to negotiations, but no talks have occurred since the June 2025 US-led attack on Iranian nuclear sites. Tensions between Iran and the US stem from historical enmity: the 1979 Islamic Revolution severed diplomatic ties after the hostage crisis, and US actions during the Iran-Iraq War, including the downing of an Iranian airliner, deepened mistrust. Relations briefly improved with the 2015 nuclear deal, but Trump’s 2018 withdrawal reignited conflict, especially after Hamas’ October 7, 2023, attack on Israel. US President Donald Trump has warned that if Iran violently suppresses protesters, the US will intervene, citing the recent capture of Venezuela’s Nicolás Maduro as a precedent.\nOriginal language: en\nPublish date: January 13, 2026 12:00 PM\nSource: [Telangana Today](https://telanganatoday.com/why-is-iran-erupting-again-economy-in-free-fall-mass-unrest)\n\n**Does Donald Trump Have a Justified Reason to Intervene in Iran? A Radio Debate on Military Options and Historical Precedents**\nOn January 9, 2026, protests continued for the eighth day in Tehran, Iran, with police using tear gas to disperse crowds. Speaking aboard Air Force One, Donald Trump reiterated the possibility of U.S. military intervention in Iran, stating, 'If they start killing people again like they did in the past, I think the United States will hit them very hard.' The discussion on Sud Radio analyzed the feasibility of such action, noting that while the U.S. currently has no aircraft carriers in the Persian Gulf, it maintains 11 active carriers and a major air base at Diego Garcia in the Indian Ocean, enabling rapid strike capabilities across the Middle East and Persian Gulf. The conversation addressed historical precedents, such as the failed 1980 U.S. raid on Tabas, which collapsed due to technical failures like sand filters on helicopters. Experts on the show, including Emmanuel and Philippe Bilgeat, debated the likelihood of a ground invasion—considered unlikely due to high risk of casualties—versus a limited, targeted strike aimed at deterring Iran’s nuclear ambitions and sending a message. The discussion framed Trump’s approach as consistent with Republican preferences for swift, surgical military actions over prolonged conflicts, though the segment acknowledged the tragic human cost of ongoing Iranian protests and the regime’s resilience.\nOriginal language: fr\nPublish date: January 09, 2026 05:35 PM\nSource: [Sud Radio](https://www.sudradio.fr/emission/le-premier-debat-des-vraies-voix-857)\n\n**What to know about protests over Iran's economy as nuclear tensions remain high**\nProtests across Iran have spread to over 170 locations in 25 of the country's 31 provinces, according to the U.S.-based Human Rights Activists News Agency, with at least 15 people killed and more than 580 arrested. The demonstrations, initially sparked by economic hardship including a 40% annual inflation rate and the collapse of the rial—now trading at 1.4 million to $1—have evolved into broader anti-government sentiment. The crisis intensified after Israel's 12-day war in June 2024, followed by U.S. airstrikes on Iranian nuclear sites, and the reimposition of UN sanctions in September 2023. Iran's 'Axis of Resistance,' including allies like Hamas, Hezbollah, the Syrian regime under Bashar Assad, and Yemen’s Houthi rebels, has been significantly weakened by regional military actions. The capture of Venezuelan President Nicolás Maduro by U.S. forces has heightened tensions, with former U.S. President Donald Trump threatening military intervention if Iran violently suppresses protesters. Iran has responded by erecting banners in Tehran warning of lethal consequences for U.S. and Israeli troops. Despite Iran’s recent claim that it has halted uranium enrichment, U.S. intelligence maintains that Iran has not yet begun a nuclear weapons program but is conducting activities that would enable it to do so. The IAEA has warned Iran could produce up to 10 nuclear bombs if it chooses. Diplomatic relations between Iran and the U.S., once close under the Shah, have been hostile since the 1979 Islamic Revolution and the subsequent hostage crisis. The 2015 nuclear deal briefly eased tensions, but the U.S. withdrawal under Trump in 2018 reignited conflict, especially after Hamas' October 7, 2023, attack on Israel. The U.S. has also warned that it can project military power globally, citing the Maduro operation as precedent.\nOriginal language: en\nPublish date: January 04, 2026 11:55 PM\nSource: [PBS.org](https://www.pbs.org/newshour/world/what-to-know-about-protests-over-irans-economy-as-nuclear-tensions-remain-high)\n\n**Geopolitical Tensions Escalate: U.S.-China Trade War, Venezuela Regime Change, and Afghanistan-Pakistan Conflict**\nThe article discusses geopolitical tensions involving Ukraine, the United States, China, and other global actors. It highlights that the Nobel Peace Prize was awarded to María Corina Machado, a Venezuelan opposition leader and U.S. Democratic Party ally, rather than Donald Trump, despite Trump's claims of resolving multiple conflicts. The article claims the award serves as a strategic tool for U.S. influence in Venezuela, with support from Republican figures like Marco Rubio, and suggests it signals U.S. readiness for regime change in Venezuela under Nicolás Maduro. Machado’s statements are cited as calling for international support to overthrow Maduro and accusing him of being protected by Cuba and Nicaragua. The article also alleges Machado offered to orchestrate sabotage on Chinese oil platforms in Lake Maracaibo in exchange for $5 million and immunity, potentially serving U.S. interests by provoking conflict with China and justifying intervention. Additional indicators of U.S. escalation include the suspension of U.S.-Venezuela talks, media narratives portraying Maduro as vulnerable, and the U.S. Pentagon’s alleged involvement in planning Ukrainian strikes on Russian energy infrastructure. The article notes that the U.S. may transfer long-range Tomahawk and JASSM missiles to Ukraine, with Germany potentially forwarding them. Meanwhile, trade tensions between the U.S. and China have intensified: the U.S. tightened export controls on semiconductors and high-tech equipment, adding 15 Chinese firms to its blacklist and sanctioning a Chinese oil terminal processing Iranian crude. In response, China expanded export controls on rare earth elements and lithium batteries, citing national security. China’s dominance in rare earth production (70% of global output) is highlighted, with historical precedent in 2010 when it restricted exports to Japan. The article also reports a military escalation between Afghanistan and Pakistan due to attacks by Tehrik-i-Taliban Pakistan (TTP), which is supported by the Taliban in Afghanistan. The TTP’s actions are attributed to long-standing regional instability rooted in Cold War-era U.S.-Pakistani intelligence cooperation. The article suggests that current Pakistani leadership lacks control over the TTP, which opposes the current government and seeks a Greater Pashtunistan, creating a strategic conflict. The article concludes with a description of U.S.-China trade talks ahead of the APEC summit, where both sides have raised stakes through tariffs, sanctions, and countermeasures, including U.S. threats of 100% tariffs on Chinese goods and export controls on critical software. The article also notes the U.S. soybean export crisis to China, with American farmers demanding the return of the Chinese market. Financial markets reacted negatively to Trump’s announcement, with tech stocks and Bitcoin declining. In response, China stopped publishing Microsoft Word documents, switching to the domestic WPS Office. The article frames these developments as a broader economic and strategic confrontation between the U.S. and China, with rare earths and technology as central leverage points.\nOriginal language: ru\nPublish date: October 20, 2025 01:03 AM\nSource: [rossaprimavera.ru](https://rossaprimavera.ru/article/841ea529)\n\n**U.S. Military Buildup in the Caribbean, Dollar Decline, and Escalating Tensions with Iran and Venezuela**\nThe United States has significantly increased its military presence in Puerto Rico and the Caribbean, deploying 8 warships (including the amphibious group USS Iwo Jima with over 4,500 Marines), 10 F-35 stealth fighters, a nuclear attack submarine, P-8 Poseidon surveillance aircraft, and MQ-9 Reaper drones. Officially, the deployment is framed as part of the 'war against drug trafficking,' including lethal attacks on unidentified boats (at least 4 confirmed, resulting in 21 deaths), with former President Trump claiming it aims to stop fentanyl and cocaine flows from Venezuela—a claim dismissed as false by analysts. However, retired Admiral James Stavridis called the scale of the deployment 'excessive' for drug interdiction, suggesting it may be preparation for territorial takeovers, potentially signaling regime change pressure on Venezuela. Venezuelan President Nicolás Maduro has responded by mobilizing 4.5 million militia members, deploying troops along coasts, and sending a letter to Trump calling for dialogue. The U.S. denies invasion plans, claiming the mission is solely against cartels, which analysts argue do not exist. Meanwhile, the U.S. dollar’s share of global reserves fell to 56.3% in Q2 2025—the lowest since 1995—down 1.5 percentage points from the prior quarter, driven by a 10%+ depreciation against major currencies and accelerated diversification by BRICS nations (including new members like Saudi Arabia and Egypt), who are expanding trade in local currencies (yuan, ruble, real), using systems like China’s CIPS and the new BRICS Clear for cross-border payments. This economic weakening has heightened U.S. strategic anxiety ahead of midterm elections, with historical precedent suggesting such crises often trigger military escalation as a political unifier. Regarding conflict, the U.S. has not publicly declared invasion plans for Venezuela, but Pentagon sources indicate 'options for attacks on Venezuelan territory' targeting drug-related sites—potentially including government strongholds like Miraflores and Fuerte Tiuna—raising risks of civilian casualties. Trump has notified Congress that the U.S. is in 'armed conflict' with cartels, granting legal cover, though analysts see this as an escalation toward regime change. The force level (4,500 troops) is insufficient for full-scale invasion. In Iran, tensions remain high due to proxies like Ansarallah in Yemen and Hezbollah in Lebanon. Trump has deployed tankers, combat aircraft, and missiles to Israel, with reports of recent attacks on Iran, but no direct war has been declared. Trump falsely claims to have 'ended 7 wars' (including Israel-Iran), when in reality, only ceasefires were achieved. Simultaneous wars against Iran and Venezuela are considered logistically and politically improbable due to public opposition (polls show rejection of interventions) and the weakened dollar. Russia supports Venezuela with arms and intelligence (e.g., drones and joint exercises in 2024) and Iran with S-400 systems and nuclear cooperation, but is stalled in Ukraine and lacks capacity for two additional fronts. China and Iran also back Maduro economically but avoid military escalation. Putin has warned against 'provocations' in the Caribbean but has made no firm commitments. Overall, the situation is highly volatile: maximum pressure on Venezuela, a weakening dollar, and sustained pressure on Iran, with Russia as a 'wildcard.' A single misdirected missile could ignite conflict across the Western Hemisphere. Trump appears to be playing a high-stakes game of chess (or poker) to force concessions without ground skirmishes. Latin America is at the forefront of Western tensions, and Iran in the Middle East, but diplomacy remains the best hope. Maduro has already extended a peace overture to Trump.\nOriginal language: es\nPublish date: October 04, 2025 10:26 AM\nSource: [Aporrea](https://www.aporrea.org/tiburon/a345373.html)\n\n**Iran and Israel on the Brink: Escalating Tensions Amid Sanctions and Military Posturing**\nIran and Israel face heightened tensions following the reactivation of sanctions mechanisms under the 2015 nuclear deal, with the U.S. re-imposing restrictions on arms trade, uranium enrichment, ballistic missile launches, and global asset freezes, while authorizing international inspections of Iranian aircraft and vessels. Israel, closely monitoring the situation, has raised its military readiness, citing Iran’s advanced ballistic and hypersonic missile capabilities as existential threats. Israeli assessments after the June 2024 12-day conflict indicate Iran’s resilience despite strikes, reinforcing the need for massive investment in missile defense systems like Arrow, Iron Dome, David’s Sling, and the newly deployed U.S. THAAD batteries. Iran, in response, has reaffirmed its readiness to defend against any aggression, citing ongoing upgrades to its military systems and the integration between the regular army and the Revolutionary Guard. Iran’s missile range—up to 2,000 km—covers Israel, and its leadership has signaled willingness to extend missile reach as needed. Iran has also received Russian MiG-29s and is acquiring Sukhoi-35s, while relying on 'ghost ships' to evade sanctions. Experts, including Israeli analyst Omar Mubaraki and U.S. advisor Gabriel Somma, warn of a potential new confrontation, with Israel pursuing a strategy of targeted preemptive strikes and strategic pressure, while the U.S. prioritizes diplomacy and sanctions over military action. The region stands at a critical juncture, with the balance of power shifting amid escalating military posturing and intelligence-driven deterrence. Historical precedents show sanctions and deterrence have limited Iran’s nuclear ambitions but failed to eliminate its military capabilities.\nOriginal language: ar\nPublish date: October 04, 2025 06:30 AM\nSource: [Aljazeera](https://www.aljazeera.net/politics/2025/10/4/%d8%a5%d9%8a%d8%b1%d8%a7%d9%86-%d9%88%d8%a5%d8%b3%d8%b1%d8%a7%d8%a6%d9%8a%d9%84-%d8%b3%d9%8a%d9%86%d8%a7%d8%b1%d9%8a%d9%88%d9%87%d8%a7%d8%aa-%d9%85%d9%88%d8%a7%d8%ac%d9%87%d8%a9)\n\n"
  }
]