[
  {
    "title": "Our bold Grammys 2026 predictions: Who will win vs. who should win",
    "url": "https://www.usatoday.com/story/entertainment/music/2026/01/25/grammys-2026-predictions/88287465007/",
    "snippet": "USA TODAY's Ralphie Aversa analyzes the 2026 Grammy nominations, highlighting a historically diverse slate driven by the addition of 3,800 new voting members in 2025—many young, female, and people of color—leading to fiercer competition. Among the top contenders: Bad Bunny, with six nominations and a likely win for 'DeBÍ TiRAR MáS FOToS' in Album of the Year; Kendrick Lamar, with nine nominations and a strong case for 'GNX' as the best album, though Bad Bunny is predicted to win. In Record of the Year, Lady Gaga's 'Abracadabra' is both predicted to win and considered the rightful winner for its energetic production and lyrical depth. For Song of the Year, 'Golden' by HUNTR/X is predicted to win, but 'Abracadabra' is deemed the better choice for its thematic complexity and artistic merit. In Best New Artist, Alex Warren is predicted to win due to his chart-topping ballad 'Ordinary,' though Olivia Dean is considered the more deserving winner for her soulful, Sade-like artistry and established presence. The article reflects on the impact of demographic shifts in the Recording Academy on nomination outcomes and award predictions."
  },
  {
    "title": "BRIT Awards 2027 Discussion Thread",
    "url": "https://www.goldderby.com/topic/brit-awards-2027-discussion-thread/",
    "snippet": "The GoldDerby discussion thread for the 2027 BRIT Awards has opened, with early predictions based on upcoming album releases and artist momentum. Harry Styles and Raye are considered strong contenders for Album of the Year, Artist of the Year, Song of the Year, and Pop Act, with one likely to win Artist of the Year. Sienna Spiro is predicted as the frontrunner for Breakthrough Artist, following her strong showing in the Grammy thread. Other British artists potentially releasing albums or making an impact in 2026 include Arlo Parks (a possible AOTY or Artist contender depending on project and competition), Charli XCX (likely with a single from the Wuthering Heights soundtrack), Dua Lipa (possibly releasing a lead single if her fourth studio album is delayed), Gorillaz (Best Group contender), Labrinth (new album out in February 2026, critical acclaim expected), Mumford & Sons (Best Group contender), and Stormzy (rumored to be releasing an album this year)."
  },
  {
    "title": "2026 Grammy Awards: Date and Time, How to Stream, Host, and Nominees",
    "url": "https://www.cheatsheet.com/news/2026-grammy-awards-date-time-stream-host-nominees.html/",
    "snippet": "The 68th Annual Grammy Awards will air live on Sunday, February 1, 2026, from the Crypto.com Arena in Los Angeles, starting at 8 p.m. ET / 5 p.m. PT on CBS. The ceremony will stream live for Paramount+ Premium subscribers and be available on-demand the following day for Paramount+ Essential subscribers. Comedian Trevor Noah will host the event for the sixth and final time, with producer Ben Winston praising his 'smart, funny' demeanor and deep appreciation for music. Kendrick Lamar leads the nominations with nine, followed by Lady Gaga, Cirkut, and Jack Antonoff with seven each, and Bad Bunny, Sabrina Carpenter, and Leon Thomas with six each. New categories introduced this year include Best Album Cover and Best Traditional Country Album. Major category nominees include 'DtMF' and 'APT.' in Record of the Year, 'DeBÍ TiRAR MáS FOToS' and 'GNX' in Album of the Year, and 'Abracadabra' and 'APT.' in Song of the Year. Best New Artist nominees are Olivia Dean, KATSEYE, The Marias, Addison Rae, sombr, Leon Thomas, Alex Warren, and Lola Young. Tickets are not available to the general public; only nominees (with optional guest tickets) and Recording Academy members can attend. The article was published on January 24, 2026, by Showbiz Cheat Sheet."
  },
  {
    "title": "Lady Gaga vs. Sabrina Carpenter: How 1 key Grammy category could tip the scales between the pop divas",
    "url": "https://www.goldderby.com/music/2026/pop-vocal-album-grammy-lady-gaga-sabrina-carpenter/",
    "snippet": "The 2026 Grammy Award for Pop Vocal Album is shaping up to be a highly competitive race between Lady Gaga's 'Mayhem' and Sabrina Carpenter's 'Man's Best Friend.' 'Mayhem,' released in early 2025, was critically acclaimed with a Metacritic score of 84, topped the Billboard 200, and featured hit singles 'Disease' and 'Abracadabra,' which earned multiple Grammy nominations. It also bolstered Gaga's comeback narrative and could extend her record for most Pop field wins (ninth), second only to Tony Bennett. However, 'Mayhem' faced potential drawbacks, including the inclusion of the Grammy-winning single 'Die With a Smile' with Bruno Mars, which may lead voters to feel the album has already been recognized. Meanwhile, 'Man's Best Friend,' the follow-up to Carpenter’s Grammy-winning 'Short n' Sweet,' debuted at number one with the highest first-week sales of the year for a female artist (later surpassed by Taylor Swift), and produced hits 'Manchild' and 'Tears.' Though it received a more mixed critical reception (Metacritic score: 75), it gained momentum with Carpenter’s visibility, including a prime Saturday Night Live hosting slot. However, winning back-to-back Pop Vocal Album awards is exceptionally rare—only Taylor Swift, Adele, and Kelly Clarkson have done so—and 'Man's Best Friend' has not matched the critical or sales heights of its predecessor. GoldDerby odds suggest the race is one of the most uncertain in recent memory, with both albums having strong pros and cons, making the outcome highly unpredictable ahead of the February 1, 2026, ceremony."
  },
  {
    "title": "Country artists hope to follow idols at Golden Guitars",
    "url": "https://startsat60.com/media/country-artists-hope-to-follow-idols-at-golden-guitars",
    "snippet": "Country music artist Adam Brand, who has won three Golden Guitars including Album of the Year in 2023, reflected on his early inspiration from watching the awards as a child, recalling how Troy Cassar-Daley, a legendary winner, personally congratulated him after his first win. Brand will co-host the 2026 Golden Guitars ceremony in Tamworth, which marks the culmination of the 10-day Tamworth Country Music Festival, featuring events like dancing, busking, and whip cracking. Young nominee Lane Pittman, who won his first Golden Guitar while touring with Luke Combs, was congratulated by Cassar-Daley via his mother, who relayed the message: 'make sure you tell Lane that I said congratulations, the first one is always the big one.' Kasey Chambers leads the 2026 nominations with 13, followed by Shane Nicholson and The Wolfe Brothers with eight each. Sara Storer, a 22-time winner, received four nominations this year and expressed continued excitement about the event, stating she appreciates the new talent and enjoys the celebration, 'to get to dress up - and you're always in for a chance.' The 2026 Country Music Awards of Australia will be held in Tamworth on Saturday."
  },
  {
    "title": "Kendrick Lamar, Lady Gaga, K-pop and more: Who will win at the 2026 Grammys?",
    "url": "https://www.sgvtribune.com/2026/01/23/grammy-predictions/",
    "snippet": "The 2026 Grammy Awards, set for February 1 at Crypto.com Arena in Los Angeles and broadcast on CBS and Paramount+, feature a highly competitive lineup. Kendrick Lamar leads with nine nominations, followed by Lady Gaga, Jack Antonoff, and Cirkut with seven each. Sabrina Carpenter, Bad Bunny, Leon Thomas, and Serban Ghenea each have six. In Album of the Year, 'GNX' by Kendrick Lamar is seen as a strong contender due to its cultural saturation, sustained engagement, and integration across music, sports, and everyday language, though 'Debí Tirar Más Fotos' by Bad Bunny and 'Mayhem' by Lady Gaga are also strong narrative and artistic choices. For Record of the Year, 'APT.' by Rosé and Bruno Mars is favored for its universal appeal, cross-generational resonance, and global reach, potentially making Rosé the first K-pop artist to win in this category. In Song of the Year, 'Abracadabra' by Lady Gaga is highlighted for its lyrical precision and intentional construction, with a strong chance of victory despite competition from Billie Eilish and Bruno Mars. Best New Artist is a tight race between Leon Thomas, who stands out for his cohesive body of work, and Olivia Dean, whose name has been most frequently mentioned. In Best Pop Duo/Group Performance, 'APT.' is a leading contender due to the balance and cohesion between Rosé and Bruno Mars, though 'Golden' by HUNTR/X: EJAE, Audrey Nuna, REI AMI is also a strong nominee. 'GNX' is considered the clear favorite for Best Rap Album, with strong arguments for its cohesion and cultural dominance. For Best Contemporary Country Album, Jelly Roll’s 'Beautifully Broken' is predicted to win due to its genre-fluid storytelling and emotional authenticity, aligning with the category’s new focus. 'Mutt' by Leon Thomas is the top pick for Best R&B Album, praised for its restraint and songwriting depth. In Best Dance/Electronic Album, Skrillex’s 'F -- U Skrillex You Think Ur Andy Warhol but UR Not! 3' is favored for its balance of innovation and structure. Finally, in Best Latin Pop Album, Karol G’s 'Tropicoqueta' is seen as a forward-moving, culturally specific project with strong potential, though Natalia Lafourcade and Alejandro Sanz remain strong contenders. The Associated Press’ Maria Sherman and Jonathan Landrum Jr. provide in-depth analysis of each category, emphasizing cultural relevance, artistic cohesion, and historical significance."
  },
  {
    "title": "Grammys 2026: Bad Bunny and K-Pop Poised to Break Records",
    "url": "https://www.covers.com/entertainment/grammy-predictions-records",
    "snippet": "The 68th Annual Grammy Awards, scheduled for February 1, 2026, are poised to break multiple records, according to prediction markets and expert analysis. HUNTR/X, the fictional K-pop group from the Netflix series *K-Pop Demon Hunters*, is the frontrunner to win the first-ever Grammy for a K-pop act, with a 68% win probability on Kalshi, fueled by the viral success of their anthem 'Golden' and its Golden Globe victory. Kelsey Barnes of Schön! Magazine and grammy.com describes a K-pop win as 'symbolic and transformative,' emphasizing the genre's deep cultural roots and artistic complexity, which have long been underrecognized by the Grammys. Bad Bunny's Spanish-language album *Debí Tirar Más Fotos* is also on track for history, with a 61% implied probability of winning Best Album—making it the first exclusively Spanish-language project nominated across Album, Record, and Song of the Year simultaneously. Barnes notes this would signify a shift in the Academy’s recognition of global music, affirming that 'pop is global' and transcends language barriers. Olivia Dean, a rising British soul artist, is favored to become the fourth British female soloist to win Best New Artist, with a 70% win probability, following in the footsteps of Amy Winehouse, Adele, and Dua Lipa. Alexander McCloy attributes her success to her authentic 'Artistic DNA' and strategic international exposure, including opening for Sabrina Carpenter. Bruno Mars is on the verge of matching Lady Gaga’s record of three wins in the Best Pop Duo/Group category, with a potential victory for 'APT.' with ROSÉ. Barnes highlights Mars’ consistent, comforting artistry as a key factor in his enduring appeal, noting that his predictability offers stability in uncertain times."
  },
  {
    "title": "Two legends -- a drummer and a rapper -- unite for unexpected musical journey",
    "url": "https://www.masslive.com/entertainment/2026/01/two-legends-a-drummer-and-a-rapper-unite-for-unexpected-musical-journey.html",
    "snippet": "John Densmore, Rock and Roll Hall of Fame drummer of The Doors, and Chuck D, founder of Public Enemy and Rock and Roll Hall of Fame inductee, have formed a new musical supergroup called doPE, blending their legacies. Their debut album, 'no country for old men,' will be released on April 18, 2026, exclusively as a limited-edition oxblood transparent vinyl through participating local record shops for Record Store Day. The lead single, 'every tick tick tick,' has been named Record Store Day's 2026 Song of the Year in advance of its release. The collaboration began with a chance meeting at a Record Store Day panel in 2014, followed by a direct email from Chuck D in 2015 proposing the project with the phrase: 'You've got the beats, I've got the rhymes, let's make doPE.' Over the next decade, the duo developed the album around the philosophical concept: 'Everybody gets older, but not everybody gets elder,' as reported by Stereogum. Chuck D, 65, described the project as a bridge between generations, stating, 'John Densmore's beat isn't just rhythm, it's history talking,' while Densmore, 81 and a Grammy Lifetime Achievement Award winner, called the collaboration 'an honor.' The album is characterized as a 'meditation on responsibility, legacy and the bond between generations,' according to American Songwriter."
  },
  {
    "title": "Everything to Know About the 2026 Grammy Awards",
    "url": "https://www.harpersbazaar.com/culture/art-books-music/a70078974/grammy-awards-2026-news-details/",
    "snippet": "The 68th annual Grammy Awards will be held on Sunday, February 1, 2026, at the Crypto.com Arena in Los Angeles. Kendrick Lamar leads all nominees with nine nominations, including Album of the Year. Lady Gaga, Cirkut, and Jack Antonoff each have seven nominations, while Bad Bunny, Leon Thomas, and Sabrina Carpenter each have six. The 2026 Grammys introduce two new categories: Best Album Cover and a split of Best Country Album into Best Traditional Country Album and Best Contemporary Country Album. This year also features 10 nomination slots for Record of the Year, Album of the Year, Song of the Year, and Best New Artist. Winners will be selected by approximately 3,800 voters, the most diverse pool in Recording Academy history. Scheduled performers include Sabrina Carpenter, Katseye, Olivia Dean, Addison Rae, Lola Young, and The Marías. The show can be watched live at home via broadcast or streaming platforms. Published: January 21, 2026, Source: harpersbazaar.com."
  },
  {
    "title": "2026 Grammys: Kendrick Lamar leads nominations, followed by Lady Gaga, Jack Antonoff, Cirkut",
    "url": "https://wcfcourier.com/life-entertainment/nation-world/music/article_b38b4780-7000-5130-9906-da7b2a01a947.html",
    "snippet": "Kendrick Lamar leads the 2026 Grammy Award nominations with 11 total nominations, including three in the top categories: Best New Artist, Best Music Video, and Best Rap Album. He is followed by Lady Gaga, Jack Antonoff, and Cirkut, each with 7 nominations. Lamar's nominations include Best Rap Album for 'v')', Best Rap Performance for 'Luther', and Best Music Video for 'Savior'. Lady Gaga has 7 nominations across Best Pop Vocal Album, Best Pop Solo Performance, Best Pop Duo/Group Performance, Best Dance Recording, Best Traditional Pop Vocal Album, Best Music Video, and Best Song Written for Visual Media. Jack Antonoff and Cirkut each have 7 nominations, primarily in production and songwriting roles. Notably, Kendrick Lamar's 'v')' is the first rap album to win in the Best New Artist category since 2017. The 2026 Grammys will be held on February 1, 2026, and the final round of voting runs from December 1 to January 4. The article cites the WCFCourier.com as the source, with the article published on November 7, 2025."
  }
]