[
  {
    "title": "Iran–United States relations - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Iran%E2%80%93United_States_relations",
    "snippet": "Since 1995, the United States has had an embargo on trade with Iran. In 2015, the United States led successful negotiations for a nuclear deal (the Joint ..."
  },
  {
    "title": "History of US-Iran relations: From the 1953 regime change to Trump ...",
    "url": "https://www.aljazeera.com/news/2025/6/23/history-of-us-iran-relations-from-the-1953-regime-change-to-trump-strikes",
    "snippet": "On Sunday, the US directly hit Iran in what the Trump administration called a highly sophisticated covert attack that involved more than 125 US ..."
  },
  {
    "title": "Iran's Conflict With Israel and the United States",
    "url": "https://www.cfr.org/global-conflict-tracker/conflict/confrontation-between-united-states-and-iran",
    "snippet": "Following a week of air strikes between Israel and Iran, the United States directly intervened in the conflict, attacking three Iranian nuclear ..."
  },
  {
    "title": "US-Iran Relations: A Complex History of Conflict and Change",
    "url": "https://www.amu.apus.edu/area-of-study/legal-studies/resources/us-iran-relations/",
    "snippet": "The U.S. has a complex relationship with Iran, rooted in events like the 1953 coup that overthrew Iran's democratically elected Prime Minister, ..."
  },
  {
    "title": "Iranian Regime's War on America: Four Decades of Targeting U.S. ...",
    "url": "https://www.ajc.org/news/iranian-regimes-war-on-america-four-decades-of-targeting-us-forces-and-citizens",
    "snippet": "The Iranian regime's anti-American campaign began with the 1979 seizure of the U.S. Embassy in Tehran, where 52 Americans were held hostage for ..."
  },
  {
    "title": "History of US-Iran Relations – AHA - American Historical Association",
    "url": "https://www.historians.org/resource/history-of-us-iran-relations/",
    "snippet": "Coercion: US officials have used hostile action like economic sanctions or military force to compel Iran's leaders to undertake substantial change, and also ..."
  },
  {
    "title": "The History of U.S.-Iranian Irregular Warfare",
    "url": "https://irregularwarfare.org/articles/us-iranian-irregular-warfare-history/",
    "snippet": "Explore the history of U.S.-Iranian irregular warfare, from the 1953 coup to modern proxy wars, cyberattacks, and ongoing regional ..."
  },
  {
    "title": "A look back at the history of the tension between the U.S. and Iran",
    "url": "https://abc11.com/post/look-back-history-tension-between-us-iran-decades-ago-allies/16838318/",
    "snippet": "In January of 2020, a U.S. airstrike took out Qassem Soleimani, who was the leader of Iran's elite Quds Force. This action prompted the Iranian ..."
  },
  {
    "title": "Iranian and Iranian-Backed Attacks Against Americans (1979-Present)",
    "url": "https://www.fdd.org/analysis/2025/06/19/iranian-and-iranian-backed-attacks-against-americans-1979-present/",
    "snippet": "Since the 1979 Islamic Revolution, the clerical regime in Tehran and its proxies have committed a range of attacks against Americans."
  },
  {
    "title": "Iran: Background and U.S. Policy - Congress.gov",
    "url": "https://www.congress.gov/crs-product/R47321",
    "snippet": "The United States and various U.S. partners sought to deter and respond to these attacks, including via military action. Iran directly attacked Israel on two ..."
  },
  {
    "title": "Iranian official rhetoric girds for war as US fleet nears",
    "url": "https://www.iranintl.com/en/202601235052",
    "snippet": "Tehran's increasingly combative official statements suggest its leaders may be taking US military deployments more seriously than ..."
  },
  {
    "title": "Trump says US 'armada' heading toward Iran - Reuters",
    "url": "https://www.reuters.com/world/middle-east/us-military-assets-heading-middle-east-even-trump-backs-off-toughest-iran-2026-01-22/",
    "snippet": "The warships started moving from the Asia-Pacific last week as tensions between Iran and the United States soared following a severe crackdown ..."
  },
  {
    "title": "Iran's DEADLY Night Attack on US Bases SOON? BIG Missiles Roll ...",
    "url": "https://www.youtube.com/watch?v=EzT0gitZBEI",
    "snippet": "Missiles and drones are on the move in Iran… and the U.S. is not staying on the sidelines. Tensions in the Middle East are at a breaking ..."
  },
  {
    "title": "Trump's \"Big Force\": US Armada Moving Towards Iran | Firstpost Live",
    "url": "https://www.youtube.com/watch?v=C74OXsiEMv4",
    "snippet": "US President Donald Trump has said that Washington has an “armada” headed toward Iran, renewing warnings to Tehran over the killing of ..."
  },
  {
    "title": "Toll in Iran's protest crackdown reaches at least 5,002 dead as ...",
    "url": "https://abcnews.go.com/Business/wireStory/toll-irans-protest-crackdown-reaches-5002-dead-trump-129476717",
    "snippet": "Toll in Iran's protest crackdown reaches at least 5,002 dead as Trump says US 'armada' approaching · Popular Reads · Minneapolis ICE shooting live ..."
  },
  {
    "title": "Trump's Tough Talk Meets Khamenei's Fierce Retaliation Threat",
    "url": "https://www.youtube.com/watch?v=bca-36h3CT8",
    "snippet": "Iran's Foreign Minister Abbas Araghchi issues a chilling threat to the U.S., vowing full retaliation against any American attack."
  },
  {
    "title": "Trump says US 'armada' moving towards Iran - Middle East Eye",
    "url": "https://www.middleeasteye.net/news/trump-says-us-armada-moving-towards-iran-amid-renewed-threats",
    "snippet": "US President Donald Trump said on Thursday that he is sending an “armada” towards Iran, threatening Tehran against resuming its nuclear ..."
  },
  {
    "title": "A US military aircraft carrier strike group and other assets will arrive ...",
    "url": "https://www.instagram.com/reel/DT1sjWBitfe/",
    "snippet": "This comes after he reportedly rejected similar strike plans just last week. The renewed discussion shows rising tension between the U.S. and ..."
  },
  {
    "title": "Iran's Conflict With Israel and the United States",
    "url": "https://www.cfr.org/global-conflict-tracker/conflict/confrontation-between-united-states-and-iran",
    "snippet": "A senior Iranian official said Tehran would strike U.S. military bases in the Middle East if Trump were to intervene in Iran (Reuters). Trump ..."
  },
  {
    "title": "U.S vs Iran War BREAKING: Trump's F-15 Jets Reach ... - YouTube",
    "url": "https://www.youtube.com/watch?v=9hjFCBR9kYw",
    "snippet": "U.S. military movements around Iran are intensifying, raising fresh fears of escalation. An American C-37B aircraft has flown to Ashgabat, ..."
  },
  {
    "title": "How Will the Trump Administration Respond to Violent Protests in ...",
    "url": "https://www.csis.org/analysis/how-will-trump-administration-respond-violent-protests-iran",
    "snippet": "A broader attack targeting the security forces suppressing demonstrations would have to involve city centers and risk civilian casualties, which ..."
  },
  {
    "title": "Here is another interesting analysis by an expert.",
    "url": "https://x.com/milanimohsen/status/2014760978689241500",
    "snippet": "Ironically a war now would hand Tehran a chance to strike US forces ... It is about claiming he ended 47 years of US-Iran hostility."
  },
  {
    "title": "Trump's Move to Send US Ships to Mideast Renews Iran Threat",
    "url": "https://business.financialpost.com/pmn/business-pmn/trumps-move-to-send-us-ships-to-mideast-renews-iran-threat",
    "snippet": "Experts say ... Geopolitical risk firm Rapidan Energy Group maintains 70% odds that the US will strike Iran in the coming days and weeks."
  },
  {
    "title": "Assessing the Effect of the U.S. Strikes on Iran",
    "url": "https://www.cfr.org/articles/assessing-effect-us-strikes-iran",
    "snippet": "The attack—President Donald Trump's boldest use of military force to date—was designed to stunt if not destroy Iran's nuclear program and bring ..."
  },
  {
    "title": "US-Iran tensions: Trump has no path to an easy 'win' despite ...",
    "url": "https://www.aljazeera.com/news/2026/1/17/us-iran-tensions-trump-has-no-path-to-an-easy-win-despite-tehrans-woes",
    "snippet": "Iran is likely to meaningfully retaliate against any attack against its central government, unlike its largely symbolic response to the US ..."
  },
  {
    "title": "Gulf states fear US attack on Iran spoils chance at 'concessions' from ...",
    "url": "https://www.middleeasteye.net/news/gulf-states-fear-us-attack-iran-could-spoil-their-chance-concessions-weak-islamic-republic",
    "snippet": "They believe that if US President Donald Trump attacks Iran, he could spoil a new equilibrium that may allow them to obtain quiet concessions ..."
  },
  {
    "title": "National Terrorism Advisory System Bulletin - June 22, 2025",
    "url": "https://www.dhs.gov/ntas/advisory/national-terrorism-advisory-system-bulletin-june-22-2025",
    "snippet": "Low-level cyber attacks against US networks by pro-Iranian hacktivists are likely, and cyber actors affiliated with the Iranian government may ..."
  },
  {
    "title": "Washington holds back: Calculated pressure, not war, shapes US ...",
    "url": "https://shafaq.com/en/Report/Washington-holds-back-Calculated-pressure-not-war-shapes-US-policy-toward-Iran",
    "snippet": "In his view, the true deterrent is not Iran's military capabilities, but uncertainty over what follows a strike. While his assessment frames US ..."
  },
  {
    "title": "Iranian official rhetoric girds for war as US fleet nears",
    "url": "https://www.iranintl.com/en/202601235052",
    "snippet": "Another senior commander, Ali Abdollahi, warned that any attack on Iran's territory or interests would turn US interests, bases, and centers of ..."
  },
  {
    "title": "8 Experts on What Happens If the United States Bombs Iran - Politico",
    "url": "https://www.politico.com/news/magazine/2025/06/18/us-attacks-iran-expert-predictions-analysis-00413901",
    "snippet": "If the US attacks directly, Iran will have two broad choices: (1) return to negotiations prepared to concede retaining any enrichment capability, or (2) ..."
  }
]