[
  {
    "title": "Israel-Hamas War (Gaza Conflict) | Explanation, Summary, Ceasefire, Casualties, & Map",
    "url": "https://www.britannica.com/event/Israel-Hamas-War",
    "snippet": "The Israel-Hamas War is the war between Israel and Palestinian militants, especially Hamas, that began on October 7, 2023, when Hamas..."
  },
  {
    "title": "The Israel-Hamas war's devastating human toll after 2 years, by the numbers",
    "url": "https://abcnews.go.com/International/israel-hamas-wars-devastating-human-toll-after-2/story?id=126252242",
    "snippet": "Tuesday marks two years since the Israel-Hamas war began, bringing devastation across the region."
  },
  {
    "title": "Updates: Israel, Iran continue missile attacks; 144 killed in Gaza",
    "url": "https://www.aljazeera.com/news/liveblog/2025/6/18/live-israel-iran-attacks-continue-trump-demands-unconditional-surrender",
    "snippet": "Iran's supreme leader airs televised comments as Israel claims to hit 40 sites in Iran today alone."
  },
  {
    "title": "Arab-Israeli wars | History, Conflict, Causes, List, Summary, & Facts",
    "url": "https://www.britannica.com/event/Arab-Israeli-wars",
    "snippet": "Arab-Israeli wars are a series of military conflicts between Israeli forces and various Arab forces, most notably in 1948–49, 1956, 1967,..."
  },
  {
    "title": "As Israel turns its focus to Iran, the death toll mounts in Gaza — and hunger deepens",
    "url": "https://www.npr.org/2025/06/17/g-s1-73175/gaza-hunger-aid-attacks-israel",
    "snippet": "Palestinians say Israeli forces killed scores of people trying to reach food aid in Khan Younis on Tuesday in the deadliest attack of recent..."
  },
  {
    "title": "Iran missiles cause multiple casualties after strikes in Israel",
    "url": "https://www.bbc.com/news/live/c93ydeqyq71t",
    "snippet": "Israel Defense Forces say seven unmanned aerial vehicles (UAVs) have been launched toward Israeli territory in the past hour."
  },
  {
    "title": "Updates: Israel military launches wave of strikes on Gaza killing 24",
    "url": "https://www.aljazeera.com/news/liveblog/2025/11/22/live-israel-3",
    "snippet": "Children among the dead and wounded as Israeli army launches drone-and-missile strikes on civilian areas in Gaza."
  },
  {
    "title": "Updates: Iran says it launched drone, missile attack targeting Israel",
    "url": "https://www.aljazeera.com/news/liveblog/2025/6/15/updates-death-toll-grows-as-iran-and-israel-continue-to-trade-attacks",
    "snippet": "Iranian state TV is reporting that a new wave of drone and missile attack has begun, targeting Tel Aviv and Haifa. Earlier, Israel bombed..."
  },
  {
    "title": "October 7 attack | Israel, Gaza, Deaths, & Hostages",
    "url": "https://www.britannica.com/event/October-7-attack",
    "snippet": "The October 7 attack was an assault led by Hamas against Israel that killed about 1200 people. More than 240 people were taken hostage,..."
  },
  {
    "title": "Visualising 12 days of the Israel-Iran conflict",
    "url": "https://www.aljazeera.com/news/2025/6/26/visualising-12-days-of-the-israel-iran-conflict",
    "snippet": "At least 610 Iranians were killed in Israeli attacks, while 28 people in Israel were killed in Iranian counterattacks."
  },
  {
    "title": "Iran Unveils Legal Complaint Against the U.S. and Israel in Response to Recent Attacks",
    "url": "https://wanaen.com/iran-unveils-legal-complaint-against-the-u-s-and-israel-in-response-to-recent-attacks/",
    "snippet": "WANA (Jan 25) – This morning, on Sunday, January 25, 2026, a legal complaint was unveiled against the governments of the United States and..."
  },
  {
    "title": "Iran’s Conflict With Israel and the United States | Global Conflict Tracker",
    "url": "https://www.cfr.org/global-conflict-tracker/conflict/confrontation-between-united-states-and-iran",
    "snippet": "Conflict Between Israel and IranThe outbreak of war between Israel, a close U.S. ally, and the Palestinian Iran-backed militant group Hamas..."
  },
  {
    "title": "Iran protests updates: Tehran says will hit back at US, Israel if attacked",
    "url": "https://www.aljazeera.com/news/liveblog/2026/1/11/iran-protests-live-tehran-says-it-will-hit-back-at-us-israel-if-attacked",
    "snippet": "Iranian president calls for unity as protests triggered by an economic crisis escalate into the worst unrest in years."
  },
  {
    "title": "Israel Watches Iran Protests Closely, but Is Wary of Intervening",
    "url": "https://www.nytimes.com/2026/01/15/world/middleeast/israel-iran-protests-netanyahu.html",
    "snippet": "Israel is unlikely to do much to try to precipitate a regime change in Iran, seeing the government as far from the brink of collapse and the..."
  },
  {
    "title": "Death toll from protests in Iran hits at least 544, activists say, as Trump says Iran wants to talk",
    "url": "https://abcnews.go.com/International/wireStory/death-toll-2-week-protests-challenging-irans-theocracy-129098403",
    "snippet": "President Donald Trump says Iran reached out to the U.S. and proposed negotiations after he threatened action in response to a crackdown on..."
  },
  {
    "title": "Israel nearly struck Iran twice in recent weeks, former IDF intelligence chief claims",
    "url": "https://www.jpost.com/israel-news/article-883070",
    "snippet": "Recent near-escalations were the result of miscalculation risks, which in turn strengthened military cooperation between US and Israel,..."
  },
  {
    "title": "Live updates: Two-year anniversary of Israel attack by Hamas falls during Gaza truce negotiations",
    "url": "https://www.nbcnews.com/world/middle-east/live-blog/hamas-attack-anniversary-israel-war-gaza-conflict-live-updates-rcna235225",
    "snippet": "Early on Oct. 7, 2023, Hamas-led fighters launched a multipronged terrorist attack on Israel. The resulting war in Gaza has created a..."
  },
  {
    "title": "5 things you need to know about what’s happening in Israel and Gaza",
    "url": "https://afsc.org/news/5-things-you-need-know-about-whats-happening-israel-and-gaza",
    "snippet": "Since October 2023, the Israeli government has killed tens of thousands of Palestinians in its genocide on Gaza. The majority of Gaza's over..."
  },
  {
    "title": "What is Hamas and why is it fighting with Israel in Gaza?",
    "url": "https://www.bbc.com/news/articles/clyv7w3gdy2o",
    "snippet": "Hamas attacked Israel on 7 October 2023, killing about 1200 people and taking 251 hostages."
  },
  {
    "title": "All the countries Israel attacked in 2025: Animated map",
    "url": "https://www.aljazeera.com/news/longform/2025/12/29/all-the-countries-israel-attacked-in-2025-animated-map",
    "snippet": "In 2025, Israel attacked at least six countries, including Palestine, Iran, Lebanon, Qatar, Syria, and Yemen. It also carried out strikes in..."
  }
]