[
  {
    "title": "Israel news, updates on the war with Hamas - CNN",
    "url": "https://www.cnn.com/world/middleeast/israel",
    "snippet": "View the latest news and videos, including politics and breaking news headlines on the Israel-Hamas war."
  },
  {
    "title": "Israel Gaza war | Latest News & Updates - BBC",
    "url": "https://www.bbc.com/news/topics/c2vdnvdg6xxt",
    "snippet": "Israeli strike in Gaza kills three journalists, first responders say. Another eight Palestinians were killed by Israeli artillery and gunfire ..."
  },
  {
    "title": "Israeli drone strike kills two children collecting firewood in Gaza",
    "url": "https://www.aljazeera.com/news/2026/1/24/israeli-drone-strike-kills-two-children-collecting-firewood-in-gaza",
    "snippet": "Israeli attacks killed 71,654 people and wounded 171,391 others in Gaza since October 7, 2023, the ministry says. In a related development on ..."
  },
  {
    "title": "The Times of Israel | News from Israel, the Middle East and the ...",
    "url": "https://www.timesofisrael.com/",
    "snippet": "-37654sec ago · 86 arrested after breach of London prison grounds for pro-Palestinian hunger striker · -33956sec ago · Israeli forces nab 2 Bedouin Israelis ..."
  },
  {
    "title": "Iran Warns US and Israel Against Any Attack, Warns Its Forces Have ...",
    "url": "https://www.youtube.com/watch?v=re8U738iYFQ",
    "snippet": "Iran's Revolutionary Guard commander warns the United States and Israel against “miscalculations,” saying its forces now have their “finger ..."
  },
  {
    "title": "Israel Issues Evacuation Warnings as Border Activity Intensifies With ...",
    "url": "https://www.youtube.com/watch?v=74eXPmvNDdc",
    "snippet": "Israel Issues Evacuation Warnings as Border Activity Intensifies With Lebanon | WION News ... Russia-Ukraine War LIVE: Russian Attacks ..."
  },
  {
    "title": "Top Headlines on Israel and Hamas at war | Reuters",
    "url": "https://www.reuters.com/world/israel-hamas/",
    "snippet": "Israeli fire killed 11 Palestinians including two boys and three journalists in separate incidents in Gaza on Wednesday, local medics said, ..."
  },
  {
    "title": "Israel-Hamas war | Breaking News & Live Updates - AP News",
    "url": "https://apnews.com/hub/israel-hamas-war",
    "snippet": "Get the latest developments as the war between Israel and Hamas unfolds."
  },
  {
    "title": "IDF Troops Storm Into Hamas Tunnel, Then Find This ... - YouTube",
    "url": "https://www.youtube.com/watch?v=aUdVK7DLdAI",
    "snippet": "... israel news,yahalom unit,terrorists killed ... We provide much more than the Get Breaking news, the Latest news, Politics news, of the day."
  },
  {
    "title": "How the “Experts” Lost Credibility: 10 Predictions About Israel's War ...",
    "url": "https://honestreporting.com/how-the-experts-lost-credibility-10-predictions-about-israels-war-that-fell-apart/",
    "snippet": "... Israel would lose 20 soldiers a day. His projection – over 14,000 fatalities – proved vastly exaggerated. The 918 IDF soldiers killed remain ..."
  },
  {
    "title": "More experts say Israel's offensive in Gaza constitutes genocide - PBS",
    "url": "https://www.pbs.org/newshour/world/more-experts-say-israels-offensive-in-gaza-constitutes-genocide",
    "snippet": "In that attack, Hamas-led militants killed some 1,200 people, mostly civilians, and abducted 251. Forty-eight hostages remain in Gaza, around 20 ..."
  },
  {
    "title": "Gaza war death toll could be significantly higher, researchers say",
    "url": "https://www.bbc.com/news/articles/cqjvl4klzweo",
    "snippet": "It estimated that up until 30 June 2024, 64,260 Palestinians died from traumatic injury, meaning an under-reporting of deaths by 41%. The ..."
  },
  {
    "title": "\"Excess deaths' in Gaza projected for next 6 months — a ... - NPR",
    "url": "https://www.npr.org/sections/goatsandsoda/2024/03/01/1234993226/deaths-gaza-hamas-israel-war-projection",
    "snippet": "Given those assumptions, the researchers project that an additional 3,250 people will die from traumatic injuries after fighting stops. The rest ..."
  },
  {
    "title": "Why researchers fear the Gaza death toll could ... - The Guardian",
    "url": "https://www.theguardian.com/world/article/2024/jul/12/gaza-death-toll-indirect-casualties",
    "snippet": "A letter published in the medical journal the Lancet claims that the final figure could eventually be about 186,000. Written by scientists who ..."
  },
  {
    "title": "Israel–Hamas war forecasting: Israel's simmering conflict with ...",
    "url": "https://www.swiftcentre.org/publicforecasts/israel-hamas-forecast-update",
    "snippet": "In their most recent forecasts, the forecasters believe there is a 69% chance of 500+ Israel–Hezbollah fatalities over the course of 7 October 2023 – 13 April ..."
  },
  {
    "title": "Israeli military campaign in Gaza among deadliest in history, experts ...",
    "url": "https://apnews.com/article/israel-gaza-bombs-destruction-death-toll-scope-419488c511f83c85baea22458472a796",
    "snippet": "JERUSALEM (AP) — The Israeli military campaign in Gaza, experts say, now sits among the deadliest and most destructive in recent history."
  },
  {
    "title": "The human toll of Israel's war on Gaza – by the numbers - Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/1/15/the-human-toll-of-israels-war-on-gaza-by-the-numbers",
    "snippet": "More than 1,100 people were killed in the attacks, and about 240 were taken captive. ... Israel's attacks across Gaza have not slowed ..."
  },
  {
    "title": "Gaza: Why the War Won't End - CSIS",
    "url": "https://www.csis.org/analysis/gaza-why-war-wont-end",
    "snippet": "The end result was a tactical success by Hamas that produced large Israeli civilian and military casualties ... attack on Israel. At the same time ..."
  },
  {
    "title": "Israel committing genocide in Gaza, world's leading experts say - BBC",
    "url": "https://www.bbc.com/news/articles/cde3eyzdr63o",
    "snippet": "On Monday, the Hamas-run Ministry of Health said that 63,557 people had been killed and 160,660 injured during the war so far. The ministry's ..."
  }
]