[
  {
    "title": "Iran–United States relations - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Iran%E2%80%93United_States_relations",
    "snippet": "In the 1970s, approximately 25,000 American technicians were deployed to Iran to maintain military equipment (such as F-14s) that had been sold to the Shah's ..."
  },
  {
    "title": "Iran's Conflict With Israel and the United States",
    "url": "https://www.cfr.org/global-conflict-tracker/conflict/confrontation-between-united-states-and-iran",
    "snippet": "Iran retaliated on June 23, launching a missile attack on U.S. forces stationed at the Al Udeid Air Base in Qatar; no casualties were reported."
  },
  {
    "title": "History of US-Iran relations: From the 1953 regime change to Trump ...",
    "url": "https://www.aljazeera.com/news/2025/6/23/history-of-us-iran-relations-from-the-1953-regime-change-to-trump-strikes",
    "snippet": "In one attack on a military base in Beirut, 241 US service members were killed. The US blamed Hezbollah, a Lebanese Shia movement backed by Iran ..."
  },
  {
    "title": "Iranian Regime's War on America: Four Decades of Targeting U.S. ...",
    "url": "https://www.ajc.org/news/iranian-regimes-war-on-america-four-decades-of-targeting-us-forces-and-citizens",
    "snippet": "The Iranian regime's anti-American campaign began with the 1979 seizure of the U.S. Embassy in Tehran, where 52 Americans were held hostage for ..."
  },
  {
    "title": "US-Iran Relations: A Complex History of Conflict and Change",
    "url": "https://www.amu.apus.edu/area-of-study/legal-studies/resources/us-iran-relations/",
    "snippet": "Iran-backed militias began attacking oil tankers in the Persian Gulf and shot down a U.S. drone. Meanwhile, Iran continued to send military ..."
  },
  {
    "title": "Iranian and Iranian-Backed Attacks Against Americans (1979-Present)",
    "url": "https://www.fdd.org/analysis/2025/06/19/iranian-and-iranian-backed-attacks-against-americans-1979-present/",
    "snippet": "Since the 1979 Islamic Revolution, the clerical regime in Tehran and its proxies have committed a range of attacks against Americans."
  },
  {
    "title": "Iran–Iraq War - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Iran%E2%80%93Iraq_War",
    "snippet": "The Iran–Iraq War was an armed conflict between Iran and Iraq which lasted from September 1980 to August 1988. Active hostilities began with the Iraqi ..."
  },
  {
    "title": "Key Moments in Iran-US Relations Over the Decades | #watch",
    "url": "https://www.youtube.com/watch?v=lrIwlA1CrCI",
    "snippet": "Iran-US relations have been marked by decades of tension, diplomacy, and conflict. From the 1953 CIA-backed coup to the 1979 Iranian ..."
  },
  {
    "title": "U.S.-Iran Tensions: From Political Coup to Drone Strikes - History.com",
    "url": "https://www.history.com/articles/iran-nuclear-deal-sanctions-facts-hostage-crisis",
    "snippet": "The United States and Iran have never formally been at war, but tensions between the two countries have persisted for decades."
  },
  {
    "title": "Trump Warns US: \"Big Force\" Heading Towards Iran as Tensions Soar",
    "url": "https://www.youtube.com/watch?v=pozEsopaj9s",
    "snippet": "... . --- Trump Iran | Iran Protests | US Iran Ties | Trump Khamenei | Firstpost | World News | Latest News | Global News | International News | ..."
  },
  {
    "title": "Iran | Today's latest from Al Jazeera",
    "url": "https://www.aljazeera.com/where/iran/",
    "snippet": "Iran's Khamenei says US, Israel links behind 'thousands killed' in protests. The country's supreme leader says foreign-backed protests 'caused massive damage ..."
  },
  {
    "title": "Iran's top prosecutor denies Trump's claim 800 prisoners were ... - PBS",
    "url": "https://www.pbs.org/newshour/world/irans-top-prosecutor-denies-trumps-claim-800-prisoners-were-spared-execution",
    "snippet": "Tensions between the U.S. and Iran remain high as an American aircraft carrier group moves closer to the Middle East."
  },
  {
    "title": "Trump's \"Big Force\": US Armada Moving Towards Iran | Firstpost Live",
    "url": "https://www.youtube.com/watch?v=C74OXsiEMv4",
    "snippet": "US President Donald Trump has said that Washington has an “armada” headed toward Iran, renewing warnings to Tehran over the killing of ..."
  },
  {
    "title": "Latest on Iran-US Tensions in the Middle East - Facebook",
    "url": "https://www.facebook.com/i24NEWSEN/videos/latest-on-iran-us-tensions-in-the-middle-east/1404820074355905/",
    "snippet": "Latest on tensions between the US and the Iranian regime. An American aircraft carrier group is moving from Asia towards the Middle East."
  },
  {
    "title": "The Standoff with Iran - CBS News",
    "url": "https://www.cbsnews.com/us-iran-tensions/",
    "snippet": "Trump says \"armada\" of warships is headed towards Iran \"just in case\" · Concerns mount over Iranian-American journalist wrongfully detained in Iran · Iran says ..."
  },
  {
    "title": "Toll in Iran's protest crackdown reaches at least 5,002 dead as ...",
    "url": "https://abcnews.go.com/Business/wireStory/toll-irans-protest-crackdown-reaches-5002-dead-trump-129476717",
    "snippet": "The new toll comes as tensions remain high over Trump laying down two red lines over the protests — the killing of peaceful demonstrators and ..."
  },
  {
    "title": "Iran news - breaking stories, video and analysis | CNN",
    "url": "https://www.cnn.com/world/middleeast/iran",
    "snippet": "LATEST NEWS ; UGC/AP · Iran 'prepared' for war but open to US talks as more than 500 reported killed in protests ; MAHSA/Middle East Images/AFP/Getty Images. Why ..."
  },
  {
    "title": "U.S vs Iran War BREAKING: Trump's F-15 Jets Reach ... - YouTube",
    "url": "https://www.youtube.com/watch?v=9hjFCBR9kYw",
    "snippet": "U.S. military movements around Iran are intensifying, raising fresh fears of escalation. An American C-37B aircraft has flown to Ashgabat, ..."
  },
  {
    "title": "There Is a High Likelihood that Trump Will Bomb Iran — An Interview ...",
    "url": "https://www.hungarianconservative.com/articles/interview/trita-parsi-iran-us-regime-change/",
    "snippet": "There Is a High Likelihood that Trump Will Bomb Iran — An Interview with Trita Parsi · Executive Vice President of the Quincy Institute for ..."
  },
  {
    "title": "Is Iran on the brink of change? - Brookings Institution",
    "url": "https://www.brookings.edu/articles/is-iran-on-the-brink-of-change/",
    "snippet": "Brookings Foreign Policy scholars examine whether the crisis in Iran will prove to be the tipping point for Tehran's government."
  },
  {
    "title": "8 Experts on What Happens If the United States Bombs Iran - Politico",
    "url": "https://www.politico.com/news/magazine/2025/06/18/us-attacks-iran-expert-predictions-analysis-00413901",
    "snippet": "It is hard to predict, but whether the U.S. does or doesn't bomb Iran, I think Tehran will ultimately pick the path of diplomacy and a deal. ..."
  },
  {
    "title": "Expert Analyzes Iran, Trump, and What Comes Next - YouTube",
    "url": "https://www.youtube.com/watch?v=NEF-OycBBq8",
    "snippet": "As tensions spike between Washington and Tehran, Chuck Freilich breaks down the unprecedented rhetoric, real risks, and what the coming ..."
  },
  {
    "title": "Auburn University experts say 'World War III' unlikely after Israel's ...",
    "url": "https://cla.auburn.edu/news/articles/political-science-experts-say-wwiii-unlikely-1/",
    "snippet": "Additionally, the U.S. will continue putting pressure on Israel to avoid such an eventuality as any war between Iran and Israel would draw in U.S. military ..."
  },
  {
    "title": "What the Iran War of 2025 Might Look Like",
    "url": "https://www.aei.org/op-eds/what-the-iran-war-of-2025-might-look-like/",
    "snippet": "The US military is positioning B-2 stealth bombers at Diego Garcia, signaling potential strikes against Iran amid heightened tensions."
  },
  {
    "title": "New US-Iran nuclear deal this year? Odds & Predictions 2026 - Kalshi",
    "url": "https://kalshi.com/markets/kxusairanagreement/us-iran-nuclear-deal/kxusairanagreement-27",
    "snippet": "If the United States agreed to, signed, or accepted a new Iran-US nuclear deal before Jan 1, 2027, then the market resolves to Yes. Sources from The New York ..."
  },
  {
    "title": "RIAC :: What the US-Iran war might look like",
    "url": "https://russiancouncil.ru/en/blogs/ratneshdwivedi/what-the-usiran-war-might-look-like-/",
    "snippet": "A US-Iran war would likely lead to thousands or hundreds of thousands of dead. Trying to forcibly remove the country's leadership, experts say, ..."
  },
  {
    "title": "Prediction Professor: How Likely Is a Trump-Iran War? - YouTube",
    "url": "https://www.youtube.com/watch?v=nbkJf0ZKIL0",
    "snippet": "Is Donald Trump preparing to launch a war with Iran? Allan Lichtman breaks down the looming two-week decision window, the dangerous echoes ..."
  },
  {
    "title": "US lawmakers blast Israel, urge against war with Iran",
    "url": "https://responsiblestatecraft.org/war-iran/",
    "snippet": "A war between Israel and Iran may be good for Netanyahu's domestic politics, but it will likely be disastrous for both the security of Israel, the United States ..."
  }
]