[
  {
    "title": "Human extinction - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Human_extinction",
    "snippet": "Humanity has a 95% probability of being extinct in 8,000,000 years, according to J. Richard Gott's formulation of the controversial doomsday argument, which ..."
  },
  {
    "title": "There have been five mass extinctions in Earth's history",
    "url": "https://ourworldindata.org/mass-extinctions",
    "snippet": "There's a natural background rate to the timing and frequency of extinctions: 10% of species are lost every million years, 30% every 10 million ..."
  },
  {
    "title": "Our ancestors lost nearly 99% of their population, 900,000 years ago",
    "url": "https://www.nature.com/articles/d41586-023-02837-6",
    "snippet": "Our ancestors lost nearly 99% of their population, 900,000 years ago. A roundup of stories from the Nature Briefing, including how human ..."
  },
  {
    "title": "How Human Beings Almost Vanished From Earth In 70000 B.C. - NPR",
    "url": "https://www.npr.org/sections/krulwich/2012/10/22/163397584/how-human-beings-almost-vanished-from-earth-in-70-000-b-c",
    "snippet": "More likely there was a drastic dip and then 5,000 to 10,000 bedraggled Homo sapiens struggled together in pitiful little clumps hunting and ..."
  },
  {
    "title": "Extinction Over Time | Smithsonian National Museum of Natural ...",
    "url": "https://naturalhistory.si.edu/education/teaching-resources/paleontology/extinction-over-time",
    "snippet": "Judging from the fossil record, the baseline extinction rate is about one species per every one million species per year."
  },
  {
    "title": "Human Population Growth and Extinction",
    "url": "https://www.biologicaldiversity.org/programs/population_and_sustainability/extinction/",
    "snippet": "Wilson estimated that 30,000 species per year (or three species per hour) are being driven to extinction. Compare this to the natural background rate of one ..."
  },
  {
    "title": "Extinctions during human era worse than thought | News from Brown",
    "url": "https://archive2.news.brown.edu/2007-2015/articles/2014/09/extinctions.html",
    "snippet": "In absolute, albeit rough, terms the paper calculates a “normal background rate” of extinction of 0.1 extinctions per million species per year."
  },
  {
    "title": "An upper bound for the background rate of human extinction - PMC",
    "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6667434/",
    "snippet": "There have been five major mass extinctions in the past 541 Myr51,52, with many arguing that human activity is currently causing a sixth2. In a ..."
  },
  {
    "title": "The present, past and future of human-caused extinctions",
    "url": "https://royalsocietypublishing.org/rstb/article/325/1228/469/17974/The-present-past-and-future-of-human-caused",
    "snippet": "This paper re-evaluates whether we are really at the start of a mass extinction caused by humans. I consider the present, past and future of human-caused ..."
  },
  {
    "title": "Human-driven mass extinction is eliminating entire genera",
    "url": "https://news.stanford.edu/stories/2023/09/human-driven-mass-extinction-eliminating-entire-genera",
    "snippet": "Seventy-three genera of land-dwelling vertebrates, Ceballos and Ehrlich found, have gone extinct since 1500 AD. Birds suffered the heaviest ..."
  },
  {
    "title": "Poll: Most Americans Believe Cities Will Be Lost to Rising Sea Levels",
    "url": "https://www.insurancejournal.com/news/national/2026/01/23/855338.htm",
    "snippet": "One-quarter of those polled believe climate change is very or somewhat likely climate change will cause the extinction of the human race."
  },
  {
    "title": "New study shows alarming rate of potential species extinction due to ...",
    "url": "https://today.uconn.edu/experts/expert-spotlight/10331/new-study-shows-alarming-rate-of-potential-species-extinction-due-to-climate-change/",
    "snippet": "Rising temperatures could see one-third of species become extinct by 2100. Business Today. The world is also likely to experience more extreme ..."
  },
  {
    "title": "Meta-analysis of current global warming impacts suggests a third of ...",
    "url": "https://phys.org/news/2024-12-meta-analysis-current-global-impacts.html",
    "snippet": "A biologist at the University of Connecticut has found evidence that up to a third of all species alive today could go extinct by 2100 if greenhouse gas ..."
  },
  {
    "title": "A chilling new revelation from scientists has put the world on edge ...",
    "url": "https://www.facebook.com/groups/828178678983076/posts/1312278173906455/",
    "snippet": "Scientists have predicted a mass extinction on Earth in 250 million years, wiping out all mammals due to extreme heat and rising CO2 levels. The ..."
  },
  {
    "title": "Climate crisis could cause new mass extinction, says researcher",
    "url": "https://agenciabrasil.ebc.com.br/en/meio-ambiente/noticia/2025-04/climate-crisis-could-cause-new-mass-extinction-says-researcher",
    "snippet": "If humanity fails to reverse the impacts of climate change, Earth could face a mass extinction event comparable to that of the Permian ..."
  },
  {
    "title": "Mathematics predicts a sixth mass extinction | MIT News",
    "url": "https://news.mit.edu/2017/mathematics-predicts-sixth-mass-extinction-0920",
    "snippet": "Daniel Rothman has predicted that the oceans may hold enough carbon to trigger a sixth mass extinction by 2100, reports Trevor Nace for Forbes."
  },
  {
    "title": "A third of Earth's species could become extinct by 2100 if climate ...",
    "url": "https://www.livescience.com/planet-earth/climate-change/a-third-of-earths-species-could-become-extinct-by-2100-if-climate-change-isnt-curbed",
    "snippet": "Almost one-third of species around the world would be at risk of extinction by the end of the century if we continue to churn out greenhouse gases, according ..."
  },
  {
    "title": "Human extinction - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Human_extinction",
    "snippet": "On September 11, 2025, Warp News estimated a 20% chance of global catastrophe and a 6% chance of human extinction by 2100. They also estimated a 100% chance ..."
  },
  {
    "title": "Could AI Really Kill Off Humans? - RAND",
    "url": "https://www.rand.org/pubs/commentary/2025/05/could-ai-really-kill-off-humans.html",
    "snippet": "In real-world surveys AI researchers say that they see human extinction as a plausible outcome of AI development."
  },
  {
    "title": "A third of Earth's species could become extinct by 2100 if climate ...",
    "url": "https://www.reddit.com/r/climate/comments/1h7ilwr/a_third_of_earths_species_could_become_extinct_by/",
    "snippet": "The article says that would happen if warming increases by 9.7 F (5.4 C), which is way higher than the likeliest scenarios."
  },
  {
    "title": "Extinction of the human species: What could cause it and how likely ...",
    "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11950659/",
    "snippet": "A recent survey of 2,778 AI authors found that between 37.8% and 51.4% (depending on framing of the question) of respondents gave at least a 10% probability to ..."
  },
  {
    "title": "AI expert claims there is a 99.9% risk of human extinction coming ...",
    "url": "https://www.uniladtech.com/news/ai-expert-claims-99-percent-risk-human-extinction-673612-20260106",
    "snippet": "AI expert claims there is a 99.9% risk of human extinction coming much sooner than we think · Expert publishes 'doom timeline' and warns AI could ..."
  },
  {
    "title": "Do half of AI researchers believe that there's a 10% chance AI will ...",
    "url": "https://aiguide.substack.com/p/do-half-of-ai-researchers-believe",
    "snippet": "In a recent poll, half of A.I. scientists agreed that there was at least a ten-per-cent chance that the human race would be destroyed by A.I.."
  },
  {
    "title": "'Godfather of AI' shortens odds of the technology wiping out ...",
    "url": "https://www.theguardian.com/technology/2024/dec/27/godfather-of-ai-raises-odds-of-the-technology-wiping-out-humanity-over-next-30-years",
    "snippet": "Geoffrey Hinton says there is 10% to 20% chance AI will lead to human extinction in three decades, as change moves fast."
  },
  {
    "title": "Could AI Really Kill Off Humans? - RAND",
    "url": "https://www.rand.org/pubs/commentary/2025/05/could-ai-really-kill-off-humans.html",
    "snippet": "In real-world surveys AI researchers say that they see human extinction as a plausible outcome of AI development."
  },
  {
    "title": "Scientists Have Calculated The Probability Of Humanity Going ...",
    "url": "https://www.iflscience.com/scientists-have-calculated-the-probability-of-humanity-going-extinct-in-any-given-year-54196",
    "snippet": "The researchers conclude that their paper reveals we are unlikely to go extinct due to natural causes that humanity has been vulnerable to as ..."
  },
  {
    "title": "Current Estimates for Likelihood of X-Risk? — EA Forum",
    "url": "https://forum.effectivealtruism.org/posts/frYYAAa5K4nHqRCPG/current-estimates-for-likelihood-of-x-risk",
    "snippet": "I've found it to be extremely helpful to give an estimate for the percent chance humanity goes extinct by 2100 (or in 100 years). Right now, I say ~10% or 5-19 ..."
  },
  {
    "title": "AI researcher warns of 99.9% human extinction risk - Daily Express",
    "url": "https://www.express.co.uk/news/science/2143931/ai-expert-calculates-99-9-risk-human-extinction-within-next-century",
    "snippet": "AI expert calculates 99.9% risk of human extinction within the next century. A computer scientist who specialises in AI safety has predicted ..."
  },
  {
    "title": "An upper bound for the background rate of human extinction - Nature",
    "url": "https://www.nature.com/articles/s41598-019-47540-7",
    "snippet": "This corresponds to an annual extinction probability below roughly 1 in 14,000. The relative likelihood for such high extinction rates are below ..."
  }
]