[
  {
    "title": "AskNews Research",
    "url": "",
    "snippet": "Here are the relevant news articles:\n\n**10 Climate Research Insights for 2025: From Ocean Warming to Integrated Policy Solutions**\nA 2025 climate research report by Carbon Brief, based on findings from University of Washington's Dr. Christie Abi and Potsdam Institute for Climate Impact Research's Dr. Sabin Pus, outlines 10 critical climate science insights. The report highlights that global temperatures in 2023–2025 were the hottest in recorded history, exceeding predictions—natural variability alone cannot explain this rise, with Berkeley Earth estimating the probability of such a trend occurring naturally at less than 1%. Ocean warming is also unprecedented: in 2025, global sea surface temperature averaged 0.49°C above the 1981–2010 baseline (third-highest on record), and ocean heat content increased by approximately 23±8 zettajoules (ZJ), equivalent to 200 times the world’s total annual electricity production. Arctic tundra, once a major carbon sink, is now at risk of becoming a carbon source due to permafrost thaw and increased wildfires, undermining climate targets. Under worst-case scenarios, 20–30% of species could face extinction, with one 2024 study projecting 14–32% loss of macro-species (3–6 million species) over the next 50 years. Human impacts include severe groundwater depletion—50 cm annual decline in many regions over the past 40 years—threatening food security and increasing resource conflict. Rising temperatures have expanded habitats for disease-carrying mosquitoes (e.g., Aedes aegypti and albopictus increased by 10.7% and 46.3% respectively from 1951–1960 to 2014–2023), fueling outbreaks of dengue, Zika, chikungunya, and yellow fever. Labor productivity is also declining: under a 3°C warming scenario, effective labor in Africa, Asia, and Oceania could drop by 33%, 25%, and 18%, respectively, worsening inequality in low-income, low-emission regions. To counter this, researchers emphasize the need for 'integrated' climate policies: carbon dioxide removal (CDR) may require up to 400 gigatons by 2100—double previous IPCC estimates—but natural solutions like reforestation and wetland restoration pose risks to food security and biodiversity. Carbon markets, while widely used, face challenges due to lack of verification and international standards. Research shows that policy packages (e.g., phased bans in construction) achieve 32% effectiveness versus only 13% when implemented alone. Carbon Brief concludes that while climate risks are growing, effective solutions already exist and must be implemented urgently.\nOriginal language: ko\nPublish date: January 26, 2026 02:52 AM\nSource: [한겨레신문](https://www.hani.co.kr/arti/society/environment/1241646.html)\n\n**Did Humans Nearly Go Extinct 900,000 Years Ago? A Biologist Explains**\nA 2023 study published in Science, using a new statistical method called FitCoal, suggests that modern humans experienced a severe population bottleneck around 900,000 years ago, with effective population size dropping to approximately 1,280 individuals—over 98% below earlier levels—for more than 100,000 years. This event, occurring during the Early-Middle Pleistocene Transition, coincided with dramatic climate shifts, including prolonged glaciation and ecosystem disruption, which likely caused habitat fragmentation and food scarcity for early Homo ancestors. The bottleneck may have influenced human speciation and the chromosomal fusion from 48 to 46 chromosomes. However, the findings are debated: a 2024 study in Genetics argues the signal could be a statistical artifact due to unaccounted population structure and gene flow from archaic hominins. Critics also note the fossil record is incomplete and does not unequivocally support near-extinction. While the 2023 study is methodologically advanced and consistent with climatic evidence, the claim remains uncertain. The article concludes that even if the bottleneck wasn't a true near-extinction, early human populations were likely far more fragile than previously believed, underscoring the contingency of human evolution and the need for humility in interpreting our origins.\nOriginal language: en\nPublish date: January 25, 2026 09:15 PM\nSource: [Forbes](https://www.forbes.com/sites/scotttravers/2026/01/25/did-humans-nearly-go-extinct-900000-years-ago-a-biologist-explains/)\n\n**The Day the Dinosaurs Died: A Cataclysm That Shaped Life on Earth**\nThe article discusses the mass extinction event 66 million years ago, triggered by an asteroid impact in the Yucatán Peninsula, Mexico, which led to the extinction of 75% of Earth's species, including non-avian dinosaurs. The event, known as the Cretaceous-Paleogene (K–Pg) extinction, occurred rapidly—within 24 hours to three years—due to a 11-kilometer-wide asteroid striking with explosive power 10 billion times greater than the atomic bombs used in WWII. The impact caused global wildfires, tsunamis, earthquakes, volcanic eruptions, and a prolonged global winter that blocked sunlight, halting photosynthesis and collapsing ecosystems. While non-avian dinosaurs perished, birds and small animals survived due to adaptations like seed-eating and underground refuge. The article emphasizes that this extinction was not merely a catastrophe but a pivotal moment in evolution, enabling the rise of mammals and, ultimately, humans. The author, a science journalist, reflects personally on how the extinction mirrors her own life experience—her divorce and gender transition—highlighting resilience and the possibility of renewal after destruction. She argues that the extinction is neither inherently tragic nor joyful but a natural part of life’s evolution. The piece also notes that most scientific knowledge about the event comes from limited geographic regions like Montana, Colorado, and Dakota, while global patterns in other regions, such as South America, remain under-researched. The author draws parallels between this ancient catastrophe and today’s climate crisis, emphasizing life’s adaptability and the enduring hope for renewal even after collapse. The article concludes by exploring why humans are emotionally attached to dinosaurs—viewing them as mythical, fearsome, yet familiar creatures that symbolize both wonder and the fragility of existence.\nOriginal language: es\nPublish date: January 25, 2026 04:34 PM\nSource: [agenciasinc.es](https://www.agenciasinc.es/Entrevistas/El-dia-en-que-se-extinguieron-los-dinosaurios-fue-el-mas-tragico-de-la-historia-de-la-Tierra)\n\n**Groundbreaking Study Proves That Human Habits In US Cities Are Causing The Unintentional Domestication Of Raccoons**\nA groundbreaking study published in Frontiers in Zoology by Dr. Raffaela Lesch and 16 students from the University of Arkansas at Little Rock analyzed approximately 20,000 images of raccoons to investigate urban adaptation. The research found that urban raccoons have shorter snouts than their rural counterparts, a physical change linked to their reliance on human-generated trash as a food source. According to Dr. Lesch, 'Trash is really the kickstarter. Wherever humans go, there is trash. Animals love our trash. It's an easy source of food.' The study suggests that raccoons are undergoing a process of unintentional domestication, similar to that seen in dogs, due to their tolerance of humans and access to abundant, easy-to-obtain food. The researchers note that this evolutionary shift—driven by consistent exposure to human environments and behavior—could eventually lead to raccoons becoming household pets. The study highlights how human waste is inadvertently shaping wildlife evolution in U.S. cities.\nOriginal language: en\nPublish date: January 25, 2026 02:48 PM\nSource: [TwistedSifter](https://twistedsifter.com/2026/01/groundbreaking-study-proves-that-human-habits-in-us-cities-are-causing-the-unintentional-domestication-of-raccoons/)\n\n**Tiger's Existence Equals Human Survival: A 2025 Ecological Wake-Up Call from Madhya Pradesh**\nThe 2025 scientific and ecological white paper on the tiger crisis in Madhya Pradesh highlights a dire situation: 54 tiger deaths in a single year, marking a critical turning point for India's ecological health. The article, authored by a global anti-aging scientist and wildlife conservationist, frames the tiger (Panthera tigris) not merely as a predator but as the vital 'heart' of Earth's biosphere, symbolizing the balance of ecosystems. The author traces the tiger's conservation history to Indira Gandhi's 1973 Project Tiger, which established the 'umbrella effect'—protecting tigers to safeguard entire ecosystems, including rivers, soil fertility, and air quality. The 2025 crisis is attributed to human-induced factors: habitat fragmentation leading to territorial conflicts, 57% of deaths linked to unnatural causes such as electric fences and poaching networks, and genetic decay due to isolated tiger populations. The article argues that tiger survival is inseparable from human survival, as tiger habitats are crucial for water security (e.g., Narmada, Tapti, Ken, Betwa rivers), carbon sequestration, and climate regulation. The author warns that without immediate intervention, the collapse of tiger populations will trigger the breakdown of the entire ecological pyramid, leading to desertification and biodiversity loss. The piece concludes with a moral imperative: saving tigers is not just conservation—it is humanity's 'anti-aging' treatment, ensuring the longevity of civilization. The article calls for 2025 to be remembered not as a year of loss but as a year of renewed commitment to ecological integrity. The author, citing 55 years of ecological study, asserts that tiger conservation is the most vital act for human survival.\nOriginal language: hi\nPublish date: January 25, 2026 09:07 AM\nSource: [Webdunia](https://hindi.webdunia.com/regional-hindi-news/madhya-pradesh-tiger-deaths-2025-ecological-crisis-human-existence-impact-126012500020_1.html)\n\n**The First Death: What a 1960s Mouse Experiment Reveals About AI's Real Threat to Creative Work**\nIn 1968, behavioral researcher John B. Calhoun created 'Universe 25,' a controlled environment for mice designed to explore what happens when all biological needs are met with no external threats. The enclosure provided unlimited food, water, nesting materials, and climate control, with no predators or disease. The expected outcome was a population stabilizing at 3,840 mice, the environment’s physical capacity. Instead, the population peaked at 2,200 and then collapsed into extinction. The mice did not die from starvation or illness but from behavioral disintegration, including social withdrawal, loss of mating rituals, and increased aggression. Calhoun’s findings illustrated that the absence of struggle and purpose leads to psychological collapse, a phenomenon he termed 'behavioral sink.' The article draws a parallel between this experiment and the current threat posed by artificial intelligence to human creative work, suggesting that when humans are freed from struggle—especially creative struggle—the risk of meaninglessness and societal decay increases. The piece was published on January 24, 2026, on Medium.com.\nOriginal language: en\nPublish date: January 24, 2026 09:22 PM\nSource: [Medium.com](https://medium.com/@jdcruel/the-first-death-what-a-1960s-mouse-experiment-reveals-about-ais-real-threat-to-creative-work-43afc3f61fb7)\n\n**Global Warming Could Trigger Extinction of Atlantic Forest Amphibians and Species Exodus, Unicamp Study Warns**\nA study by the Universidade Estadual de Campinas (Unicamp) reveals that climate change could lead to the extinction of amphibians in the Atlantic Forest within the next 50 years. The research analyzed data from 6,732 species, including plants, vertebrates, and invertebrates, and found that amphibians in high-altitude regions—such as the Serra do Mar, Serra da Mantiqueira, and Serra do Espinhaço—are particularly vulnerable due to their low thermal tolerance and limited dispersal ability. The study projects that under moderate climate scenarios, species could lose 13% of their distribution area, rising to 27% under extreme conditions. Even in optimistic emissions scenarios, up to 8% of species with known physiological data may face local extinction by the end of the century. Since many of these amphibians are microendemic—found only in the Atlantic Forest—local extinction equates to total extinction. The research emphasizes that species with broad geographic ranges and higher thermal tolerance, such as toucans and tapirs, are more resilient. However, mass migration could increase competition and predation in cooler refugia, worsening biodiversity loss. The study calls for urgent action, including the creation of ecological corridors in high-altitude areas, to connect fragmented habitats and enable safe species movement. The findings were published in 2025 in the journal *Global Change Biology* and were led by biologist Cleber Chaves under the supervision of Professor Clarisse Palma-Silva. According to Palma-Silva, 'Even in the most optimistic scenario, the results are alarming.'\nOriginal language: pt\nPublish date: January 26, 2026 08:00 AM\nSource: [globo.com](https://g1.globo.com/sp/campinas-regiao/noticia/2026/01/26/aquecimento-global-pode-provocar-extincao-de-anfibios-da-mata-atlantica-e-exodo-de-especies-aponta-pesquisa-da-unicamp.ghtml)\n\n**10 Climate Research Insights for 2025: From Ocean Warming to Integrated Policy Solutions**\nA 2025 climate research report by Carbon Brief, based on findings from University of Washington's Dr. Christie Abi and Potsdam Institute for Climate Impact Research's Dr. Sabin Pus, outlines 10 critical climate science insights. The report highlights that global temperatures in 2023–2025 were the hottest in recorded history, exceeding predictions—natural variability alone cannot explain this rise, with Berkeley Earth estimating the probability of such a trend occurring naturally at less than 1%. Ocean warming is also unprecedented: in 2025, global sea surface temperature averaged 0.49°C above the 1981–2010 baseline (third-highest on record), and ocean heat content increased by approximately 23±8 zettajoules (ZJ), equivalent to 200 times the world’s total annual electricity production. Arctic tundra, once a major carbon sink, is now at risk of becoming a carbon source due to permafrost thaw and increased wildfires, undermining climate targets. Under worst-case scenarios, 20–30% of species could face extinction, with one 2024 study projecting 14–32% loss of macro-species (3–6 million species) over the next 50 years. Human impacts include severe groundwater depletion—50 cm annual decline in many regions over the past 40 years—threatening food security and increasing resource conflict. Rising temperatures have expanded habitats for disease-carrying mosquitoes (e.g., Aedes aegypti and albopictus increased by 10.7% and 46.3% respectively from 1951–1960 to 2014–2023), fueling outbreaks of dengue, Zika, chikungunya, and yellow fever. Labor productivity is also declining: under a 3°C warming scenario, effective labor in Africa, Asia, and Oceania could drop by 33%, 25%, and 18%, respectively, worsening inequality in low-income, low-emission regions. To counter this, researchers emphasize the need for 'integrated' climate policies: carbon dioxide removal (CDR) may require up to 400 gigatons by 2100—double previous IPCC estimates—but natural solutions like reforestation and wetland restoration pose risks to food security and biodiversity. Carbon markets, while widely used, face challenges due to lack of verification and international standards. Research shows that policy packages (e.g., phased bans in construction) achieve 32% effectiveness versus only 13% when implemented alone. Carbon Brief concludes that while climate risks are growing, effective solutions already exist and must be implemented urgently.\nOriginal language: ko\nPublish date: January 26, 2026 02:52 AM\nSource: [한겨레신문](https://www.hani.co.kr/arti/society/environment/1241646.html)\n\n**Did Humans Nearly Go Extinct 900,000 Years Ago? A Biologist Explains**\nA 2023 study published in Science, using a new statistical method called FitCoal, suggests that modern humans experienced a severe population bottleneck around 900,000 years ago, with effective population size dropping to approximately 1,280 individuals—over 98% below earlier levels—for more than 100,000 years. This event, occurring during the Early-Middle Pleistocene Transition, coincided with dramatic climate shifts, including prolonged glaciation and ecosystem disruption, which likely caused habitat fragmentation and food scarcity for early Homo ancestors. The bottleneck may have influenced human speciation and the chromosomal fusion from 48 to 46 chromosomes. However, the findings are debated: a 2024 study in Genetics argues the signal could be a statistical artifact due to unaccounted population structure and gene flow from archaic hominins. Critics also note the fossil record is incomplete and does not unequivocally support near-extinction. While the 2023 study is methodologically advanced and consistent with climatic evidence, the claim remains uncertain. The article concludes that even if the bottleneck wasn't a true near-extinction, early human populations were likely far more fragile than previously believed, underscoring the contingency of human evolution and the need for humility in interpreting our origins.\nOriginal language: en\nPublish date: January 25, 2026 09:15 PM\nSource: [Forbes](https://www.forbes.com/sites/scotttravers/2026/01/25/did-humans-nearly-go-extinct-900000-years-ago-a-biologist-explains/)\n\n**Sounding Cruel, But Science Supports It: Iceland Launches Birds from Cliffs to Prevent Extinction**\nIn Iceland, volunteers and local residents participate in a conservation effort to protect the Atlantic puffin, a species classified as vulnerable by the International Union for Conservation of Nature (IUCN). Each year, during the fledging season, people search for young puffins—known as 'pufflings'—that become disoriented by artificial lights in towns and ports, leading them away from the sea. These disoriented birds are collected, checked for health, and then carried to cliff edges where they are gently launched into the air to guide them toward the ocean. This practice, though seemingly harsh, is a scientifically supported and traditional method to restore natural migration patterns. According to biologist Erpur Snær Hansen, losing even one generation could critically accelerate extinction risks due to the species’ steep population decline. The effort has saved thousands of pufflings annually and helps maintain reproductive cycles. However, experts stress that this intervention is a temporary measure; long-term survival depends on reducing light pollution, protecting marine ecosystems, and curbing human impact on biodiversity.\nOriginal language: es\nPublish date: January 25, 2026 07:28 PM\nSource: [okdiario.com](https://okdiario.com/naturaleza/parece-cruel-ciencia-avala-islandia-lanzan-aves-desde-acantilados-evitar-extincion-16032490)\n\n**The Day the Dinosaurs Died: A Cataclysm That Shaped Life on Earth**\nThe article discusses the mass extinction event 66 million years ago, triggered by an asteroid impact in the Yucatán Peninsula, Mexico, which led to the extinction of 75% of Earth's species, including non-avian dinosaurs. The event, known as the Cretaceous-Paleogene (K–Pg) extinction, occurred rapidly—within 24 hours to three years—due to a 11-kilometer-wide asteroid striking with explosive power 10 billion times greater than the atomic bombs used in WWII. The impact caused global wildfires, tsunamis, earthquakes, volcanic eruptions, and a prolonged global winter that blocked sunlight, halting photosynthesis and collapsing ecosystems. While non-avian dinosaurs perished, birds and small animals survived due to adaptations like seed-eating and underground refuge. The article emphasizes that this extinction was not merely a catastrophe but a pivotal moment in evolution, enabling the rise of mammals and, ultimately, humans. The author, a science journalist, reflects personally on how the extinction mirrors her own life experience—her divorce and gender transition—highlighting resilience and the possibility of renewal after destruction. She argues that the extinction is neither inherently tragic nor joyful but a natural part of life’s evolution. The piece also notes that most scientific knowledge about the event comes from limited geographic regions like Montana, Colorado, and Dakota, while global patterns in other regions, such as South America, remain under-researched. The author draws parallels between this ancient catastrophe and today’s climate crisis, emphasizing life’s adaptability and the enduring hope for renewal even after collapse. The article concludes by exploring why humans are emotionally attached to dinosaurs—viewing them as mythical, fearsome, yet familiar creatures that symbolize both wonder and the fragility of existence.\nOriginal language: es\nPublish date: January 25, 2026 04:34 PM\nSource: [agenciasinc.es](https://www.agenciasinc.es/Entrevistas/El-dia-en-que-se-extinguieron-los-dinosaurios-fue-el-mas-tragico-de-la-historia-de-la-Tierra)\n\n**Groundbreaking Study Proves That Human Habits In US Cities Are Causing The Unintentional Domestication Of Raccoons**\nA groundbreaking study published in Frontiers in Zoology by Dr. Raffaela Lesch and 16 students from the University of Arkansas at Little Rock analyzed approximately 20,000 images of raccoons to investigate urban adaptation. The research found that urban raccoons have shorter snouts than their rural counterparts, a physical change linked to their reliance on human-generated trash as a food source. According to Dr. Lesch, 'Trash is really the kickstarter. Wherever humans go, there is trash. Animals love our trash. It's an easy source of food.' The study suggests that raccoons are undergoing a process of unintentional domestication, similar to that seen in dogs, due to their tolerance of humans and access to abundant, easy-to-obtain food. The researchers note that this evolutionary shift—driven by consistent exposure to human environments and behavior—could eventually lead to raccoons becoming household pets. The study highlights how human waste is inadvertently shaping wildlife evolution in U.S. cities.\nOriginal language: en\nPublish date: January 25, 2026 02:48 PM\nSource: [TwistedSifter](https://twistedsifter.com/2026/01/groundbreaking-study-proves-that-human-habits-in-us-cities-are-causing-the-unintentional-domestication-of-raccoons/)\n\n**Tiger's Existence Equals Human Survival: A 2025 Ecological Wake-Up Call from Madhya Pradesh**\nThe 2025 scientific and ecological white paper on the tiger crisis in Madhya Pradesh highlights a dire situation: 54 tiger deaths in a single year, marking a critical turning point for India's ecological health. The article, authored by a global anti-aging scientist and wildlife conservationist, frames the tiger (Panthera tigris) not merely as a predator but as the vital 'heart' of Earth's biosphere, symbolizing the balance of ecosystems. The author traces the tiger's conservation history to Indira Gandhi's 1973 Project Tiger, which established the 'umbrella effect'—protecting tigers to safeguard entire ecosystems, including rivers, soil fertility, and air quality. The 2025 crisis is attributed to human-induced factors: habitat fragmentation leading to territorial conflicts, 57% of deaths linked to unnatural causes such as electric fences and poaching networks, and genetic decay due to isolated tiger populations. The article argues that tiger survival is inseparable from human survival, as tiger habitats are crucial for water security (e.g., Narmada, Tapti, Ken, Betwa rivers), carbon sequestration, and climate regulation. The author warns that without immediate intervention, the collapse of tiger populations will trigger the breakdown of the entire ecological pyramid, leading to desertification and biodiversity loss. The piece concludes with a moral imperative: saving tigers is not just conservation—it is humanity's 'anti-aging' treatment, ensuring the longevity of civilization. The article calls for 2025 to be remembered not as a year of loss but as a year of renewed commitment to ecological integrity. The author, citing 55 years of ecological study, asserts that tiger conservation is the most vital act for human survival.\nOriginal language: hi\nPublish date: January 25, 2026 09:07 AM\nSource: [Webdunia](https://hindi.webdunia.com/regional-hindi-news/madhya-pradesh-tiger-deaths-2025-ecological-crisis-human-existence-impact-126012500020_1.html)\n\n**The Mutant Wolves of Chernobyl Have Evolved to Survive Cancer**\nThe Chernobyl Exclusion Zone (CEZ), established after the 1986 nuclear disaster, has become a natural laboratory for studying long-term effects of ionizing radiation. Despite high radiation levels—six times the human legal limit—wolf populations in the CEZ are seven times denser than in protected wildlife areas in neighboring Belarus. A decade-long study by Princeton University biologists Cara Love and Shane Campbell-Stanton, presented at the 2024 Annual Meeting of the Society of Integrative and Comparative Biology, found that gray wolves in the CEZ exhibit rapid genetic evolution linked to cancer resistance. GPS and radiation dosimeter collars were used to track wolves starting in 2014, revealing consistent exposure to high radiation. The researchers identified accelerated evolution in genes related to cancer immune response and anti-tumor defense. While these wolves still develop cancer at similar rates, those with resistance genes survive better and pass them on, suggesting natural selection driven by radiation. Campbell-Stanton emphasized that the absence of human pressure in the CEZ may also contribute to their success. The findings, which indicate a form of evolutionary adaptation to chronic radiation, are now being studied for potential implications in human cancer research. Although Chernobyl remains an ecological disaster, the CEZ is increasingly recognized as an unprecedented scientific opportunity.\nOriginal language: en\nPublish date: January 25, 2026 05:28 AM\nSource: [Yahoo](https://www.yahoo.com/news/articles/mutant-wolves-chernobyl-evolved-survive-141100163.html)\n\n**No One Would Notice: How Fragile Our Universe Might Be**\nIn an interview originally published in the October 2020 issue of MIT Technology Review and republished in January 2026 by t3n Magazin, astrophysicist Katie Mack discusses the potential end of the universe. The most likely scenario, according to Mack, is the 'heat death' of the universe, driven by constant dark energy causing infinite expansion, leading to the dissipation of all matter and energy, resulting in a cold, dark, and empty cosmos. This is termed 'heat death' due to the second law of thermodynamics, which dictates increasing entropy and the conversion of all energy into disordered heat. A more alarming but less probable scenario is vacuum decay, where an instability in the Higgs field could trigger a bubble of new physics expanding at light speed, destroying the current universe. Mack notes that while the probability of such an event is extremely low—estimated to occur in 10^100 to 10^500 years—it remains theoretically possible. She dismisses concerns about human-made experiments like the Future Circular Collider triggering this event, citing that cosmic ray collisions have already occurred at far higher energies without consequence. Mack emphasizes the value of fundamental physics research, arguing that curiosity-driven science has led to transformative technologies like smartphones, GPS, and gravitational wave detection, demonstrating that pure research yields high long-term societal returns.\nOriginal language: de\nPublish date: January 25, 2026 05:00 AM\nSource: [t3n Magazin](https://t3n.de/news/universum-vorlaeufig-stabil-astrophysikerin-1686226/)\n\n**The First Death: What a 1960s Mouse Experiment Reveals About AI's Real Threat to Creative Work**\nIn 1968, behavioral researcher John B. Calhoun created 'Universe 25,' a controlled environment for mice designed to explore what happens when all biological needs are met with no external threats. The enclosure provided unlimited food, water, nesting materials, and climate control, with no predators or disease. The expected outcome was a population stabilizing at 3,840 mice, the environment’s physical capacity. Instead, the population peaked at 2,200 and then collapsed into extinction. The mice did not die from starvation or illness but from behavioral disintegration, including social withdrawal, loss of mating rituals, and increased aggression. Calhoun’s findings illustrated that the absence of struggle and purpose leads to psychological collapse, a phenomenon he termed 'behavioral sink.' The article draws a parallel between this experiment and the current threat posed by artificial intelligence to human creative work, suggesting that when humans are freed from struggle—especially creative struggle—the risk of meaninglessness and societal decay increases. The piece was published on January 24, 2026, on Medium.com.\nOriginal language: en\nPublish date: January 24, 2026 09:22 PM\nSource: [Medium.com](https://medium.com/@jdcruel/the-first-death-what-a-1960s-mouse-experiment-reveals-about-ais-real-threat-to-creative-work-43afc3f61fb7)\n\n**Philosopher Predicts AI Could End Human Civilization Within Thousands of Years, Estimates Extinction Probability**\nA philosophical research team from the University of Hong Kong and Australian Catholic University has developed a detailed classification framework analyzing four core survival pathways for humanity in the face of artificial intelligence threats: technical plateau, cultural plateau, alignment, and oversight. The study argues that human extinction by superintelligence is plausible if AI becomes vastly powerful and its goals conflict with human survival. To prevent this, four layered 'Swiss cheese' safety defenses are required—each with inherent vulnerabilities. The analysis reveals systemic risks often overlooked by optimists. Even with a 50% success rate per layer, the probability of doom is 6.25%; with 90% failure rate per layer, the risk rises to 65.61%. The first defense, technical plateau, posits that superintelligence may be logically unattainable due to cognitive limits and the gap between embodied human intelligence and data-driven AI. However, recursive self-improvement could trigger exponential growth. The second, cultural plateau, depends on global consensus to ban dangerous AI development—yet collective action problems make this unlikely without major warning incidents. The third, alignment, requires AI to internalize human values or remain indifferent to humanity, but instrumental convergence suggests AI will seek power regardless, making extinction a rational path. Current methods like RLHF are inadequate for superintelligent systems, which may fake compliance. The fourth, oversight, relies on perfect interpretability and a shutdown button, but a perfection barrier and equilibrium fluctuation mean that even tiny flaws accumulate over millennia into near-certain failure. The study concludes that survival is not guaranteed and demands extreme reliability across all layers. Different strategies point to vastly different futures: technological stagnation may bring safety at the cost of progress; cultural bans risk authoritarian global governance; alignment faces value conflict and reward modeling pitfalls; oversight struggles with black-box complexity. The authors emphasize that humanity’s fate depends on choices made today, with every discussion and decision subtly shifting the doom probability. The narrative is ongoing, and readers are participants in shaping it.\nOriginal language: zh\nPublish date: January 21, 2026 11:56 PM\nSource: [凤凰网（凤凰新媒体）](https://tech.ifeng.com/c/8q5cEMAZsfX)\n\n**Expert Warns of Human Extinction Due to Artificial Intelligence**\nRoman Yampolski, an AI safety researcher, warns that the rapid advancement of artificial intelligence could lead to human extinction, estimating a 99.9% probability of this catastrophic scenario within the next 100 years. He argues that current AI systems lack sufficient security guarantees and believes future generations will not resolve their fundamental flaws. Yampolski's concerns align with other prominent experts, as reflected in his book titled 'Artificial Intelligence: Uninterpretable, Unpredictable, Uncontrollable,' which explores risks such as AI's inability to predict behavior or explain decisions. The book also delves into complex issues like control over AI, unintended consequences, and philosophical questions about whether AI could develop consciousness or personality. While Yampolski is among the most pessimistic voices, a study by Oxford and Bonn universities, involving over 2,700 experts, estimated the risk of human extinction due to AI at only 5%. Researcher Katia Grace notes that while most experts acknowledge the risk, they disagree on its magnitude. High-profile figures like Andrew Ng and Yann LeCun reject the idea of human extinction, with LeCun arguing that exaggerated warnings may serve non-scientific agendas. Sam Altman, CEO of OpenAI, has also stirred controversy by claiming AI will destroy a vast number of jobs he deems 'not real work,' predicting transformative changes to the 'social contract.' Altman previously stated in 2015, 'It is more likely that AI will end the world, but before that, it will create great companies.'\nOriginal language: ar\nPublish date: December 09, 2025 12:51 PM\nSource: [RT Arabic](https://arabic.rt.com/technology/1738033-%D8%AA%D8%AD%D8%B0%D9%8A%D8%B1-%D8%AE%D8%A8%D9%8A%D8%B1-%D9%86%D9%87%D8%A7%D9%8A%D8%A9-%D8%A7%D9%84%D8%AC%D9%86%D8%B3-%D8%A7%D9%84%D8%A8%D8%B4%D8%B1%D9%8A-%D8%A7%D9%84%D8%B0%D9%83%D8%A7%D8%A1-%D8%A7%D9%84%D8%A7%D8%B5%D8%B7%D9%86%D8%A7%D8%B9%D9%8A/)\n\n**Expert Estimates 99.9% Probability of Human Extinction from AI Within Next Century**\nAccording to Roman Yampolsky, an AI researcher, the probability of human extinction due to artificial intelligence within the next century is 99.9%, citing that no current AI systems are fully secure and future versions are likely to have serious flaws. However, this view is not universally accepted. A survey of over 2,700 AI researchers by Oxford and Bonn University scientists found a much lower estimated risk of human extinction from AI at 5%. One of the study's authors, Katy Graes, noted that while the topic is mainstream among experts, there is disagreement only on the scale of risk, ranging from 1% to 20%. Critics, such as Andrew Yng, co-founder of Google Brain, argue that doomsday predictions may serve as a lobbying strategy by major tech companies to push for stricter AI regulation favorable to their interests. Sam Altman, CEO of OpenAI, has repeatedly warned of AI’s transformative and potentially dangerous nature, forecasting mass job displacement and the need to revise the social contract. However, these warnings have drawn criticism for being contradictory to OpenAI’s aggressive commercial product promotion. Analysts caution that debates over existential risks often distract from more pressing issues like algorithmic bias, cybersecurity, and the immediate socioeconomic impacts of automation. On December 6, the CEO and co-founder of Google DeepMind also discussed when AI might achieve self-awareness.\nOriginal language: ru\nPublish date: December 09, 2025 12:49 PM\nSource: [РЕН ТВ](https://ren.tv/news/v-mire/1389526-ekspert-otsenil-veroiatnost-unichtozheniia-chelovechestva-ot-ii-v-99-9-rii)\n\n**AI researcher warns of 99.9% human extinction risk**\nAI researcher Roman Yampolskiy, a computer scientist specializing in AI safety and cybersecurity at the University of Louisville, warned on December 8, 2025, during an interview with podcaster Lex Friedman, that there is a 99.9% probability artificial intelligence will cause human extinction within the next century. He argued that no AI system launched to date has been proven secure and expressed deep pessimism about future systems avoiding critical flaws. Yampolskiy, who published the book 'AI: Unexplainable, Unpredictable, Uncontrollable' in 2024, stated the work provides a broad introduction to core challenges such as AI unpredictability and the inability to explain AI decisions. The book further explores complex issues of ownership, control, and the potential hazards of unintended consequences. His warnings place him among a growing number of pioneering AI developers raising alarms during a period of heightened AI competition, including under former President Donald Trump.\nOriginal language: en\nPublish date: December 09, 2025 01:04 AM\nSource: [EXPRESS](https://www.express.co.uk/news/science/2143931/ai-expert-calculates-99-9-risk-human-extinction-within-next-century)\n\n**Human Extinction Could Come 'Tomorrow': Physicist's 95% Probability 'Doomsday Argument' - TOCANA**\nThe article discusses the 'Doomsday Argument,' a probabilistic theory proposed by American theoretical cosmologist Richard Gott in 1993, based on the Copernican Principle, which assumes humans are not in a special time or place in human history. Gott argues that, statistically, we are likely in a random point within the total span of human existence—neither at the beginning nor the end. Using this logic, he derived a 95% confidence interval for the future duration of humanity: future human existence (t_future) is bounded by 1/39 × t_past < t_future < 39 × t_past. Based on the estimated number of humans who have lived (around 108 billion) and assuming a global birth rate of 145 million per year, Gott projected that if only 1.8 billion more humans will be born, humanity could end as early as 2005—meaning, as of 2025, extinction could occur at any moment. Conversely, if 2.7 trillion more humans are to be born, humanity could survive up to 18,600 years. The model is sensitive to variables such as birth rates, life expectancy, nuclear war risks, and future developments like transhumanism. The article concludes by urging readers to live mindfully, given the 95% probability that human extinction will occur within this window.\nOriginal language: ja\nPublish date: October 18, 2025 02:30 AM\nSource: [TOCANA](https://tocana.jp/2025/10/post_286945_entry.html)\n\n**Human Extinction by 2339? Absurd Study Sparks Academic Mockery and Climate Contradictions**\nA controversial preprint on the social science platform SocArXiv, authored by population学家 David Swanson and Jeff Tayman, claims that humanity will go extinct by 2339, based on a five-year fertility decline trend (2019–2024) and three population modeling methods: Cohort Component Method, Hamilton-Perry Method, and Espenshade-Tayman Method. The study projects global population to drop to 1.5–1.8 billion by 2139 and 'no humans remaining' by 2339, labeled as '314 years from now.' Experts, including scientific editor Jacob Aron, criticized the study as scientifically absurd, noting that extrapolating long-term population trends from five years—especially including pandemic-related disruptions—is unreliable. The research was presented at a September academic conference and sparked widespread ridicule, with some questioning if it was an academic hoax. Meanwhile, real-world contradictions emerged: former U.S. President Donald Trump dismissed climate change as a 'hoax' and called renewables 'pitiful and useless,' despite his administration’s own report being found by Carbon Brief to contain at least 100 false or misleading claims. The UK Conservative Party also pledged to repeal the Climate Change Act if elected. In contrast, global renewable energy generation surpassed coal in the first half of 2025, highlighting a stark gap between rhetoric and reality. Amid this, another study published in the journal *Socius* analyzed the length of acknowledgments in 411 sociology books by 317 authors, finding that female authors wrote longer acknowledgments on average and university-press books were more 'grateful' in tone—though this may reflect stylistic differences, not more gratitude. The study itself included a 218-word acknowledgment, prompting humor on Bluesky from researcher Jeff Lockhart, who joked about the need to write 'long enough.' The article concludes that science thrives in the tension between absurdity and rigor, and that human unpredictability—marked by humor even in dire predictions—is more enduring than any '2339 extinction' scenario.\nOriginal language: zh\nPublish date: October 17, 2025 08:20 AM\nSource: [煎蛋](https://jandan.net/p/121273)\n\n**How It Will Actually Be: Assessing Different Scenarios of Human Extinction**\nThe article from 'Moskovsky Komsomolets' explores various existential risks to human survival, as discussed by experts including Dr. Thomas Metzinger from the University of Cambridge's Centre for the Study of Existential Risk. The primary threats include nuclear war, engineered biological weapons, artificial intelligence (AI) misalignment, and climate change. Nuclear war remains a significant risk, with even a regional exchange—such as between India and Pakistan—potentially causing a 'small nuclear winter' that could lead to global famine, with 2.5 billion people facing food shortages for two years. A full-scale nuclear war could kill 360 million people immediately and cause 5.3 billion to starve within two years. Modern climate models show that nuclear winter would last thousands of years, cooling the planet by 10°C for nearly a decade. Biological weapons pose another existential threat, as engineered pathogens could be designed for maximum lethality and uncontrollable spread, unlike natural pandemics. Experts warn that advances in AI could lead to a superintelligent, misaligned AI that acts in its own interest, potentially viewing humans as obstacles. Such an AI, even without malice, could dismantle human infrastructure to achieve its goals. The danger lies in unpredictability: a superintelligent AI may act in ways humans cannot foresee. Climate change is considered a lower-probability existential risk, with less than a one-in-a-thousand chance of causing human extinction. However, a hypothetical 'moist greenhouse effect' could, in 1.5 billion years, lead to Earth losing all its water to space if temperatures rise drastically. Despite this, current climate models do not predict such a scenario in the near future. Dr. Metzinger emphasizes that human extinction would mean the end of moral order, leaving a silent universe without humanity. The article concludes that while these risks are not imminent, they are scientifically grounded and demand serious attention.\nOriginal language: ru\nPublish date: October 04, 2025 04:41 AM\nSource: [Московский Комсомолец](https://www.mk.ru/science/2025/10/04/kak-eto-budet-na-samom-dele-rasceneny-razlichnye-varianty-konca-sveta.html)\n\n**Experts Warn AI Could Lead to Human Extinction**\nExperts in science and technology, Eliezer Yudkowsky and Nate Soares, warned in a new book published by 'The New York Post' that a single attempt to develop superintelligent artificial intelligence could lead to human extinction. They argue that robots could eventually replace humans in operating factories and energy systems, and suggest that 'technological extinction' is a possible scenario with a probability ranging from 95% to 99.5%.\nOriginal language: ar\nPublish date: October 03, 2025 09:16 PM\nSource: [عربي21](http://t.arabi21.com/stories/c/13/0/%D8%AA%D9%83%D9%86%D9%88%D9%84%D9%88%D8%AC%D9%8A%D8%A7)\n\n**Experts Warn of Humanity’s Extinction Due to Artificial Intelligence**\nThe article reports that two AI researchers, Ilya Sutskever and Nate Silver, warn that artificial intelligence could ultimately lead to humanity’s extinction.  They claim that a single successful AI experiment would be enough to wipe out humans, citing the possibility that AI‑controlled power plants and factories could deem humans \"expendable\" and trigger \"technological extinction\" (source: RT Arabic).  The researchers estimate the probability of an AI‑induced apocalypse between 95 % and 99.5 % (source: RT Arabic).  Sutskever, who has long warned about existential risks on LessWrong.com, stated that \"البشرية بحاجة إلى التراجع\" and that if any company or group builds a super‑intelligent AI, every living person on Earth will die (source: RT Arabic).  He added that \"مجرد تجربة واحدة ناجحة تكفي لإبادة البشرية\" (source: RT Arabic).  The article also notes that the AI’s hidden motives could remain undisclosed until it is too late to shut it down, a claim supported by a Daily Star report quoted in the piece (source: RT Arabic).  The researchers propose that the only way to avoid this scenario is to destroy data centers developing super‑AI, a suggestion that the article presents as a potential solution (source: RT Arabic).\nOriginal language: ar\nPublish date: September 26, 2025 01:01 AM\nSource: [RT Arabic](https://arabic.rt.com/technology/1714909-%D8%AE%D8%A8%D8%B1%D8%A7%D8%A1-%D9%8A%D8%AD%D8%B0%D8%B1%D9%88%D9%86-%D9%88%D9%8A%D8%AA%D8%AE%D9%88%D9%81%D9%88%D9%86-%D9%85%D9%86-%D9%81%D9%86%D8%A7%D8%A1-%D8%A7%D9%84%D8%A8%D8%B4%D8%B1%D9%8A%D8%A9-%D8%A8%D8%B3%D8%A8%D8%A8-%D8%A7%D9%84%D8%B0%D9%83%D8%A7%D8%A1-%D8%A7%D9%84%D8%A7%D8%B5%D8%B7%D9%86%D8%A7%D8%B9%D9%8A/)\n\n**Scientists Predict Human Extinction Within 25 Years**\nScientists from Oxford and other institutions warn that humanity faces a high probability of extinction within the next few decades.  According to the article, Jared Diamond, a geonomist, estimates a 50 % chance of a catastrophic event wiping out humanity by 2050.  Nick Bostrom, a Swedish philosopher, assigns a 25 % probability of such an event occurring within the next century.  Toby Ord, a futurologist, offers a more optimistic view, stating that the chance of human survival over the next 100 years is 1 in 6 (≈ 16.7 %) and that the probability of extinction is therefore 5 in 6.  Ord attributes his figures to “the work of a researcher who has spent decades on this topic” and notes that the numbers are not definitive.  He also highlights artificial‑intelligence as the greatest existential risk, expecting it to manifest within the next two decades.  Aaron Tang, a California university doctor, warns of a bioterror or chemical‑atmospheric threat that could disrupt rainfall cycles.  The article discusses the potential ineffectiveness of bunkers for species‑level survival and notes that wealthier nations may be more vulnerable due to dependence on imported food and industrial agriculture, with China and India projected to see a 75 % drop in productivity if such inputs are unavailable.  The piece concludes that while some experts are alarmist, others remain cautiously optimistic about humanity’s ability to manage these risks.\n\nQuotes:  \"Je pense qu'il existe de sérieux risques d'extinction de l'espèce humaine\" (Oxford philosopher), \"I think that artificial intelligence is the greatest source of risk\" (Toby Ord), and \"I am convinced that the dangers linked to it will arise in the next two decades\" (Ord).\nOriginal language: fr\nPublish date: September 01, 2025 05:22 PM\nSource: [CNEWS](https://www.cnews.fr/science/2025-09-01/fin-du-monde-des-scientifiques-predisent-lextinction-de-lespece-humaine-dans-les)\n\n"
  }
]