[
  {
    "title": "Extinctions during human era worse than thought | News from Brown",
    "url": "https://archive2.news.brown.edu/2007-2015/articles/2014/09/extinctions.html",
    "snippet": "In absolute, albeit rough, terms the paper calculates a “normal background rate” of extinction of 0.1 extinctions per million species per year."
  },
  {
    "title": "An upper bound for the background rate of human extinction - Nature",
    "url": "https://www.nature.com/articles/s41598-019-47540-7",
    "snippet": "Assuming a 200 thousand year (kyr) survival time, we can be exceptionally confident that rates do not exceed 6.9 × 10−5. This corresponds to an ..."
  },
  {
    "title": "There have been five mass extinctions in Earth's history",
    "url": "https://ourworldindata.org/mass-extinctions",
    "snippet": "There's a natural background rate to the timing and frequency of extinctions: 10% of species are lost every million years, 30% every 10 million ..."
  },
  {
    "title": "Human Population Growth and Extinction",
    "url": "https://www.biologicaldiversity.org/programs/population_and_sustainability/extinction/",
    "snippet": "Harvard biologist E. O. Wilson estimated that 30,000 species per year (or three species per hour) are being driven to extinction. Compare this to the natural ..."
  },
  {
    "title": "Extinction of the human species: What could cause it and how likely ...",
    "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11950659/",
    "snippet": "Human extinction may seem unlikely, but cannot be ruled out as a possibility. We now know that there have been cataclysmic events in the past that might have ..."
  },
  {
    "title": "Extinction Over Time | Smithsonian National Museum of Natural ...",
    "url": "https://naturalhistory.si.edu/education/teaching-resources/paleontology/extinction-over-time",
    "snippet": "At five other times in the past, rates of extinction have soared. These are called mass extinctions, when huge numbers of species disappear in a relatively ..."
  },
  {
    "title": "Humans driving extinctions on scale not seen since dinosaurs ...",
    "url": "https://www.york.ac.uk/news-and-events/news/2025/research/humans-extinction-event/",
    "snippet": "The researchers trace the human impact back around 130,000 years, including the extinction of large animals such as mammoths and giant ground ..."
  },
  {
    "title": "Human ancestors may have almost died out after ancient population ...",
    "url": "https://www.nhm.ac.uk/discover/news/2023/august/human-ancestors-may-have-almost-died-out-ancient-population-crash.html",
    "snippet": "Almost 99% of all human ancestors may have been wiped out around 930,000 years ago, a new paper has claimed. The new research, published in the ..."
  },
  {
    "title": "Human-driven mass extinction is eliminating entire genera",
    "url": "https://news.stanford.edu/stories/2023/09/human-driven-mass-extinction-eliminating-entire-genera",
    "snippet": "Seventy-three genera of land-dwelling vertebrates, Ceballos and Ehrlich found, have gone extinct since 1500 AD. Birds suffered the heaviest ..."
  },
  {
    "title": "Poll: Most Americans Believe Cities Will Be Lost to Rising Sea Levels",
    "url": "https://www.insurancejournal.com/news/national/2026/01/23/855338.htm",
    "snippet": "One-quarter of those polled believe climate change is very or somewhat likely climate change will cause the extinction of the human race."
  },
  {
    "title": "New study shows alarming rate of potential species extinction due to ...",
    "url": "https://today.uconn.edu/experts/expert-spotlight/10331/new-study-shows-alarming-rate-of-potential-species-extinction-due-to-climate-change/",
    "snippet": "Rising temperatures could see one-third of species become extinct by 2100. Business Today. The world is also likely to experience more extreme ..."
  },
  {
    "title": "Meta-analysis of current global warming impacts suggests a third of ...",
    "url": "https://phys.org/news/2024-12-meta-analysis-current-global-impacts.html",
    "snippet": "A biologist at the University of Connecticut has found evidence that up to a third of all species alive today could go extinct by 2100 if greenhouse gas ..."
  },
  {
    "title": "Mathematics predicts a sixth mass extinction | MIT News",
    "url": "https://news.mit.edu/2017/mathematics-predicts-sixth-mass-extinction-0920",
    "snippet": "Daniel Rothman has predicted that the oceans may hold enough carbon to trigger a sixth mass extinction by 2100, reports Trevor Nace for Forbes."
  },
  {
    "title": "Climate crisis could cause new mass extinction, says researcher",
    "url": "https://agenciabrasil.ebc.com.br/en/meio-ambiente/noticia/2025-04/climate-crisis-could-cause-new-mass-extinction-says-researcher",
    "snippet": "If humanity fails to reverse the impacts of climate change, Earth could face a mass extinction event comparable to that of the Permian ..."
  },
  {
    "title": "A third of Earth's species could become extinct by 2100 if climate ...",
    "url": "https://www.livescience.com/planet-earth/climate-change/a-third-of-earths-species-could-become-extinct-by-2100-if-climate-change-isnt-curbed",
    "snippet": "Almost one-third of species around the world would be at risk of extinction by the end of the century if we continue to churn out greenhouse gases, according ..."
  },
  {
    "title": "Human extinction - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Human_extinction",
    "snippet": "On September 11, 2025, Warp News estimated a 20% chance of global catastrophe and a 6% chance of human extinction by 2100. They also estimated a 100% chance ..."
  },
  {
    "title": "Could AI Really Kill Off Humans? - RAND",
    "url": "https://www.rand.org/pubs/commentary/2025/05/could-ai-really-kill-off-humans.html",
    "snippet": "In real-world surveys AI researchers say that they see human extinction as a plausible outcome of AI development."
  },
  {
    "title": "A third of Earth's species could become extinct by 2100 if climate ...",
    "url": "https://www.reddit.com/r/climate/comments/1h7ilwr/a_third_of_earths_species_could_become_extinct_by/",
    "snippet": "The article says that would happen if warming increases by 9.7 F (5.4 C), which is way higher than the likeliest scenarios."
  },
  {
    "title": "AI expert claims there is a 99.9% risk of human extinction coming ...",
    "url": "https://www.uniladtech.com/news/ai-expert-claims-99-percent-risk-human-extinction-673612-20260106",
    "snippet": "AI expert claims there is a 99.9% risk of human extinction coming much sooner than we think · Expert publishes 'doom timeline' and warns AI could ..."
  },
  {
    "title": "Extinction of the human species: What could cause it and how likely ...",
    "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11950659/",
    "snippet": "A recent survey of 2,778 AI authors found that between 37.8% and 51.4% (depending on framing of the question) of respondents gave at least a 10% probability to ..."
  },
  {
    "title": "'Godfather of AI' shortens odds of the technology wiping out ...",
    "url": "https://www.theguardian.com/technology/2024/dec/27/godfather-of-ai-raises-odds-of-the-technology-wiping-out-humanity-over-next-30-years",
    "snippet": "Geoffrey Hinton says there is 10% to 20% chance AI will lead to human extinction in three decades, as change moves fast."
  },
  {
    "title": "Current Estimates for Likelihood of X-Risk? — EA Forum",
    "url": "https://forum.effectivealtruism.org/posts/frYYAAa5K4nHqRCPG/current-estimates-for-likelihood-of-x-risk",
    "snippet": "I've found it to be extremely helpful to give an estimate for the percent chance humanity goes extinct by 2100 (or in 100 years). Right now, I say ~10% or 5-19 ..."
  },
  {
    "title": "Extinction of the human species: What could cause it and how likely ...",
    "url": "https://www.cser.ac.uk/work/extinction-of-the-human-species-what-could-cause-it-and-how-likely-is-it-to-occur/",
    "snippet": "This review provides an overview of potential human extinction causes considered plausible in the current academic literature, experts' ..."
  },
  {
    "title": "Oxford Expert: 10% Chance Humans Extinct in a Century",
    "url": "https://intellectualtakeout.org/2016/05/oxford-expert-10-chance-humans-extinct-in-a-century/",
    "snippet": "Scientists have suggested that the risk is 0.1% per year, and perhaps as much as 0.2%. While this may not seem worthwhile worrying about, these ..."
  },
  {
    "title": "An upper bound for the background rate of human extinction - Nature",
    "url": "https://www.nature.com/articles/s41598-019-47540-7",
    "snippet": "This corresponds to an annual extinction probability below roughly 1 in 14,000. The relative likelihood for such high extinction rates are below ..."
  },
  {
    "title": "Spoiler: Only 5% chance of human extinction because of AI and ...",
    "url": "https://www.linkedin.com/pulse/spoiler-only-5-chance-human-extinction-because-ai-other-stave-phd-ppmee",
    "snippet": "Spoiler: Only 5% chance of human extinction because of AI and other observations on Deep Research capabilities."
  },
  {
    "title": "Do half of AI researchers believe that there's a 10% chance AI will ...",
    "url": "https://aiguide.substack.com/p/do-half-of-ai-researchers-believe",
    "snippet": "In a recent poll, half of A.I. scientists agreed that there was at least a ten-per-cent chance that the human race would be destroyed by A.I.."
  }
]